// SPDX-FileCopyrightText: NONE
//
// SPDX-License-Identifier: CC0-1.0

/* automatically generated by rust-bindgen 0.72.0 */

pub const OPENSSL_SYS_MACOSX: i32 = 1;
pub const OPENSSL_CONFIGURED_API: i32 = 30500;
pub const OPENSSL_VERSION_MAJOR: i32 = 3;
pub const OPENSSL_VERSION_MINOR: i32 = 5;
pub const OPENSSL_VERSION_PATCH: i32 = 0;
pub const OPENSSL_VERSION_PRE_RELEASE: &[u8; 8] = b"-alpha1\0";
pub const OPENSSL_VERSION_BUILD_METADATA: &[u8; 1] = b"\0";
pub const OPENSSL_SHLIB_VERSION: i32 = 3;
pub const OPENSSL_VERSION_STR: &[u8; 6] = b"3.5.0\0";
pub const OPENSSL_FULL_VERSION_STR: &[u8; 13] = b"3.5.0-alpha1\0";
pub const OPENSSL_RELEASE_DATE: &[u8; 12] = b"12 Mar 2025\0";
pub const OPENSSL_VERSION_TEXT: &[u8; 33] = b"OpenSSL 3.5.0-alpha1 12 Mar 2025\0";
pub const _OPENSSL_VERSION_PRE_RELEASE: i32 = 0;
pub const OPENSSL_VERSION_NUMBER: i32 = 810549248;
pub const OPENSSL_API_LEVEL: i32 = 30500;
pub const OSSL_SSIZE_MAX: i64 = 9223372036854775807;
pub const OPENSSL_EC_EXPLICIT_CURVE: i32 = 0;
pub const OPENSSL_EC_NAMED_CURVE: i32 = 1;
pub const EVP_PKEY_ECDH_KDF_NONE: i32 = 1;
pub const EVP_PKEY_ECDH_KDF_X9_63: i32 = 2;
pub const EVP_PKEY_ECDH_KDF_X9_62: i32 = 2;
pub const ASN1_F_A2D_ASN1_OBJECT: i32 = 0;
pub const ASN1_F_A2I_ASN1_INTEGER: i32 = 0;
pub const ASN1_F_A2I_ASN1_STRING: i32 = 0;
pub const ASN1_F_APPEND_EXP: i32 = 0;
pub const ASN1_F_ASN1_BIO_INIT: i32 = 0;
pub const ASN1_F_ASN1_BIT_STRING_SET_BIT: i32 = 0;
pub const ASN1_F_ASN1_CB: i32 = 0;

pub const OSSL_SIGNATURE_PARAM_ALGORITHM_ID: &[u8; 13] = b"algorithm-id\0";
pub const OSSL_SIGNATURE_PARAM_ALGORITHM_ID_PARAMS: &[u8; 20] = b"algorithm-id-params\0";
pub const OSSL_SIGNATURE_PARAM_CONTEXT_STRING: &[u8; 15] = b"context-string\0";
pub const OSSL_SIGNATURE_PARAM_DETERMINISTIC: &[u8; 14] = b"deterministic\0";
pub const OSSL_SIGNATURE_PARAM_DIGEST: &[u8; 7] = b"digest\0";
pub const OSSL_SIGNATURE_PARAM_DIGEST_SIZE: &[u8; 12] = b"digest-size\0";
pub const OSSL_SIGNATURE_PARAM_FIPS_APPROVED_INDICATOR: &[u8; 15] = b"fips-indicator\0";
pub const OSSL_SIGNATURE_PARAM_FIPS_DIGEST_CHECK: &[u8; 13] = b"digest-check\0";
pub const OSSL_SIGNATURE_PARAM_FIPS_KEY_CHECK: &[u8; 10] = b"key-check\0";
pub const OSSL_SIGNATURE_PARAM_FIPS_RSA_PSS_SALTLEN_CHECK: &[u8; 22] = b"rsa-pss-saltlen-check\0";
pub const OSSL_SIGNATURE_PARAM_FIPS_SIGN_CHECK: &[u8; 11] = b"sign-check\0";
pub const OSSL_SIGNATURE_PARAM_FIPS_SIGN_X931_PAD_CHECK: &[u8; 20] = b"sign-x931-pad-check\0";
pub const OSSL_SIGNATURE_PARAM_FIPS_VERIFY_MESSAGE: &[u8; 15] = b"verify-message\0";
pub const OSSL_SIGNATURE_PARAM_INSTANCE: &[u8; 9] = b"instance\0";
pub const OSSL_SIGNATURE_PARAM_KAT: &[u8; 4] = b"kat\0";
pub const OSSL_SIGNATURE_PARAM_MESSAGE_ENCODING: &[u8; 17] = b"message-encoding\0";
pub const OSSL_SIGNATURE_PARAM_MGF1_DIGEST: &[u8; 12] = b"mgf1-digest\0";
pub const OSSL_SIGNATURE_PARAM_MGF1_PROPERTIES: &[u8; 16] = b"mgf1-properties\0";
pub const OSSL_SIGNATURE_PARAM_MU: &[u8; 3] = b"mu\0";
pub const OSSL_SIGNATURE_PARAM_NONCE_TYPE: &[u8; 11] = b"nonce-type\0";
pub const OSSL_SIGNATURE_PARAM_PAD_MODE: &[u8; 9] = b"pad-mode\0";
pub const OSSL_SIGNATURE_PARAM_PROPERTIES: &[u8; 11] = b"properties\0";
pub const OSSL_SIGNATURE_PARAM_PSS_SALTLEN: &[u8; 8] = b"saltlen\0";
pub const OSSL_SIGNATURE_PARAM_SIGNATURE: &[u8; 10] = b"signature\0";
pub const OSSL_SIGNATURE_PARAM_TEST_ENTROPY: &[u8; 13] = b"test-entropy\0";
pub const OSSL_SKEY_PARAM_KEY_LENGTH: &[u8; 11] = b"key-length\0";
pub const OSSL_SKEY_PARAM_RAW_BYTES: &[u8; 10] = b"raw-bytes\0";
pub const OSSL_STORE_PARAM_ALIAS: &[u8; 6] = b"alias\0";
pub const OSSL_STORE_PARAM_DIGEST: &[u8; 7] = b"digest\0";
pub const OSSL_STORE_PARAM_EXPECT: &[u8; 7] = b"expect\0";
pub const OSSL_STORE_PARAM_FINGERPRINT: &[u8; 12] = b"fingerprint\0";
pub const OSSL_STORE_PARAM_INPUT_TYPE: &[u8; 11] = b"input-type\0";
pub const OSSL_STORE_PARAM_ISSUER: &[u8; 5] = b"name\0";
pub const OSSL_STORE_PARAM_PROPERTIES: &[u8; 11] = b"properties\0";
pub const OSSL_STORE_PARAM_SERIAL: &[u8; 7] = b"serial\0";
pub const OSSL_STORE_PARAM_SUBJECT: &[u8; 8] = b"subject\0";
pub type __darwin_time_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
impl Default for __darwin_pthread_handler_rec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
impl Default for _opaque_pthread_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type time_t = __darwin_time_t;
pub type pthread_once_t = __darwin_pthread_once_t;
pub type pthread_t = __darwin_pthread_t;
pub type pthread_key_t = __darwin_pthread_key_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type ossl_intmax_t = intmax_t;
pub type ossl_uintmax_t = uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st {
    _unused: [u8; 0],
}
pub type OPENSSL_STACK = stack_st;
pub type OPENSSL_sk_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OPENSSL_sk_freefunc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
pub type OPENSSL_sk_copyfunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
unsafe extern "C" {
    pub fn OPENSSL_sk_num(arg1: *const OPENSSL_STACK) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_value(
        arg1: *const OPENSSL_STACK,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_set(
        st: *mut OPENSSL_STACK,
        i: ::std::os::raw::c_int,
        data: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_new(cmp: OPENSSL_sk_compfunc) -> *mut OPENSSL_STACK;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_new_null() -> *mut OPENSSL_STACK;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_new_reserve(
        c: OPENSSL_sk_compfunc,
        n: ::std::os::raw::c_int,
    ) -> *mut OPENSSL_STACK;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_reserve(
        st: *mut OPENSSL_STACK,
        n: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_free(arg1: *mut OPENSSL_STACK);
}
unsafe extern "C" {
    pub fn OPENSSL_sk_pop_free(
        st: *mut OPENSSL_STACK,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    );
}
unsafe extern "C" {
    pub fn OPENSSL_sk_deep_copy(
        arg1: *const OPENSSL_STACK,
        c: OPENSSL_sk_copyfunc,
        f: OPENSSL_sk_freefunc,
    ) -> *mut OPENSSL_STACK;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_insert(
        sk: *mut OPENSSL_STACK,
        data: *const ::std::os::raw::c_void,
        where_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_delete(
        st: *mut OPENSSL_STACK,
        loc: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_delete_ptr(
        st: *mut OPENSSL_STACK,
        p: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_find(
        st: *mut OPENSSL_STACK,
        data: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_find_ex(
        st: *mut OPENSSL_STACK,
        data: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_find_all(
        st: *mut OPENSSL_STACK,
        data: *const ::std::os::raw::c_void,
        pnum: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_push(
        st: *mut OPENSSL_STACK,
        data: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_unshift(
        st: *mut OPENSSL_STACK,
        data: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_shift(st: *mut OPENSSL_STACK) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_pop(st: *mut OPENSSL_STACK) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_zero(st: *mut OPENSSL_STACK);
}
unsafe extern "C" {
    pub fn OPENSSL_sk_set_cmp_func(
        sk: *mut OPENSSL_STACK,
        cmp: OPENSSL_sk_compfunc,
    ) -> OPENSSL_sk_compfunc;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_dup(st: *const OPENSSL_STACK) -> *mut OPENSSL_STACK;
}
unsafe extern "C" {
    pub fn OPENSSL_sk_sort(st: *mut OPENSSL_STACK);
}
unsafe extern "C" {
    pub fn OPENSSL_sk_is_sorted(st: *const OPENSSL_STACK) -> ::std::os::raw::c_int;
}
pub type OPENSSL_STRING = *mut ::std::os::raw::c_char;
pub type OPENSSL_CSTRING = *const ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_OPENSSL_STRING {
    _unused: [u8; 0],
}
pub type sk_OPENSSL_STRING_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ::std::os::raw::c_char,
        b: *const *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_OPENSSL_STRING_freefunc =
    ::std::option::Option<unsafe extern "C" fn(a: *mut ::std::os::raw::c_char)>;
pub type sk_OPENSSL_STRING_copyfunc = ::std::option::Option<
    unsafe extern "C" fn(a: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_OPENSSL_CSTRING {
    _unused: [u8; 0],
}
pub type sk_OPENSSL_CSTRING_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ::std::os::raw::c_char,
        b: *const *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_OPENSSL_CSTRING_freefunc =
    ::std::option::Option<unsafe extern "C" fn(a: *mut ::std::os::raw::c_char)>;
pub type sk_OPENSSL_CSTRING_copyfunc = ::std::option::Option<
    unsafe extern "C" fn(a: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char,
>;
pub type OPENSSL_BLOCK = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_OPENSSL_BLOCK {
    _unused: [u8; 0],
}
pub type sk_OPENSSL_BLOCK_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ::std::os::raw::c_void,
        b: *const *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_OPENSSL_BLOCK_freefunc =
    ::std::option::Option<unsafe extern "C" fn(a: *mut ::std::os::raw::c_void)>;
pub type sk_OPENSSL_BLOCK_copyfunc = ::std::option::Option<
    unsafe extern "C" fn(a: *const ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_provider_st {
    _unused: [u8; 0],
}
pub type OSSL_PROVIDER = ossl_provider_st;
pub type ASN1_INTEGER = asn1_string_st;
pub type ASN1_ENUMERATED = asn1_string_st;
pub type ASN1_BIT_STRING = asn1_string_st;
pub type ASN1_OCTET_STRING = asn1_string_st;
pub type ASN1_PRINTABLESTRING = asn1_string_st;
pub type ASN1_T61STRING = asn1_string_st;
pub type ASN1_IA5STRING = asn1_string_st;
pub type ASN1_GENERALSTRING = asn1_string_st;
pub type ASN1_UNIVERSALSTRING = asn1_string_st;
pub type ASN1_BMPSTRING = asn1_string_st;
pub type ASN1_UTCTIME = asn1_string_st;
pub type ASN1_TIME = asn1_string_st;
pub type ASN1_GENERALIZEDTIME = asn1_string_st;
pub type ASN1_VISIBLESTRING = asn1_string_st;
pub type ASN1_UTF8STRING = asn1_string_st;
pub type ASN1_STRING = asn1_string_st;
pub type ASN1_BOOLEAN = ::std::os::raw::c_int;
pub type ASN1_NULL = ::std::os::raw::c_int;
pub type ASN1_TYPE = asn1_type_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_object_st {
    _unused: [u8; 0],
}
pub type ASN1_OBJECT = asn1_object_st;
pub type ASN1_STRING_TABLE = asn1_string_table_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_ITEM_st {
    _unused: [u8; 0],
}
pub type ASN1_ITEM = ASN1_ITEM_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_pctx_st {
    _unused: [u8; 0],
}
pub type ASN1_PCTX = asn1_pctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_sctx_st {
    _unused: [u8; 0],
}
pub type ASN1_SCTX = asn1_sctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bio_st {
    _unused: [u8; 0],
}
pub type BIO = bio_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bignum_st {
    _unused: [u8; 0],
}
pub type BIGNUM = bignum_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bignum_ctx {
    _unused: [u8; 0],
}
pub type BN_CTX = bignum_ctx;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_blinding_st {
    _unused: [u8; 0],
}
pub type BN_BLINDING = bn_blinding_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_mont_ctx_st {
    _unused: [u8; 0],
}
pub type BN_MONT_CTX = bn_mont_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_recp_ctx_st {
    _unused: [u8; 0],
}
pub type BN_RECP_CTX = bn_recp_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bn_gencb_st {
    _unused: [u8; 0],
}
pub type BN_GENCB = bn_gencb_st;
pub type BUF_MEM = buf_mem_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_BIGNUM {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_BIGNUM_const {
    _unused: [u8; 0],
}
pub type ERR_STATE = err_state_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_cipher_st {
    _unused: [u8; 0],
}
pub type EVP_CIPHER = evp_cipher_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_cipher_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_CIPHER_CTX = evp_cipher_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_md_st {
    _unused: [u8; 0],
}
pub type EVP_MD = evp_md_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_md_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_MD_CTX = evp_md_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_mac_st {
    _unused: [u8; 0],
}
pub type EVP_MAC = evp_mac_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_mac_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_MAC_CTX = evp_mac_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY = evp_pkey_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_skey_st {
    _unused: [u8; 0],
}
pub type EVP_SKEY = evp_skey_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_asn1_method_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY_ASN1_METHOD = evp_pkey_asn1_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_method_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY_METHOD = evp_pkey_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_pkey_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_PKEY_CTX = evp_pkey_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_keymgmt_st {
    _unused: [u8; 0],
}
pub type EVP_KEYMGMT = evp_keymgmt_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_kdf_st {
    _unused: [u8; 0],
}
pub type EVP_KDF = evp_kdf_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_kdf_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_KDF_CTX = evp_kdf_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_rand_st {
    _unused: [u8; 0],
}
pub type EVP_RAND = evp_rand_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_rand_ctx_st {
    _unused: [u8; 0],
}
pub type EVP_RAND_CTX = evp_rand_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_keyexch_st {
    _unused: [u8; 0],
}
pub type EVP_KEYEXCH = evp_keyexch_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_signature_st {
    _unused: [u8; 0],
}
pub type EVP_SIGNATURE = evp_signature_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_skeymgmt_st {
    _unused: [u8; 0],
}
pub type EVP_SKEYMGMT = evp_skeymgmt_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_asym_cipher_st {
    _unused: [u8; 0],
}
pub type EVP_ASYM_CIPHER = evp_asym_cipher_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_kem_st {
    _unused: [u8; 0],
}
pub type EVP_KEM = evp_kem_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evp_Encode_Ctx_st {
    _unused: [u8; 0],
}
pub type EVP_ENCODE_CTX = evp_Encode_Ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hmac_ctx_st {
    _unused: [u8; 0],
}
pub type HMAC_CTX = hmac_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dh_st {
    _unused: [u8; 0],
}
pub type DH = dh_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dh_method {
    _unused: [u8; 0],
}
pub type DH_METHOD = dh_method;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsa_st {
    _unused: [u8; 0],
}
pub type DSA = dsa_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsa_method {
    _unused: [u8; 0],
}
pub type DSA_METHOD = dsa_method;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rsa_st {
    _unused: [u8; 0],
}
pub type RSA = rsa_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rsa_meth_st {
    _unused: [u8; 0],
}
pub type RSA_METHOD = rsa_meth_st;
pub type RSA_PSS_PARAMS = rsa_pss_params_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_key_st {
    _unused: [u8; 0],
}
pub type EC_KEY = ec_key_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_key_method_st {
    _unused: [u8; 0],
}
pub type EC_KEY_METHOD = ec_key_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rand_meth_st {
    _unused: [u8; 0],
}
pub type RAND_METHOD = rand_meth_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rand_drbg_st {
    _unused: [u8; 0],
}
pub type RAND_DRBG = rand_drbg_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_dane_st {
    _unused: [u8; 0],
}
pub type SSL_DANE = ssl_dane_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_st {
    _unused: [u8; 0],
}
pub type X509 = x509_st;
pub type X509_ALGOR = X509_algor_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_crl_st {
    _unused: [u8; 0],
}
pub type X509_CRL = X509_crl_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_crl_method_st {
    _unused: [u8; 0],
}
pub type X509_CRL_METHOD = x509_crl_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_revoked_st {
    _unused: [u8; 0],
}
pub type X509_REVOKED = x509_revoked_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_name_st {
    _unused: [u8; 0],
}
pub type X509_NAME = X509_name_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_pubkey_st {
    _unused: [u8; 0],
}
pub type X509_PUBKEY = X509_pubkey_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_store_st {
    _unused: [u8; 0],
}
pub type X509_STORE = x509_store_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_store_ctx_st {
    _unused: [u8; 0],
}
pub type X509_STORE_CTX = x509_store_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_object_st {
    _unused: [u8; 0],
}
pub type X509_OBJECT = x509_object_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_lookup_st {
    _unused: [u8; 0],
}
pub type X509_LOOKUP = x509_lookup_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_lookup_method_st {
    _unused: [u8; 0],
}
pub type X509_LOOKUP_METHOD = x509_lookup_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_VERIFY_PARAM_st {
    _unused: [u8; 0],
}
pub type X509_VERIFY_PARAM = X509_VERIFY_PARAM_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct x509_sig_info_st {
    _unused: [u8; 0],
}
pub type X509_SIG_INFO = x509_sig_info_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pkcs8_priv_key_info_st {
    _unused: [u8; 0],
}
pub type PKCS8_PRIV_KEY_INFO = pkcs8_priv_key_info_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct v3_ext_ctx {
    _unused: [u8; 0],
}
pub type X509V3_CTX = v3_ext_ctx;
pub type CONF = conf_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_init_settings_st {
    _unused: [u8; 0],
}
pub type OPENSSL_INIT_SETTINGS = ossl_init_settings_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ui_st {
    _unused: [u8; 0],
}
pub type UI = ui_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ui_method_st {
    _unused: [u8; 0],
}
pub type UI_METHOD = ui_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct engine_st {
    _unused: [u8; 0],
}
pub type ENGINE = engine_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_st {
    _unused: [u8; 0],
}
pub type SSL = ssl_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ssl_ctx_st {
    _unused: [u8; 0],
}
pub type SSL_CTX = ssl_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct comp_ctx_st {
    _unused: [u8; 0],
}
pub type COMP_CTX = comp_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct comp_method_st {
    _unused: [u8; 0],
}
pub type COMP_METHOD = comp_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_POLICY_NODE_st {
    _unused: [u8; 0],
}
pub type X509_POLICY_NODE = X509_POLICY_NODE_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_POLICY_LEVEL_st {
    _unused: [u8; 0],
}
pub type X509_POLICY_LEVEL = X509_POLICY_LEVEL_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_POLICY_TREE_st {
    _unused: [u8; 0],
}
pub type X509_POLICY_TREE = X509_POLICY_TREE_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X509_POLICY_CACHE_st {
    _unused: [u8; 0],
}
pub type X509_POLICY_CACHE = X509_POLICY_CACHE_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AUTHORITY_KEYID_st {
    _unused: [u8; 0],
}
pub type AUTHORITY_KEYID = AUTHORITY_KEYID_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DIST_POINT_st {
    _unused: [u8; 0],
}
pub type DIST_POINT = DIST_POINT_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISSUING_DIST_POINT_st {
    _unused: [u8; 0],
}
pub type ISSUING_DIST_POINT = ISSUING_DIST_POINT_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NAME_CONSTRAINTS_st {
    _unused: [u8; 0],
}
pub type NAME_CONSTRAINTS = NAME_CONSTRAINTS_st;
pub type CRYPTO_EX_DATA = crypto_ex_data_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_http_req_ctx_st {
    _unused: [u8; 0],
}
pub type OSSL_HTTP_REQ_CTX = ossl_http_req_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ocsp_response_st {
    _unused: [u8; 0],
}
pub type OCSP_RESPONSE = ocsp_response_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ocsp_responder_id_st {
    _unused: [u8; 0],
}
pub type OCSP_RESPID = ocsp_responder_id_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sct_st {
    _unused: [u8; 0],
}
pub type SCT = sct_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sct_ctx_st {
    _unused: [u8; 0],
}
pub type SCT_CTX = sct_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ctlog_st {
    _unused: [u8; 0],
}
pub type CTLOG = ctlog_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ctlog_store_st {
    _unused: [u8; 0],
}
pub type CTLOG_STORE = ctlog_store_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ct_policy_eval_ctx_st {
    _unused: [u8; 0],
}
pub type CT_POLICY_EVAL_CTX = ct_policy_eval_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_store_info_st {
    _unused: [u8; 0],
}
pub type OSSL_STORE_INFO = ossl_store_info_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_store_search_st {
    _unused: [u8; 0],
}
pub type OSSL_STORE_SEARCH = ossl_store_search_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_lib_ctx_st {
    _unused: [u8; 0],
}
pub type OSSL_LIB_CTX = ossl_lib_ctx_st;
pub type OSSL_DISPATCH = ossl_dispatch_st;
pub type OSSL_ITEM = ossl_item_st;
pub type OSSL_ALGORITHM = ossl_algorithm_st;
pub type OSSL_PARAM = ossl_param_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_param_bld_st {
    _unused: [u8; 0],
}
pub type OSSL_PARAM_BLD = ossl_param_bld_st;
pub type pem_password_cb = ::std::option::Option<
    unsafe extern "C" fn(
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
        rwflag: ::std::os::raw::c_int,
        userdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_encoder_st {
    _unused: [u8; 0],
}
pub type OSSL_ENCODER = ossl_encoder_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_encoder_ctx_st {
    _unused: [u8; 0],
}
pub type OSSL_ENCODER_CTX = ossl_encoder_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_decoder_st {
    _unused: [u8; 0],
}
pub type OSSL_DECODER = ossl_decoder_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_decoder_ctx_st {
    _unused: [u8; 0],
}
pub type OSSL_DECODER_CTX = ossl_decoder_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_self_test_st {
    _unused: [u8; 0],
}
pub type OSSL_SELF_TEST = ossl_self_test_st;
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_ec_paramgen_curve_nid(
        ctx: *mut EVP_PKEY_CTX,
        nid: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_ec_param_enc(
        ctx: *mut EVP_PKEY_CTX,
        param_enc: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_ecdh_cofactor_mode(
        ctx: *mut EVP_PKEY_CTX,
        cofactor_mode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get_ecdh_cofactor_mode(ctx: *mut EVP_PKEY_CTX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_ecdh_kdf_type(
        ctx: *mut EVP_PKEY_CTX,
        kdf: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get_ecdh_kdf_type(ctx: *mut EVP_PKEY_CTX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_ecdh_kdf_md(
        ctx: *mut EVP_PKEY_CTX,
        md: *const EVP_MD,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get_ecdh_kdf_md(
        ctx: *mut EVP_PKEY_CTX,
        md: *mut *const EVP_MD,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set_ecdh_kdf_outlen(
        ctx: *mut EVP_PKEY_CTX,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get_ecdh_kdf_outlen(
        ctx: *mut EVP_PKEY_CTX,
        len: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_set0_ecdh_kdf_ukm(
        ctx: *mut EVP_PKEY_CTX,
        ukm: *mut ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EVP_PKEY_CTX_get0_ecdh_kdf_ukm(
        ctx: *mut EVP_PKEY_CTX,
        ukm: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
#[repr(u32)]
#[doc = " Enum for the point conversion form as defined in X9.62 (ECDSA)\n  for the encoding of a elliptic curve point (x,y)"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum point_conversion_form_t {
    #[doc = " the point is encoded as z||x, where the octet z specifies\n  which solution of the quadratic equation y is"]
    POINT_CONVERSION_COMPRESSED = 2,
    #[doc = " the point is encoded as z||x||y, where z is the octet 0x04"]
    POINT_CONVERSION_UNCOMPRESSED = 4,
    #[doc = " the point is encoded as z||x||y, where the octet z specifies\n  which solution of the quadratic equation y is"]
    POINT_CONVERSION_HYBRID = 6,
}
unsafe extern "C" {
    pub fn OSSL_EC_curve_nid2name(nid: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
impl Default for tm {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type va_list = __builtin_va_list;
unsafe extern "C" {
    pub fn ERR_load_ASN1_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_ASYNC_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_BIO_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_BN_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_BUF_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_CMS_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_COMP_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_CONF_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_CRYPTO_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_CT_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_DH_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_DSA_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_EC_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_ENGINE_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_ERR_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_EVP_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_KDF_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_OBJ_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_OCSP_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_PEM_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_PKCS12_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_PKCS7_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_RAND_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_RSA_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_OSSL_STORE_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_TS_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_UI_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_X509_strings() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ERR_load_X509V3_strings() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_core_handle_st {
    _unused: [u8; 0],
}
pub type OSSL_CORE_HANDLE = ossl_core_handle_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct openssl_core_ctx_st {
    _unused: [u8; 0],
}
pub type OPENSSL_CORE_CTX = openssl_core_ctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ossl_core_bio_st {
    _unused: [u8; 0],
}
pub type OSSL_CORE_BIO = ossl_core_bio_st;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct ossl_dispatch_st {
    pub function_id: ::std::os::raw::c_int,
    pub function: ::std::option::Option<unsafe extern "C" fn()>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ossl_dispatch_st"][::std::mem::size_of::<ossl_dispatch_st>() - 16usize];
    ["Alignment of ossl_dispatch_st"][::std::mem::align_of::<ossl_dispatch_st>() - 8usize];
    ["Offset of field: ossl_dispatch_st::function_id"]
        [::std::mem::offset_of!(ossl_dispatch_st, function_id) - 0usize];
    ["Offset of field: ossl_dispatch_st::function"]
        [::std::mem::offset_of!(ossl_dispatch_st, function) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct ossl_item_st {
    pub id: ::std::os::raw::c_uint,
    pub ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ossl_item_st"][::std::mem::size_of::<ossl_item_st>() - 16usize];
    ["Alignment of ossl_item_st"][::std::mem::align_of::<ossl_item_st>() - 8usize];
    ["Offset of field: ossl_item_st::id"][::std::mem::offset_of!(ossl_item_st, id) - 0usize];
    ["Offset of field: ossl_item_st::ptr"][::std::mem::offset_of!(ossl_item_st, ptr) - 8usize];
};
impl Default for ossl_item_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct ossl_algorithm_st {
    pub algorithm_names: *const ::std::os::raw::c_char,
    pub property_definition: *const ::std::os::raw::c_char,
    pub implementation: *const OSSL_DISPATCH,
    pub algorithm_description: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ossl_algorithm_st"][::std::mem::size_of::<ossl_algorithm_st>() - 32usize];
    ["Alignment of ossl_algorithm_st"][::std::mem::align_of::<ossl_algorithm_st>() - 8usize];
    ["Offset of field: ossl_algorithm_st::algorithm_names"]
        [::std::mem::offset_of!(ossl_algorithm_st, algorithm_names) - 0usize];
    ["Offset of field: ossl_algorithm_st::property_definition"]
        [::std::mem::offset_of!(ossl_algorithm_st, property_definition) - 8usize];
    ["Offset of field: ossl_algorithm_st::implementation"]
        [::std::mem::offset_of!(ossl_algorithm_st, implementation) - 16usize];
    ["Offset of field: ossl_algorithm_st::algorithm_description"]
        [::std::mem::offset_of!(ossl_algorithm_st, algorithm_description) - 24usize];
};
impl Default for ossl_algorithm_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct ossl_param_st {
    pub key: *const ::std::os::raw::c_char,
    pub data_type: ::std::os::raw::c_uint,
    pub data: *mut ::std::os::raw::c_void,
    pub data_size: usize,
    pub return_size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ossl_param_st"][::std::mem::size_of::<ossl_param_st>() - 40usize];
    ["Alignment of ossl_param_st"][::std::mem::align_of::<ossl_param_st>() - 8usize];
    ["Offset of field: ossl_param_st::key"][::std::mem::offset_of!(ossl_param_st, key) - 0usize];
    ["Offset of field: ossl_param_st::data_type"]
        [::std::mem::offset_of!(ossl_param_st, data_type) - 8usize];
    ["Offset of field: ossl_param_st::data"][::std::mem::offset_of!(ossl_param_st, data) - 16usize];
    ["Offset of field: ossl_param_st::data_size"]
        [::std::mem::offset_of!(ossl_param_st, data_size) - 24usize];
    ["Offset of field: ossl_param_st::return_size"]
        [::std::mem::offset_of!(ossl_param_st, return_size) - 32usize];
};
impl Default for ossl_param_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type OSSL_thread_stop_handler_fn =
    ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>;
pub type OSSL_provider_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        in_: *const OSSL_DISPATCH,
        out: *mut *const OSSL_DISPATCH,
        provctx: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn OSSL_provider_init(
        handle: *const OSSL_CORE_HANDLE,
        in_: *const OSSL_DISPATCH,
        out: *mut *const OSSL_DISPATCH,
        provctx: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
pub type OSSL_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        params: *const OSSL_PARAM,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_INOUT_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        in_params: *const OSSL_PARAM,
        out_params: *mut OSSL_PARAM,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_PASSPHRASE_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        pass: *mut ::std::os::raw::c_char,
        pass_size: usize,
        pass_len: *mut usize,
        params: *const OSSL_PARAM,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct CRYPTO_dynlock {
    pub dummy: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CRYPTO_dynlock"][::std::mem::size_of::<CRYPTO_dynlock>() - 4usize];
    ["Alignment of CRYPTO_dynlock"][::std::mem::align_of::<CRYPTO_dynlock>() - 4usize];
    ["Offset of field: CRYPTO_dynlock::dummy"]
        [::std::mem::offset_of!(CRYPTO_dynlock, dummy) - 0usize];
};
pub type CRYPTO_RWLOCK = ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn CRYPTO_THREAD_lock_new() -> *mut CRYPTO_RWLOCK;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_read_lock(lock: *mut CRYPTO_RWLOCK) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_write_lock(lock: *mut CRYPTO_RWLOCK) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_unlock(lock: *mut CRYPTO_RWLOCK) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_lock_free(lock: *mut CRYPTO_RWLOCK);
}
unsafe extern "C" {
    pub fn CRYPTO_atomic_add(
        val: *mut ::std::os::raw::c_int,
        amount: ::std::os::raw::c_int,
        ret: *mut ::std::os::raw::c_int,
        lock: *mut CRYPTO_RWLOCK,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_atomic_add64(
        val: *mut u64,
        op: u64,
        ret: *mut u64,
        lock: *mut CRYPTO_RWLOCK,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_atomic_and(
        val: *mut u64,
        op: u64,
        ret: *mut u64,
        lock: *mut CRYPTO_RWLOCK,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_atomic_or(
        val: *mut u64,
        op: u64,
        ret: *mut u64,
        lock: *mut CRYPTO_RWLOCK,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_atomic_load(
        val: *mut u64,
        ret: *mut u64,
        lock: *mut CRYPTO_RWLOCK,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_atomic_load_int(
        val: *mut ::std::os::raw::c_int,
        ret: *mut ::std::os::raw::c_int,
        lock: *mut CRYPTO_RWLOCK,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_atomic_store(
        dst: *mut u64,
        val: u64,
        lock: *mut CRYPTO_RWLOCK,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_strlcpy(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        siz: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_strlcat(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        siz: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_strnlen(str_: *const ::std::os::raw::c_char, maxlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_strtoul(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *mut ::std::os::raw::c_char,
        base: ::std::os::raw::c_int,
        num: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_buf2hexstr_ex(
        str_: *mut ::std::os::raw::c_char,
        str_n: usize,
        strlength: *mut usize,
        buf: *const ::std::os::raw::c_uchar,
        buflen: usize,
        sep: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_buf2hexstr(
        buf: *const ::std::os::raw::c_uchar,
        buflen: ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn OPENSSL_hexstr2buf_ex(
        buf: *mut ::std::os::raw::c_uchar,
        buf_n: usize,
        buflen: *mut usize,
        str_: *const ::std::os::raw::c_char,
        sep: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_hexstr2buf(
        str_: *const ::std::os::raw::c_char,
        buflen: *mut ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn OPENSSL_hexchar2int(c: ::std::os::raw::c_uchar) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_strcasecmp(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_strncasecmp(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
        n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_version_major() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn OPENSSL_version_minor() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn OPENSSL_version_patch() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn OPENSSL_version_pre_release() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn OPENSSL_version_build_metadata() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn OpenSSL_version_num() -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn OpenSSL_version(type_: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn OPENSSL_info(type_: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn OPENSSL_issetugid() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct crypto_ex_data_st {
    pub ctx: *mut OSSL_LIB_CTX,
    pub sk: *mut stack_st_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crypto_ex_data_st"][::std::mem::size_of::<crypto_ex_data_st>() - 16usize];
    ["Alignment of crypto_ex_data_st"][::std::mem::align_of::<crypto_ex_data_st>() - 8usize];
    ["Offset of field: crypto_ex_data_st::ctx"]
        [::std::mem::offset_of!(crypto_ex_data_st, ctx) - 0usize];
    ["Offset of field: crypto_ex_data_st::sk"]
        [::std::mem::offset_of!(crypto_ex_data_st, sk) - 8usize];
};
impl Default for crypto_ex_data_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_void {
    _unused: [u8; 0],
}
pub type sk_void_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ::std::os::raw::c_void,
        b: *const *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_void_freefunc =
    ::std::option::Option<unsafe extern "C" fn(a: *mut ::std::os::raw::c_void)>;
pub type sk_void_copyfunc = ::std::option::Option<
    unsafe extern "C" fn(a: *const ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type CRYPTO_EX_new = ::std::option::Option<
    unsafe extern "C" fn(
        parent: *mut ::std::os::raw::c_void,
        ptr: *mut ::std::os::raw::c_void,
        ad: *mut CRYPTO_EX_DATA,
        idx: ::std::os::raw::c_int,
        argl: ::std::os::raw::c_long,
        argp: *mut ::std::os::raw::c_void,
    ),
>;
pub type CRYPTO_EX_free = ::std::option::Option<
    unsafe extern "C" fn(
        parent: *mut ::std::os::raw::c_void,
        ptr: *mut ::std::os::raw::c_void,
        ad: *mut CRYPTO_EX_DATA,
        idx: ::std::os::raw::c_int,
        argl: ::std::os::raw::c_long,
        argp: *mut ::std::os::raw::c_void,
    ),
>;
pub type CRYPTO_EX_dup = ::std::option::Option<
    unsafe extern "C" fn(
        to: *mut CRYPTO_EX_DATA,
        from: *const CRYPTO_EX_DATA,
        from_d: *mut *mut ::std::os::raw::c_void,
        idx: ::std::os::raw::c_int,
        argl: ::std::os::raw::c_long,
        argp: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn CRYPTO_get_ex_new_index(
        class_index: ::std::os::raw::c_int,
        argl: ::std::os::raw::c_long,
        argp: *mut ::std::os::raw::c_void,
        new_func: CRYPTO_EX_new,
        dup_func: CRYPTO_EX_dup,
        free_func: CRYPTO_EX_free,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_free_ex_index(
        class_index: ::std::os::raw::c_int,
        idx: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_new_ex_data(
        class_index: ::std::os::raw::c_int,
        obj: *mut ::std::os::raw::c_void,
        ad: *mut CRYPTO_EX_DATA,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_dup_ex_data(
        class_index: ::std::os::raw::c_int,
        to: *mut CRYPTO_EX_DATA,
        from: *const CRYPTO_EX_DATA,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_free_ex_data(
        class_index: ::std::os::raw::c_int,
        obj: *mut ::std::os::raw::c_void,
        ad: *mut CRYPTO_EX_DATA,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_alloc_ex_data(
        class_index: ::std::os::raw::c_int,
        obj: *mut ::std::os::raw::c_void,
        ad: *mut CRYPTO_EX_DATA,
        idx: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_set_ex_data(
        ad: *mut CRYPTO_EX_DATA,
        idx: ::std::os::raw::c_int,
        val: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_get_ex_data(
        ad: *const CRYPTO_EX_DATA,
        idx: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct crypto_threadid_st {
    pub dummy: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crypto_threadid_st"][::std::mem::size_of::<crypto_threadid_st>() - 4usize];
    ["Alignment of crypto_threadid_st"][::std::mem::align_of::<crypto_threadid_st>() - 4usize];
    ["Offset of field: crypto_threadid_st::dummy"]
        [::std::mem::offset_of!(crypto_threadid_st, dummy) - 0usize];
};
pub type CRYPTO_THREADID = crypto_threadid_st;
pub type CRYPTO_malloc_fn = ::std::option::Option<
    unsafe extern "C" fn(
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type CRYPTO_realloc_fn = ::std::option::Option<
    unsafe extern "C" fn(
        addr: *mut ::std::os::raw::c_void,
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type CRYPTO_free_fn = ::std::option::Option<
    unsafe extern "C" fn(
        addr: *mut ::std::os::raw::c_void,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ),
>;
unsafe extern "C" {
    pub fn CRYPTO_set_mem_functions(
        malloc_fn: CRYPTO_malloc_fn,
        realloc_fn: CRYPTO_realloc_fn,
        free_fn: CRYPTO_free_fn,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_get_mem_functions(
        malloc_fn: *mut CRYPTO_malloc_fn,
        realloc_fn: *mut CRYPTO_realloc_fn,
        free_fn: *mut CRYPTO_free_fn,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_malloc(
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_zalloc(
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_aligned_alloc(
        num: usize,
        align: usize,
        freeptr: *mut *mut ::std::os::raw::c_void,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_memdup(
        str_: *const ::std::os::raw::c_void,
        siz: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_strdup(
        str_: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn CRYPTO_strndup(
        str_: *const ::std::os::raw::c_char,
        s: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn CRYPTO_free(
        ptr: *mut ::std::os::raw::c_void,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_clear_free(
        ptr: *mut ::std::os::raw::c_void,
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_realloc(
        addr: *mut ::std::os::raw::c_void,
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_clear_realloc(
        addr: *mut ::std::os::raw::c_void,
        old_num: usize,
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_malloc_init(sz: usize, minsize: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_malloc_done() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_malloc(
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_zalloc(
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_free(
        ptr: *mut ::std::os::raw::c_void,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_secure_clear_free(
        ptr: *mut ::std::os::raw::c_void,
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn CRYPTO_secure_allocated(ptr: *const ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_malloc_initialized() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_actual_size(ptr: *mut ::std::os::raw::c_void) -> usize;
}
unsafe extern "C" {
    pub fn CRYPTO_secure_used() -> usize;
}
unsafe extern "C" {
    pub fn OPENSSL_cleanse(ptr: *mut ::std::os::raw::c_void, len: usize);
}
unsafe extern "C" {
    pub fn OPENSSL_die(
        assertion: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn OPENSSL_isservice() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_init();
}
unsafe extern "C" {
    pub fn OPENSSL_fork_prepare();
}
unsafe extern "C" {
    pub fn OPENSSL_fork_parent();
}
unsafe extern "C" {
    pub fn OPENSSL_fork_child();
}
unsafe extern "C" {
    pub fn OPENSSL_gmtime(timer: *const time_t, result: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn OPENSSL_gmtime_adj(
        tm: *mut tm,
        offset_day: ::std::os::raw::c_int,
        offset_sec: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_gmtime_diff(
        pday: *mut ::std::os::raw::c_int,
        psec: *mut ::std::os::raw::c_int,
        from: *const tm,
        to: *const tm,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_memcmp(
        in_a: *const ::std::os::raw::c_void,
        in_b: *const ::std::os::raw::c_void,
        len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_cleanup();
}
unsafe extern "C" {
    pub fn OPENSSL_init_crypto(
        opts: u64,
        settings: *const OPENSSL_INIT_SETTINGS,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_atexit(
        handler: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OPENSSL_thread_stop();
}
unsafe extern "C" {
    pub fn OPENSSL_thread_stop_ex(ctx: *mut OSSL_LIB_CTX);
}
unsafe extern "C" {
    pub fn OPENSSL_INIT_new() -> *mut OPENSSL_INIT_SETTINGS;
}
unsafe extern "C" {
    pub fn OPENSSL_INIT_free(settings: *mut OPENSSL_INIT_SETTINGS);
}
pub type CRYPTO_ONCE = pthread_once_t;
pub type CRYPTO_THREAD_LOCAL = pthread_key_t;
pub type CRYPTO_THREAD_ID = pthread_t;
unsafe extern "C" {
    pub fn CRYPTO_THREAD_run_once(
        once: *mut CRYPTO_ONCE,
        init: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_init_local(
        key: *mut CRYPTO_THREAD_LOCAL,
        cleanup: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_get_local(key: *mut CRYPTO_THREAD_LOCAL) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_set_local(
        key: *mut CRYPTO_THREAD_LOCAL,
        val: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_cleanup_local(key: *mut CRYPTO_THREAD_LOCAL) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_get_current_id() -> CRYPTO_THREAD_ID;
}
unsafe extern "C" {
    pub fn CRYPTO_THREAD_compare_id(
        a: CRYPTO_THREAD_ID,
        b: CRYPTO_THREAD_ID,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_new() -> *mut OSSL_LIB_CTX;
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_new_from_dispatch(
        handle: *const OSSL_CORE_HANDLE,
        in_: *const OSSL_DISPATCH,
    ) -> *mut OSSL_LIB_CTX;
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_new_child(
        handle: *const OSSL_CORE_HANDLE,
        in_: *const OSSL_DISPATCH,
    ) -> *mut OSSL_LIB_CTX;
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_load_config(
        ctx: *mut OSSL_LIB_CTX,
        config_file: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_free(arg1: *mut OSSL_LIB_CTX);
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_get0_global_default() -> *mut OSSL_LIB_CTX;
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_set0_default(libctx: *mut OSSL_LIB_CTX) -> *mut OSSL_LIB_CTX;
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_get_conf_diagnostics(ctx: *mut OSSL_LIB_CTX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_set_conf_diagnostics(ctx: *mut OSSL_LIB_CTX, value: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn OSSL_sleep(millis: u64);
}
unsafe extern "C" {
    pub fn OSSL_LIB_CTX_get_data(
        ctx: *mut OSSL_LIB_CTX,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct bio_addr_st {
    _unused: [u8; 0],
}
pub type BIO_ADDR = bio_addr_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bio_addrinfo_st {
    _unused: [u8; 0],
}
pub type BIO_ADDRINFO = bio_addrinfo_st;
unsafe extern "C" {
    pub fn BIO_get_new_index() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_flags(b: *mut BIO, flags: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn BIO_test_flags(b: *const BIO, flags: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_clear_flags(b: *mut BIO, flags: ::std::os::raw::c_int);
}
pub type BIO_callback_fn = ::std::option::Option<
    unsafe extern "C" fn(
        b: *mut BIO,
        oper: ::std::os::raw::c_int,
        argp: *const ::std::os::raw::c_char,
        argi: ::std::os::raw::c_int,
        argl: ::std::os::raw::c_long,
        ret: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long,
>;
unsafe extern "C" {
    pub fn BIO_get_callback(b: *const BIO) -> BIO_callback_fn;
}
unsafe extern "C" {
    pub fn BIO_set_callback(b: *mut BIO, callback: BIO_callback_fn);
}
unsafe extern "C" {
    pub fn BIO_debug_callback(
        bio: *mut BIO,
        cmd: ::std::os::raw::c_int,
        argp: *const ::std::os::raw::c_char,
        argi: ::std::os::raw::c_int,
        argl: ::std::os::raw::c_long,
        ret: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
pub type BIO_callback_fn_ex = ::std::option::Option<
    unsafe extern "C" fn(
        b: *mut BIO,
        oper: ::std::os::raw::c_int,
        argp: *const ::std::os::raw::c_char,
        len: usize,
        argi: ::std::os::raw::c_int,
        argl: ::std::os::raw::c_long,
        ret: ::std::os::raw::c_int,
        processed: *mut usize,
    ) -> ::std::os::raw::c_long,
>;
unsafe extern "C" {
    pub fn BIO_get_callback_ex(b: *const BIO) -> BIO_callback_fn_ex;
}
unsafe extern "C" {
    pub fn BIO_set_callback_ex(b: *mut BIO, callback: BIO_callback_fn_ex);
}
unsafe extern "C" {
    pub fn BIO_debug_callback_ex(
        bio: *mut BIO,
        oper: ::std::os::raw::c_int,
        argp: *const ::std::os::raw::c_char,
        len: usize,
        argi: ::std::os::raw::c_int,
        argl: ::std::os::raw::c_long,
        ret: ::std::os::raw::c_int,
        processed: *mut usize,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn BIO_get_callback_arg(b: *const BIO) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn BIO_set_callback_arg(b: *mut BIO, arg: *mut ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bio_method_st {
    _unused: [u8; 0],
}
pub type BIO_METHOD = bio_method_st;
unsafe extern "C" {
    pub fn BIO_method_name(b: *const BIO) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn BIO_method_type(b: *const BIO) -> ::std::os::raw::c_int;
}
pub type BIO_info_cb = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut BIO,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type bio_info_cb = BIO_info_cb;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_BIO {
    _unused: [u8; 0],
}
pub type sk_BIO_compfunc = ::std::option::Option<
    unsafe extern "C" fn(a: *const *const BIO, b: *const *const BIO) -> ::std::os::raw::c_int,
>;
pub type sk_BIO_freefunc = ::std::option::Option<unsafe extern "C" fn(a: *mut BIO)>;
pub type sk_BIO_copyfunc = ::std::option::Option<unsafe extern "C" fn(a: *const BIO) -> *mut BIO>;
pub type asn1_ps_func = ::std::option::Option<
    unsafe extern "C" fn(
        b: *mut BIO,
        pbuf: *mut *mut ::std::os::raw::c_uchar,
        plen: *mut ::std::os::raw::c_int,
        parg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type BIO_dgram_sctp_notification_handler_fn = ::std::option::Option<
    unsafe extern "C" fn(
        b: *mut BIO,
        context: *mut ::std::os::raw::c_void,
        buf: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct bio_msg_st {
    pub data: *mut ::std::os::raw::c_void,
    pub data_len: usize,
    pub peer: *mut BIO_ADDR,
    pub local: *mut BIO_ADDR,
    pub flags: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bio_msg_st"][::std::mem::size_of::<bio_msg_st>() - 40usize];
    ["Alignment of bio_msg_st"][::std::mem::align_of::<bio_msg_st>() - 8usize];
    ["Offset of field: bio_msg_st::data"][::std::mem::offset_of!(bio_msg_st, data) - 0usize];
    ["Offset of field: bio_msg_st::data_len"]
        [::std::mem::offset_of!(bio_msg_st, data_len) - 8usize];
    ["Offset of field: bio_msg_st::peer"][::std::mem::offset_of!(bio_msg_st, peer) - 16usize];
    ["Offset of field: bio_msg_st::local"][::std::mem::offset_of!(bio_msg_st, local) - 24usize];
    ["Offset of field: bio_msg_st::flags"][::std::mem::offset_of!(bio_msg_st, flags) - 32usize];
};
impl Default for bio_msg_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type BIO_MSG = bio_msg_st;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct bio_mmsg_cb_args_st {
    pub msg: *mut BIO_MSG,
    pub stride: usize,
    pub num_msg: usize,
    pub flags: u64,
    pub msgs_processed: *mut usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bio_mmsg_cb_args_st"][::std::mem::size_of::<bio_mmsg_cb_args_st>() - 40usize];
    ["Alignment of bio_mmsg_cb_args_st"][::std::mem::align_of::<bio_mmsg_cb_args_st>() - 8usize];
    ["Offset of field: bio_mmsg_cb_args_st::msg"]
        [::std::mem::offset_of!(bio_mmsg_cb_args_st, msg) - 0usize];
    ["Offset of field: bio_mmsg_cb_args_st::stride"]
        [::std::mem::offset_of!(bio_mmsg_cb_args_st, stride) - 8usize];
    ["Offset of field: bio_mmsg_cb_args_st::num_msg"]
        [::std::mem::offset_of!(bio_mmsg_cb_args_st, num_msg) - 16usize];
    ["Offset of field: bio_mmsg_cb_args_st::flags"]
        [::std::mem::offset_of!(bio_mmsg_cb_args_st, flags) - 24usize];
    ["Offset of field: bio_mmsg_cb_args_st::msgs_processed"]
        [::std::mem::offset_of!(bio_mmsg_cb_args_st, msgs_processed) - 32usize];
};
impl Default for bio_mmsg_cb_args_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type BIO_MMSG_CB_ARGS = bio_mmsg_cb_args_st;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct bio_poll_descriptor_st {
    pub type_: u32,
    pub value: bio_poll_descriptor_st__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union bio_poll_descriptor_st__bindgen_ty_1 {
    pub fd: ::std::os::raw::c_int,
    pub custom: *mut ::std::os::raw::c_void,
    pub custom_ui: usize,
    pub ssl: *mut SSL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bio_poll_descriptor_st__bindgen_ty_1"]
        [::std::mem::size_of::<bio_poll_descriptor_st__bindgen_ty_1>() - 8usize];
    ["Alignment of bio_poll_descriptor_st__bindgen_ty_1"]
        [::std::mem::align_of::<bio_poll_descriptor_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: bio_poll_descriptor_st__bindgen_ty_1::fd"]
        [::std::mem::offset_of!(bio_poll_descriptor_st__bindgen_ty_1, fd) - 0usize];
    ["Offset of field: bio_poll_descriptor_st__bindgen_ty_1::custom"]
        [::std::mem::offset_of!(bio_poll_descriptor_st__bindgen_ty_1, custom) - 0usize];
    ["Offset of field: bio_poll_descriptor_st__bindgen_ty_1::custom_ui"]
        [::std::mem::offset_of!(bio_poll_descriptor_st__bindgen_ty_1, custom_ui) - 0usize];
    ["Offset of field: bio_poll_descriptor_st__bindgen_ty_1::ssl"]
        [::std::mem::offset_of!(bio_poll_descriptor_st__bindgen_ty_1, ssl) - 0usize];
};
impl Default for bio_poll_descriptor_st__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bio_poll_descriptor_st"][::std::mem::size_of::<bio_poll_descriptor_st>() - 16usize];
    ["Alignment of bio_poll_descriptor_st"]
        [::std::mem::align_of::<bio_poll_descriptor_st>() - 8usize];
    ["Offset of field: bio_poll_descriptor_st::type_"]
        [::std::mem::offset_of!(bio_poll_descriptor_st, type_) - 0usize];
    ["Offset of field: bio_poll_descriptor_st::value"]
        [::std::mem::offset_of!(bio_poll_descriptor_st, value) - 8usize];
};
impl Default for bio_poll_descriptor_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type BIO_POLL_DESCRIPTOR = bio_poll_descriptor_st;
unsafe extern "C" {
    pub fn BIO_ctrl_pending(b: *mut BIO) -> usize;
}
unsafe extern "C" {
    pub fn BIO_ctrl_wpending(b: *mut BIO) -> usize;
}
unsafe extern "C" {
    pub fn BIO_ctrl_get_write_guarantee(b: *mut BIO) -> usize;
}
unsafe extern "C" {
    pub fn BIO_ctrl_get_read_request(b: *mut BIO) -> usize;
}
unsafe extern "C" {
    pub fn BIO_ctrl_reset_read_request(b: *mut BIO) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_ex_data(
        bio: *mut BIO,
        idx: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_ex_data(
        bio: *const BIO,
        idx: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn BIO_number_read(bio: *mut BIO) -> u64;
}
unsafe extern "C" {
    pub fn BIO_number_written(bio: *mut BIO) -> u64;
}
unsafe extern "C" {
    pub fn BIO_asn1_set_prefix(
        b: *mut BIO,
        prefix: asn1_ps_func,
        prefix_free: asn1_ps_func,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_asn1_get_prefix(
        b: *mut BIO,
        pprefix: *mut asn1_ps_func,
        pprefix_free: *mut asn1_ps_func,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_asn1_set_suffix(
        b: *mut BIO,
        suffix: asn1_ps_func,
        suffix_free: asn1_ps_func,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_asn1_get_suffix(
        b: *mut BIO,
        psuffix: *mut asn1_ps_func,
        psuffix_free: *mut asn1_ps_func,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_s_file() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_new_file(
        filename: *const ::std::os::raw::c_char,
        mode: *const ::std::os::raw::c_char,
    ) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_new_from_core_bio(
        libctx: *mut OSSL_LIB_CTX,
        corebio: *mut OSSL_CORE_BIO,
    ) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_new_ex(libctx: *mut OSSL_LIB_CTX, method: *const BIO_METHOD) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_new(type_: *const BIO_METHOD) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_free(a: *mut BIO) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_data(a: *mut BIO, ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn BIO_get_data(a: *mut BIO) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn BIO_set_init(a: *mut BIO, init: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn BIO_get_init(a: *mut BIO) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_shutdown(a: *mut BIO, shut: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn BIO_get_shutdown(a: *mut BIO) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_vfree(a: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_up_ref(a: *mut BIO) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_read(
        b: *mut BIO,
        data: *mut ::std::os::raw::c_void,
        dlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_read_ex(
        b: *mut BIO,
        data: *mut ::std::os::raw::c_void,
        dlen: usize,
        readbytes: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_recvmmsg(
        b: *mut BIO,
        msg: *mut BIO_MSG,
        stride: usize,
        num_msg: usize,
        flags: u64,
        msgs_processed: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_gets(
        bp: *mut BIO,
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_line(
        bio: *mut BIO,
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_write(
        b: *mut BIO,
        data: *const ::std::os::raw::c_void,
        dlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_write_ex(
        b: *mut BIO,
        data: *const ::std::os::raw::c_void,
        dlen: usize,
        written: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_sendmmsg(
        b: *mut BIO,
        msg: *mut BIO_MSG,
        stride: usize,
        num_msg: usize,
        flags: u64,
        msgs_processed: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_rpoll_descriptor(
        b: *mut BIO,
        desc: *mut BIO_POLL_DESCRIPTOR,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_get_wpoll_descriptor(
        b: *mut BIO,
        desc: *mut BIO_POLL_DESCRIPTOR,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_puts(bp: *mut BIO, buf: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_indent(
        b: *mut BIO,
        indent: ::std::os::raw::c_int,
        max: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_ctrl(
        bp: *mut BIO,
        cmd: ::std::os::raw::c_int,
        larg: ::std::os::raw::c_long,
        parg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn BIO_callback_ctrl(
        b: *mut BIO,
        cmd: ::std::os::raw::c_int,
        fp: BIO_info_cb,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn BIO_ptr_ctrl(
        bp: *mut BIO,
        cmd: ::std::os::raw::c_int,
        larg: ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn BIO_int_ctrl(
        bp: *mut BIO,
        cmd: ::std::os::raw::c_int,
        larg: ::std::os::raw::c_long,
        iarg: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn BIO_push(b: *mut BIO, append: *mut BIO) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_pop(b: *mut BIO) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_free_all(a: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_find_type(b: *mut BIO, bio_type: ::std::os::raw::c_int) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_next(b: *mut BIO) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_set_next(b: *mut BIO, next: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_get_retry_BIO(bio: *mut BIO, reason: *mut ::std::os::raw::c_int) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_get_retry_reason(bio: *mut BIO) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_set_retry_reason(bio: *mut BIO, reason: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn BIO_dup_chain(in_: *mut BIO) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_nread0(
        bio: *mut BIO,
        buf: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_nread(
        bio: *mut BIO,
        buf: *mut *mut ::std::os::raw::c_char,
        num: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_nwrite0(
        bio: *mut BIO,
        buf: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_nwrite(
        bio: *mut BIO,
        buf: *mut *mut ::std::os::raw::c_char,
        num: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_s_mem() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_s_secmem() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_new_mem_buf(
        buf: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_s_fd() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_s_log() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_s_bio() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_s_null() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_f_null() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_f_buffer() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_f_readbuffer() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_f_linebuffer() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_f_nbio_test() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_f_prefix() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_s_core() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_wait(
        bio: *mut BIO,
        max_time: time_t,
        nap_milliseconds: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_do_connect_retry(
        bio: *mut BIO,
        timeout: ::std::os::raw::c_int,
        nap_milliseconds: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_fd_should_retry(i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_fd_non_fatal_error(error: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_dump_cb(
        cb: ::std::option::Option<
            unsafe extern "C" fn(
                data: *const ::std::os::raw::c_void,
                len: usize,
                u: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        u: *mut ::std::os::raw::c_void,
        s: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_dump_indent_cb(
        cb: ::std::option::Option<
            unsafe extern "C" fn(
                data: *const ::std::os::raw::c_void,
                len: usize,
                u: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        u: *mut ::std::os::raw::c_void,
        s: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
        indent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_dump(
        b: *mut BIO,
        bytes: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_dump_indent(
        b: *mut BIO,
        bytes: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
        indent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_hex_string(
        out: *mut BIO,
        indent: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
        data: *const ::std::os::raw::c_void,
        datalen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_new_fd(fd: ::std::os::raw::c_int, close_flag: ::std::os::raw::c_int) -> *mut BIO;
}
unsafe extern "C" {
    pub fn BIO_new_bio_pair(
        bio1: *mut *mut BIO,
        writebuf1: usize,
        bio2: *mut *mut BIO,
        writebuf2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_copy_next_retry(b: *mut BIO);
}
unsafe extern "C" {
    pub fn BIO_printf(
        bio: *mut BIO,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_vprintf(
        bio: *mut BIO,
        format: *const ::std::os::raw::c_char,
        args: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_snprintf(
        buf: *mut ::std::os::raw::c_char,
        n: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_vsnprintf(
        buf: *mut ::std::os::raw::c_char,
        n: usize,
        format: *const ::std::os::raw::c_char,
        args: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_new(
        type_: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
    ) -> *mut BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_meth_free(biom: *mut BIO_METHOD);
}
unsafe extern "C" {
    pub fn BIO_meth_set_write(
        biom: *mut BIO_METHOD,
        write: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *const ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_write_ex(
        biom: *mut BIO_METHOD,
        bwrite: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *const ::std::os::raw::c_char,
                arg3: usize,
                arg4: *mut usize,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_sendmmsg(
        biom: *mut BIO_METHOD,
        f: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut BIO_MSG,
                arg3: usize,
                arg4: usize,
                arg5: u64,
                arg6: *mut usize,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_read(
        biom: *mut BIO_METHOD,
        read: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_read_ex(
        biom: *mut BIO_METHOD,
        bread: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut ::std::os::raw::c_char,
                arg3: usize,
                arg4: *mut usize,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_recvmmsg(
        biom: *mut BIO_METHOD,
        f: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut BIO_MSG,
                arg3: usize,
                arg4: usize,
                arg5: u64,
                arg6: *mut usize,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_puts(
        biom: *mut BIO_METHOD,
        puts: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *const ::std::os::raw::c_char,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_gets(
        biom: *mut BIO_METHOD,
        ossl_gets: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: *mut ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_ctrl(
        biom: *mut BIO_METHOD,
        ctrl: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_long,
                arg4: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_long,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_create(
        biom: *mut BIO_METHOD,
        create: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut BIO) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_destroy(
        biom: *mut BIO_METHOD,
        destroy: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut BIO) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_set_callback_ctrl(
        biom: *mut BIO_METHOD,
        callback_ctrl: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut BIO,
                arg2: ::std::os::raw::c_int,
                arg3: BIO_info_cb,
            ) -> ::std::os::raw::c_long,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BIO_meth_get_write(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *const ::std::os::raw::c_char,
            arg2: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_write_ex(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *const ::std::os::raw::c_char,
            arg2: usize,
            arg3: *mut usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_sendmmsg(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *mut BIO_MSG,
            arg2: usize,
            arg3: usize,
            arg4: u64,
            arg5: *mut usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_read(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *mut ::std::os::raw::c_char,
            arg2: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_read_ex(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *mut ::std::os::raw::c_char,
            arg2: usize,
            arg3: *mut usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_recvmmsg(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *mut BIO_MSG,
            arg2: usize,
            arg3: usize,
            arg4: u64,
            arg5: *mut usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_puts(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_gets(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: *mut ::std::os::raw::c_char,
            arg2: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_ctrl(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: ::std::os::raw::c_int,
            arg2: ::std::os::raw::c_long,
            arg3: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_long,
    >;
}
unsafe extern "C" {
    pub fn BIO_meth_get_create(
        bion: *const BIO_METHOD,
    ) -> ::std::option::Option<unsafe extern "C" fn(bion: *mut BIO) -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub fn BIO_meth_get_destroy(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<unsafe extern "C" fn(biom: *mut BIO) -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub fn BIO_meth_get_callback_ctrl(
        biom: *const BIO_METHOD,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            biom: *mut BIO,
            arg1: ::std::os::raw::c_int,
            arg2: BIO_info_cb,
        ) -> ::std::os::raw::c_long,
    >;
}
unsafe extern "C" {
    pub fn BN_set_flags(b: *mut BIGNUM, n: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn BN_get_flags(b: *const BIGNUM, n: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_with_flags(dest: *mut BIGNUM, b: *const BIGNUM, flags: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn BN_GENCB_call(
        cb: *mut BN_GENCB,
        a: ::std::os::raw::c_int,
        b: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GENCB_new() -> *mut BN_GENCB;
}
unsafe extern "C" {
    pub fn BN_GENCB_free(cb: *mut BN_GENCB);
}
unsafe extern "C" {
    pub fn BN_GENCB_set_old(
        gencb: *mut BN_GENCB,
        callback: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: *mut ::std::os::raw::c_void,
            ),
        >,
        cb_arg: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn BN_GENCB_set(
        gencb: *mut BN_GENCB,
        callback: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: *mut BN_GENCB,
            ) -> ::std::os::raw::c_int,
        >,
        cb_arg: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn BN_GENCB_get_arg(cb: *mut BN_GENCB) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn BN_abs_is_word(a: *const BIGNUM, w: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_is_zero(a: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_is_one(a: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_is_word(a: *const BIGNUM, w: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_is_odd(a: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_zero_ex(a: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_value_one() -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn BN_options() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn BN_CTX_new_ex(ctx: *mut OSSL_LIB_CTX) -> *mut BN_CTX;
}
unsafe extern "C" {
    pub fn BN_CTX_new() -> *mut BN_CTX;
}
unsafe extern "C" {
    pub fn BN_CTX_secure_new_ex(ctx: *mut OSSL_LIB_CTX) -> *mut BN_CTX;
}
unsafe extern "C" {
    pub fn BN_CTX_secure_new() -> *mut BN_CTX;
}
unsafe extern "C" {
    pub fn BN_CTX_free(c: *mut BN_CTX);
}
unsafe extern "C" {
    pub fn BN_CTX_start(ctx: *mut BN_CTX);
}
unsafe extern "C" {
    pub fn BN_CTX_get(ctx: *mut BN_CTX) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_CTX_end(ctx: *mut BN_CTX);
}
unsafe extern "C" {
    pub fn BN_rand_ex(
        rnd: *mut BIGNUM,
        bits: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        bottom: ::std::os::raw::c_int,
        strength: ::std::os::raw::c_uint,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_rand(
        rnd: *mut BIGNUM,
        bits: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        bottom: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_priv_rand_ex(
        rnd: *mut BIGNUM,
        bits: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        bottom: ::std::os::raw::c_int,
        strength: ::std::os::raw::c_uint,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_priv_rand(
        rnd: *mut BIGNUM,
        bits: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        bottom: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_rand_range_ex(
        r: *mut BIGNUM,
        range: *const BIGNUM,
        strength: ::std::os::raw::c_uint,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_rand_range(rnd: *mut BIGNUM, range: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_priv_rand_range_ex(
        r: *mut BIGNUM,
        range: *const BIGNUM,
        strength: ::std::os::raw::c_uint,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_priv_rand_range(rnd: *mut BIGNUM, range: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_pseudo_rand(
        rnd: *mut BIGNUM,
        bits: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        bottom: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_pseudo_rand_range(rnd: *mut BIGNUM, range: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_num_bits(a: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_num_bits_word(l: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_security_bits(
        L: ::std::os::raw::c_int,
        N: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_new() -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_secure_new() -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_clear_free(a: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_copy(a: *mut BIGNUM, b: *const BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_swap(a: *mut BIGNUM, b: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_bin2bn(
        s: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_signed_bin2bn(
        s: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_bn2bin(a: *const BIGNUM, to: *mut ::std::os::raw::c_uchar) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_bn2binpad(
        a: *const BIGNUM,
        to: *mut ::std::os::raw::c_uchar,
        tolen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_signed_bn2bin(
        a: *const BIGNUM,
        to: *mut ::std::os::raw::c_uchar,
        tolen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_lebin2bn(
        s: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_signed_lebin2bn(
        s: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_bn2lebinpad(
        a: *const BIGNUM,
        to: *mut ::std::os::raw::c_uchar,
        tolen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_signed_bn2lebin(
        a: *const BIGNUM,
        to: *mut ::std::os::raw::c_uchar,
        tolen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_native2bn(
        s: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_signed_native2bn(
        s: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_bn2nativepad(
        a: *const BIGNUM,
        to: *mut ::std::os::raw::c_uchar,
        tolen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_signed_bn2native(
        a: *const BIGNUM,
        to: *mut ::std::os::raw::c_uchar,
        tolen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mpi2bn(
        s: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        ret: *mut BIGNUM,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_bn2mpi(a: *const BIGNUM, to: *mut ::std::os::raw::c_uchar) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_sub(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_usub(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_uadd(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_add(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mul(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_sqr(r: *mut BIGNUM, a: *const BIGNUM, ctx: *mut BN_CTX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " BN_set_negative sets sign of a BIGNUM\n \\param  b  pointer to the BIGNUM object\n \\param  n  0 if the BIGNUM b should be positive and a value != 0 otherwise"]
    pub fn BN_set_negative(b: *mut BIGNUM, n: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " BN_is_negative returns 1 if the BIGNUM is negative\n \\param  b  pointer to the BIGNUM object\n \\return 1 if a < 0 and 0 otherwise"]
    pub fn BN_is_negative(b: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_div(
        dv: *mut BIGNUM,
        rem: *mut BIGNUM,
        m: *const BIGNUM,
        d: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_nnmod(
        r: *mut BIGNUM,
        m: *const BIGNUM,
        d: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_add(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_add_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_sub(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_sub_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_mul(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_sqr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_lshift1(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_lshift1_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        m: *const BIGNUM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_lshift(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        n: ::std::os::raw::c_int,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_lshift_quick(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        n: ::std::os::raw::c_int,
        m: *const BIGNUM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_word(a: *const BIGNUM, w: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn BN_div_word(a: *mut BIGNUM, w: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn BN_mul_word(a: *mut BIGNUM, w: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_add_word(a: *mut BIGNUM, w: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_sub_word(a: *mut BIGNUM, w: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_set_word(a: *mut BIGNUM, w: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_get_word(a: *const BIGNUM) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn BN_cmp(a: *const BIGNUM, b: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_free(a: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_is_bit_set(a: *const BIGNUM, n: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_lshift(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        n: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_lshift1(r: *mut BIGNUM, a: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_exp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp_mont(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        m_ctx: *mut BN_MONT_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp_mont_consttime(
        rr: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        in_mont: *mut BN_MONT_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp_mont_word(
        r: *mut BIGNUM,
        a: ::std::os::raw::c_ulong,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        m_ctx: *mut BN_MONT_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp2_mont(
        r: *mut BIGNUM,
        a1: *const BIGNUM,
        p1: *const BIGNUM,
        a2: *const BIGNUM,
        p2: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
        m_ctx: *mut BN_MONT_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp_simple(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp_mont_consttime_x2(
        rr1: *mut BIGNUM,
        a1: *const BIGNUM,
        p1: *const BIGNUM,
        m1: *const BIGNUM,
        in_mont1: *mut BN_MONT_CTX,
        rr2: *mut BIGNUM,
        a2: *const BIGNUM,
        p2: *const BIGNUM,
        m2: *const BIGNUM,
        in_mont2: *mut BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mask_bits(a: *mut BIGNUM, n: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_print(bio: *mut BIO, a: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_reciprocal(
        r: *mut BIGNUM,
        m: *const BIGNUM,
        len: ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_rshift(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        n: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_rshift1(r: *mut BIGNUM, a: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_clear(a: *mut BIGNUM);
}
unsafe extern "C" {
    pub fn BN_dup(a: *const BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_ucmp(a: *const BIGNUM, b: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_set_bit(a: *mut BIGNUM, n: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_clear_bit(a: *mut BIGNUM, n: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_bn2hex(a: *const BIGNUM) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn BN_bn2dec(a: *const BIGNUM) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn BN_hex2bn(
        a: *mut *mut BIGNUM,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_dec2bn(
        a: *mut *mut BIGNUM,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_asc2bn(
        a: *mut *mut BIGNUM,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_gcd(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_kronecker(
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_are_coprime(
        a: *mut BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_inverse(
        ret: *mut BIGNUM,
        a: *const BIGNUM,
        n: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_mod_sqrt(
        ret: *mut BIGNUM,
        a: *const BIGNUM,
        n: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_consttime_swap(
        swap: ::std::os::raw::c_ulong,
        a: *mut BIGNUM,
        b: *mut BIGNUM,
        nwords: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn BN_generate_prime(
        ret: *mut BIGNUM,
        bits: ::std::os::raw::c_int,
        safe: ::std::os::raw::c_int,
        add: *const BIGNUM,
        rem: *const BIGNUM,
        callback: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: *mut ::std::os::raw::c_void,
            ),
        >,
        cb_arg: *mut ::std::os::raw::c_void,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_is_prime(
        p: *const BIGNUM,
        nchecks: ::std::os::raw::c_int,
        callback: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: *mut ::std::os::raw::c_void,
            ),
        >,
        ctx: *mut BN_CTX,
        cb_arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_is_prime_fasttest(
        p: *const BIGNUM,
        nchecks: ::std::os::raw::c_int,
        callback: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: *mut ::std::os::raw::c_void,
            ),
        >,
        ctx: *mut BN_CTX,
        cb_arg: *mut ::std::os::raw::c_void,
        do_trial_division: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_is_prime_ex(
        p: *const BIGNUM,
        nchecks: ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
        cb: *mut BN_GENCB,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_is_prime_fasttest_ex(
        p: *const BIGNUM,
        nchecks: ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
        do_trial_division: ::std::os::raw::c_int,
        cb: *mut BN_GENCB,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_generate_prime_ex2(
        ret: *mut BIGNUM,
        bits: ::std::os::raw::c_int,
        safe: ::std::os::raw::c_int,
        add: *const BIGNUM,
        rem: *const BIGNUM,
        cb: *mut BN_GENCB,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_generate_prime_ex(
        ret: *mut BIGNUM,
        bits: ::std::os::raw::c_int,
        safe: ::std::os::raw::c_int,
        add: *const BIGNUM,
        rem: *const BIGNUM,
        cb: *mut BN_GENCB,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_check_prime(
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
        cb: *mut BN_GENCB,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_X931_generate_Xpq(
        Xp: *mut BIGNUM,
        Xq: *mut BIGNUM,
        nbits: ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_X931_derive_prime_ex(
        p: *mut BIGNUM,
        p1: *mut BIGNUM,
        p2: *mut BIGNUM,
        Xp: *const BIGNUM,
        Xp1: *const BIGNUM,
        Xp2: *const BIGNUM,
        e: *const BIGNUM,
        ctx: *mut BN_CTX,
        cb: *mut BN_GENCB,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_X931_generate_prime_ex(
        p: *mut BIGNUM,
        p1: *mut BIGNUM,
        p2: *mut BIGNUM,
        Xp1: *mut BIGNUM,
        Xp2: *mut BIGNUM,
        Xp: *const BIGNUM,
        e: *const BIGNUM,
        ctx: *mut BN_CTX,
        cb: *mut BN_GENCB,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_new() -> *mut BN_MONT_CTX;
}
unsafe extern "C" {
    pub fn BN_mod_mul_montgomery(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        mont: *mut BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_to_montgomery(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        mont: *mut BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_from_montgomery(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        mont: *mut BN_MONT_CTX,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_free(mont: *mut BN_MONT_CTX);
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_set(
        mont: *mut BN_MONT_CTX,
        mod_: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_copy(to: *mut BN_MONT_CTX, from: *mut BN_MONT_CTX) -> *mut BN_MONT_CTX;
}
unsafe extern "C" {
    pub fn BN_MONT_CTX_set_locked(
        pmont: *mut *mut BN_MONT_CTX,
        lock: *mut CRYPTO_RWLOCK,
        mod_: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut BN_MONT_CTX;
}
unsafe extern "C" {
    pub fn BN_BLINDING_new(
        A: *const BIGNUM,
        Ai: *const BIGNUM,
        mod_: *mut BIGNUM,
    ) -> *mut BN_BLINDING;
}
unsafe extern "C" {
    pub fn BN_BLINDING_free(b: *mut BN_BLINDING);
}
unsafe extern "C" {
    pub fn BN_BLINDING_update(b: *mut BN_BLINDING, ctx: *mut BN_CTX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_BLINDING_convert(
        n: *mut BIGNUM,
        b: *mut BN_BLINDING,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_BLINDING_invert(
        n: *mut BIGNUM,
        b: *mut BN_BLINDING,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_BLINDING_convert_ex(
        n: *mut BIGNUM,
        r: *mut BIGNUM,
        b: *mut BN_BLINDING,
        arg1: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_BLINDING_invert_ex(
        n: *mut BIGNUM,
        r: *const BIGNUM,
        b: *mut BN_BLINDING,
        arg1: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_BLINDING_is_current_thread(b: *mut BN_BLINDING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_BLINDING_set_current_thread(b: *mut BN_BLINDING);
}
unsafe extern "C" {
    pub fn BN_BLINDING_lock(b: *mut BN_BLINDING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_BLINDING_unlock(b: *mut BN_BLINDING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_BLINDING_get_flags(arg1: *const BN_BLINDING) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn BN_BLINDING_set_flags(arg1: *mut BN_BLINDING, arg2: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn BN_BLINDING_create_param(
        b: *mut BN_BLINDING,
        e: *const BIGNUM,
        m: *mut BIGNUM,
        ctx: *mut BN_CTX,
        bn_mod_exp: ::std::option::Option<
            unsafe extern "C" fn(
                r: *mut BIGNUM,
                a: *const BIGNUM,
                p: *const BIGNUM,
                m: *const BIGNUM,
                ctx: *mut BN_CTX,
                m_ctx: *mut BN_MONT_CTX,
            ) -> ::std::os::raw::c_int,
        >,
        m_ctx: *mut BN_MONT_CTX,
    ) -> *mut BN_BLINDING;
}
unsafe extern "C" {
    pub fn BN_set_params(
        mul: ::std::os::raw::c_int,
        high: ::std::os::raw::c_int,
        low: ::std::os::raw::c_int,
        mont: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn BN_get_params(which: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_RECP_CTX_new() -> *mut BN_RECP_CTX;
}
unsafe extern "C" {
    pub fn BN_RECP_CTX_free(recp: *mut BN_RECP_CTX);
}
unsafe extern "C" {
    pub fn BN_RECP_CTX_set(
        recp: *mut BN_RECP_CTX,
        rdiv: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_mul_reciprocal(
        r: *mut BIGNUM,
        x: *const BIGNUM,
        y: *const BIGNUM,
        recp: *mut BN_RECP_CTX,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_mod_exp_recp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_div_recp(
        dv: *mut BIGNUM,
        rem: *mut BIGNUM,
        m: *const BIGNUM,
        recp: *mut BN_RECP_CTX,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_add(r: *mut BIGNUM, a: *const BIGNUM, b: *const BIGNUM)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod(r: *mut BIGNUM, a: *const BIGNUM, p: *const BIGNUM)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_mul(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_sqr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_inv(
        r: *mut BIGNUM,
        b: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_div(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_exp(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_sqrt(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_solve_quad(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_mul_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_sqr_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_inv_arr(
        r: *mut BIGNUM,
        b: *const BIGNUM,
        p: *const ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_div_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_exp_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        p: *const ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_sqrt_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_mod_solve_quad_arr(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_poly2arr(
        a: *const BIGNUM,
        p: *mut ::std::os::raw::c_int,
        max: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_GF2m_arr2poly(
        p: *const ::std::os::raw::c_int,
        a: *mut BIGNUM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_nist_mod_192(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_nist_mod_224(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_nist_mod_256(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_nist_mod_384(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_nist_mod_521(
        r: *mut BIGNUM,
        a: *const BIGNUM,
        p: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_get0_nist_prime_192() -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get0_nist_prime_224() -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get0_nist_prime_256() -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get0_nist_prime_384() -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get0_nist_prime_521() -> *const BIGNUM;
}
unsafe extern "C" {
    pub fn BN_nist_mod_func(
        p: *const BIGNUM,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            p: *mut BIGNUM,
            arg1: *const BIGNUM,
            arg2: *const BIGNUM,
            arg3: *mut BN_CTX,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub fn BN_generate_dsa_nonce(
        out: *mut BIGNUM,
        range: *const BIGNUM,
        priv_: *const BIGNUM,
        message: *const ::std::os::raw::c_uchar,
        message_len: usize,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn BN_get_rfc2409_prime_768(bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc2409_prime_1024(bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_1536(bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_2048(bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_3072(bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_4096(bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_6144(bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_get_rfc3526_prime_8192(bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn BN_bntest_rand(
        rnd: *mut BIGNUM,
        bits: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        bottom: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_X509_ALGOR {
    _unused: [u8; 0],
}
pub type sk_X509_ALGOR_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const X509_ALGOR,
        b: *const *const X509_ALGOR,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_X509_ALGOR_freefunc = ::std::option::Option<unsafe extern "C" fn(a: *mut X509_ALGOR)>;
pub type sk_X509_ALGOR_copyfunc =
    ::std::option::Option<unsafe extern "C" fn(a: *const X509_ALGOR) -> *mut X509_ALGOR>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct asn1_string_st {
    pub length: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_int,
    pub data: *mut ::std::os::raw::c_uchar,
    pub flags: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn1_string_st"][::std::mem::size_of::<asn1_string_st>() - 24usize];
    ["Alignment of asn1_string_st"][::std::mem::align_of::<asn1_string_st>() - 8usize];
    ["Offset of field: asn1_string_st::length"]
        [::std::mem::offset_of!(asn1_string_st, length) - 0usize];
    ["Offset of field: asn1_string_st::type_"]
        [::std::mem::offset_of!(asn1_string_st, type_) - 4usize];
    ["Offset of field: asn1_string_st::data"]
        [::std::mem::offset_of!(asn1_string_st, data) - 8usize];
    ["Offset of field: asn1_string_st::flags"]
        [::std::mem::offset_of!(asn1_string_st, flags) - 16usize];
};
impl Default for asn1_string_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct ASN1_ENCODING_st {
    pub enc: *mut ::std::os::raw::c_uchar,
    pub len: ::std::os::raw::c_long,
    pub modified: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ASN1_ENCODING_st"][::std::mem::size_of::<ASN1_ENCODING_st>() - 24usize];
    ["Alignment of ASN1_ENCODING_st"][::std::mem::align_of::<ASN1_ENCODING_st>() - 8usize];
    ["Offset of field: ASN1_ENCODING_st::enc"]
        [::std::mem::offset_of!(ASN1_ENCODING_st, enc) - 0usize];
    ["Offset of field: ASN1_ENCODING_st::len"]
        [::std::mem::offset_of!(ASN1_ENCODING_st, len) - 8usize];
    ["Offset of field: ASN1_ENCODING_st::modified"]
        [::std::mem::offset_of!(ASN1_ENCODING_st, modified) - 16usize];
};
impl Default for ASN1_ENCODING_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type ASN1_ENCODING = ASN1_ENCODING_st;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct asn1_string_table_st {
    pub nid: ::std::os::raw::c_int,
    pub minsize: ::std::os::raw::c_long,
    pub maxsize: ::std::os::raw::c_long,
    pub mask: ::std::os::raw::c_ulong,
    pub flags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn1_string_table_st"][::std::mem::size_of::<asn1_string_table_st>() - 40usize];
    ["Alignment of asn1_string_table_st"][::std::mem::align_of::<asn1_string_table_st>() - 8usize];
    ["Offset of field: asn1_string_table_st::nid"]
        [::std::mem::offset_of!(asn1_string_table_st, nid) - 0usize];
    ["Offset of field: asn1_string_table_st::minsize"]
        [::std::mem::offset_of!(asn1_string_table_st, minsize) - 8usize];
    ["Offset of field: asn1_string_table_st::maxsize"]
        [::std::mem::offset_of!(asn1_string_table_st, maxsize) - 16usize];
    ["Offset of field: asn1_string_table_st::mask"]
        [::std::mem::offset_of!(asn1_string_table_st, mask) - 24usize];
    ["Offset of field: asn1_string_table_st::flags"]
        [::std::mem::offset_of!(asn1_string_table_st, flags) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_STRING_TABLE {
    _unused: [u8; 0],
}
pub type sk_ASN1_STRING_TABLE_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_STRING_TABLE,
        b: *const *const ASN1_STRING_TABLE,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_ASN1_STRING_TABLE_freefunc =
    ::std::option::Option<unsafe extern "C" fn(a: *mut ASN1_STRING_TABLE)>;
pub type sk_ASN1_STRING_TABLE_copyfunc = ::std::option::Option<
    unsafe extern "C" fn(a: *const ASN1_STRING_TABLE) -> *mut ASN1_STRING_TABLE,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_TEMPLATE_st {
    _unused: [u8; 0],
}
pub type ASN1_TEMPLATE = ASN1_TEMPLATE_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_TLC_st {
    _unused: [u8; 0],
}
pub type ASN1_TLC = ASN1_TLC_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ASN1_VALUE_st {
    _unused: [u8; 0],
}
pub type ASN1_VALUE = ASN1_VALUE_st;
pub type d2i_of_void = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: *mut *const ::std::os::raw::c_uchar,
        arg3: ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type i2d_of_void = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_i2d_of_void_ctx = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut *mut ::std::os::raw::c_uchar,
        vctx: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type ASN1_ITEM_EXP = ::std::option::Option<unsafe extern "C" fn() -> *const ASN1_ITEM>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct asn1_type_st {
    pub type_: ::std::os::raw::c_int,
    pub value: asn1_type_st__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union asn1_type_st__bindgen_ty_1 {
    pub ptr: *mut ::std::os::raw::c_char,
    pub boolean: ASN1_BOOLEAN,
    pub asn1_string: *mut ASN1_STRING,
    pub object: *mut ASN1_OBJECT,
    pub integer: *mut ASN1_INTEGER,
    pub enumerated: *mut ASN1_ENUMERATED,
    pub bit_string: *mut ASN1_BIT_STRING,
    pub octet_string: *mut ASN1_OCTET_STRING,
    pub printablestring: *mut ASN1_PRINTABLESTRING,
    pub t61string: *mut ASN1_T61STRING,
    pub ia5string: *mut ASN1_IA5STRING,
    pub generalstring: *mut ASN1_GENERALSTRING,
    pub bmpstring: *mut ASN1_BMPSTRING,
    pub universalstring: *mut ASN1_UNIVERSALSTRING,
    pub utctime: *mut ASN1_UTCTIME,
    pub generalizedtime: *mut ASN1_GENERALIZEDTIME,
    pub visiblestring: *mut ASN1_VISIBLESTRING,
    pub utf8string: *mut ASN1_UTF8STRING,
    pub set: *mut ASN1_STRING,
    pub sequence: *mut ASN1_STRING,
    pub asn1_value: *mut ASN1_VALUE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn1_type_st__bindgen_ty_1"]
        [::std::mem::size_of::<asn1_type_st__bindgen_ty_1>() - 8usize];
    ["Alignment of asn1_type_st__bindgen_ty_1"]
        [::std::mem::align_of::<asn1_type_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::ptr"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, ptr) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::boolean"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, boolean) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::asn1_string"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, asn1_string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::object"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, object) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::integer"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, integer) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::enumerated"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, enumerated) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::bit_string"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, bit_string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::octet_string"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, octet_string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::printablestring"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, printablestring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::t61string"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, t61string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::ia5string"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, ia5string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::generalstring"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, generalstring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::bmpstring"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, bmpstring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::universalstring"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, universalstring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::utctime"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, utctime) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::generalizedtime"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, generalizedtime) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::visiblestring"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, visiblestring) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::utf8string"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, utf8string) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::set"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, set) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::sequence"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, sequence) - 0usize];
    ["Offset of field: asn1_type_st__bindgen_ty_1::asn1_value"]
        [::std::mem::offset_of!(asn1_type_st__bindgen_ty_1, asn1_value) - 0usize];
};
impl Default for asn1_type_st__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of asn1_type_st"][::std::mem::size_of::<asn1_type_st>() - 16usize];
    ["Alignment of asn1_type_st"][::std::mem::align_of::<asn1_type_st>() - 8usize];
    ["Offset of field: asn1_type_st::type_"][::std::mem::offset_of!(asn1_type_st, type_) - 0usize];
    ["Offset of field: asn1_type_st::value"][::std::mem::offset_of!(asn1_type_st, value) - 8usize];
};
impl Default for asn1_type_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_TYPE {
    _unused: [u8; 0],
}
pub type sk_ASN1_TYPE_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_TYPE,
        b: *const *const ASN1_TYPE,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_ASN1_TYPE_freefunc = ::std::option::Option<unsafe extern "C" fn(a: *mut ASN1_TYPE)>;
pub type sk_ASN1_TYPE_copyfunc =
    ::std::option::Option<unsafe extern "C" fn(a: *const ASN1_TYPE) -> *mut ASN1_TYPE>;
pub type ASN1_SEQUENCE_ANY = stack_st_ASN1_TYPE;
unsafe extern "C" {
    pub fn d2i_ASN1_SEQUENCE_ANY(
        a: *mut *mut ASN1_SEQUENCE_ANY,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_SEQUENCE_ANY;
}
unsafe extern "C" {
    pub fn i2d_ASN1_SEQUENCE_ANY(
        a: *const ASN1_SEQUENCE_ANY,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_SEQUENCE_ANY_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn d2i_ASN1_SET_ANY(
        a: *mut *mut ASN1_SEQUENCE_ANY,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_SEQUENCE_ANY;
}
unsafe extern "C" {
    pub fn i2d_ASN1_SET_ANY(
        a: *const ASN1_SEQUENCE_ANY,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_SET_ANY_it() -> *const ASN1_ITEM;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct BIT_STRING_BITNAME_st {
    pub bitnum: ::std::os::raw::c_int,
    pub lname: *const ::std::os::raw::c_char,
    pub sname: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BIT_STRING_BITNAME_st"][::std::mem::size_of::<BIT_STRING_BITNAME_st>() - 24usize];
    ["Alignment of BIT_STRING_BITNAME_st"]
        [::std::mem::align_of::<BIT_STRING_BITNAME_st>() - 8usize];
    ["Offset of field: BIT_STRING_BITNAME_st::bitnum"]
        [::std::mem::offset_of!(BIT_STRING_BITNAME_st, bitnum) - 0usize];
    ["Offset of field: BIT_STRING_BITNAME_st::lname"]
        [::std::mem::offset_of!(BIT_STRING_BITNAME_st, lname) - 8usize];
    ["Offset of field: BIT_STRING_BITNAME_st::sname"]
        [::std::mem::offset_of!(BIT_STRING_BITNAME_st, sname) - 16usize];
};
impl Default for BIT_STRING_BITNAME_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type BIT_STRING_BITNAME = BIT_STRING_BITNAME_st;
unsafe extern "C" {
    pub fn ASN1_TYPE_new() -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_free(a: *mut ASN1_TYPE);
}
unsafe extern "C" {
    pub fn d2i_ASN1_TYPE(
        a: *mut *mut ASN1_TYPE,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    pub fn i2d_ASN1_TYPE(
        a: *const ASN1_TYPE,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ANY_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_get(a: *const ASN1_TYPE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_set(
        a: *mut ASN1_TYPE,
        type_: ::std::os::raw::c_int,
        value: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn ASN1_TYPE_set1(
        a: *mut ASN1_TYPE,
        type_: ::std::os::raw::c_int,
        value: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_cmp(a: *const ASN1_TYPE, b: *const ASN1_TYPE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_pack_sequence(
        it: *const ASN1_ITEM,
        s: *mut ::std::os::raw::c_void,
        t: *mut *mut ASN1_TYPE,
    ) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_unpack_sequence(
        it: *const ASN1_ITEM,
        t: *const ASN1_TYPE,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_OBJECT {
    _unused: [u8; 0],
}
pub type sk_ASN1_OBJECT_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_OBJECT,
        b: *const *const ASN1_OBJECT,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_ASN1_OBJECT_freefunc = ::std::option::Option<unsafe extern "C" fn(a: *mut ASN1_OBJECT)>;
pub type sk_ASN1_OBJECT_copyfunc =
    ::std::option::Option<unsafe extern "C" fn(a: *const ASN1_OBJECT) -> *mut ASN1_OBJECT>;
unsafe extern "C" {
    pub fn ASN1_OBJECT_new() -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    pub fn ASN1_OBJECT_free(a: *mut ASN1_OBJECT);
}
unsafe extern "C" {
    pub fn d2i_ASN1_OBJECT(
        a: *mut *mut ASN1_OBJECT,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    pub fn i2d_ASN1_OBJECT(
        a: *const ASN1_OBJECT,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_OBJECT_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_STRING_new() -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_STRING_free(a: *mut ASN1_STRING);
}
unsafe extern "C" {
    pub fn ASN1_STRING_clear_free(a: *mut ASN1_STRING);
}
unsafe extern "C" {
    pub fn ASN1_STRING_copy(
        dst: *mut ASN1_STRING,
        str_: *const ASN1_STRING,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_dup(a: *const ASN1_STRING) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_STRING_type_new(type_: ::std::os::raw::c_int) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_STRING_cmp(a: *const ASN1_STRING, b: *const ASN1_STRING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_set(
        str_: *mut ASN1_STRING,
        data: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_set0(
        str_: *mut ASN1_STRING,
        data: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn ASN1_STRING_length(x: *const ASN1_STRING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_length_set(x: *mut ASN1_STRING, n: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn ASN1_STRING_type(x: *const ASN1_STRING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_data(x: *mut ASN1_STRING) -> *mut ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn ASN1_STRING_get0_data(x: *const ASN1_STRING) -> *const ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_new() -> *mut ASN1_BIT_STRING;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_free(a: *mut ASN1_BIT_STRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_BIT_STRING(
        a: *mut *mut ASN1_BIT_STRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_BIT_STRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_BIT_STRING(
        a: *const ASN1_BIT_STRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_set(
        a: *mut ASN1_BIT_STRING,
        d: *mut ::std::os::raw::c_uchar,
        length: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_set_bit(
        a: *mut ASN1_BIT_STRING,
        n: ::std::os::raw::c_int,
        value: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_get_bit(
        a: *const ASN1_BIT_STRING,
        n: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_check(
        a: *const ASN1_BIT_STRING,
        flags: *const ::std::os::raw::c_uchar,
        flags_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_name_print(
        out: *mut BIO,
        bs: *mut ASN1_BIT_STRING,
        tbl: *mut BIT_STRING_BITNAME,
        indent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_num_asc(
        name: *const ::std::os::raw::c_char,
        tbl: *mut BIT_STRING_BITNAME,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BIT_STRING_set_asc(
        bs: *mut ASN1_BIT_STRING,
        name: *const ::std::os::raw::c_char,
        value: ::std::os::raw::c_int,
        tbl: *mut BIT_STRING_BITNAME,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_INTEGER {
    _unused: [u8; 0],
}
pub type sk_ASN1_INTEGER_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_INTEGER,
        b: *const *const ASN1_INTEGER,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_ASN1_INTEGER_freefunc =
    ::std::option::Option<unsafe extern "C" fn(a: *mut ASN1_INTEGER)>;
pub type sk_ASN1_INTEGER_copyfunc =
    ::std::option::Option<unsafe extern "C" fn(a: *const ASN1_INTEGER) -> *mut ASN1_INTEGER>;
unsafe extern "C" {
    pub fn ASN1_INTEGER_new() -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_free(a: *mut ASN1_INTEGER);
}
unsafe extern "C" {
    pub fn d2i_ASN1_INTEGER(
        a: *mut *mut ASN1_INTEGER,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn i2d_ASN1_INTEGER(
        a: *const ASN1_INTEGER,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn d2i_ASN1_UINTEGER(
        a: *mut *mut ASN1_INTEGER,
        pp: *mut *const ::std::os::raw::c_uchar,
        length: ::std::os::raw::c_long,
    ) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_dup(a: *const ASN1_INTEGER) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_cmp(
        x: *const ASN1_INTEGER,
        y: *const ASN1_INTEGER,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_new() -> *mut ASN1_ENUMERATED;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_free(a: *mut ASN1_ENUMERATED);
}
unsafe extern "C" {
    pub fn d2i_ASN1_ENUMERATED(
        a: *mut *mut ASN1_ENUMERATED,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_ENUMERATED;
}
unsafe extern "C" {
    pub fn i2d_ASN1_ENUMERATED(
        a: *const ASN1_ENUMERATED,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_check(a: *const ASN1_UTCTIME) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_set(s: *mut ASN1_UTCTIME, t: time_t) -> *mut ASN1_UTCTIME;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_adj(
        s: *mut ASN1_UTCTIME,
        t: time_t,
        offset_day: ::std::os::raw::c_int,
        offset_sec: ::std::os::raw::c_long,
    ) -> *mut ASN1_UTCTIME;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_set_string(
        s: *mut ASN1_UTCTIME,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_cmp_time_t(s: *const ASN1_UTCTIME, t: time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_check(a: *const ASN1_GENERALIZEDTIME) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_set(
        s: *mut ASN1_GENERALIZEDTIME,
        t: time_t,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_adj(
        s: *mut ASN1_GENERALIZEDTIME,
        t: time_t,
        offset_day: ::std::os::raw::c_int,
        offset_sec: ::std::os::raw::c_long,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_set_string(
        s: *mut ASN1_GENERALIZEDTIME,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_diff(
        pday: *mut ::std::os::raw::c_int,
        psec: *mut ::std::os::raw::c_int,
        from: *const ASN1_TIME,
        to: *const ASN1_TIME,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_new() -> *mut ASN1_OCTET_STRING;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_free(a: *mut ASN1_OCTET_STRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_OCTET_STRING(
        a: *mut *mut ASN1_OCTET_STRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_OCTET_STRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_OCTET_STRING(
        a: *const ASN1_OCTET_STRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_dup(a: *const ASN1_OCTET_STRING) -> *mut ASN1_OCTET_STRING;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_cmp(
        a: *const ASN1_OCTET_STRING,
        b: *const ASN1_OCTET_STRING,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_set(
        str_: *mut ASN1_OCTET_STRING,
        data: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_UTF8STRING {
    _unused: [u8; 0],
}
pub type sk_ASN1_UTF8STRING_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_UTF8STRING,
        b: *const *const ASN1_UTF8STRING,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_ASN1_UTF8STRING_freefunc =
    ::std::option::Option<unsafe extern "C" fn(a: *mut ASN1_UTF8STRING)>;
pub type sk_ASN1_UTF8STRING_copyfunc =
    ::std::option::Option<unsafe extern "C" fn(a: *const ASN1_UTF8STRING) -> *mut ASN1_UTF8STRING>;
unsafe extern "C" {
    pub fn ASN1_VISIBLESTRING_new() -> *mut ASN1_VISIBLESTRING;
}
unsafe extern "C" {
    pub fn ASN1_VISIBLESTRING_free(a: *mut ASN1_VISIBLESTRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_VISIBLESTRING(
        a: *mut *mut ASN1_VISIBLESTRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_VISIBLESTRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_VISIBLESTRING(
        a: *const ASN1_VISIBLESTRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_VISIBLESTRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_UNIVERSALSTRING_new() -> *mut ASN1_UNIVERSALSTRING;
}
unsafe extern "C" {
    pub fn ASN1_UNIVERSALSTRING_free(a: *mut ASN1_UNIVERSALSTRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_UNIVERSALSTRING(
        a: *mut *mut ASN1_UNIVERSALSTRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_UNIVERSALSTRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_UNIVERSALSTRING(
        a: *const ASN1_UNIVERSALSTRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_UNIVERSALSTRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_UTF8STRING_new() -> *mut ASN1_UTF8STRING;
}
unsafe extern "C" {
    pub fn ASN1_UTF8STRING_free(a: *mut ASN1_UTF8STRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_UTF8STRING(
        a: *mut *mut ASN1_UTF8STRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_UTF8STRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_UTF8STRING(
        a: *const ASN1_UTF8STRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_UTF8STRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_NULL_new() -> *mut ASN1_NULL;
}
unsafe extern "C" {
    pub fn ASN1_NULL_free(a: *mut ASN1_NULL);
}
unsafe extern "C" {
    pub fn d2i_ASN1_NULL(
        a: *mut *mut ASN1_NULL,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_NULL;
}
unsafe extern "C" {
    pub fn i2d_ASN1_NULL(
        a: *const ASN1_NULL,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_NULL_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_BMPSTRING_new() -> *mut ASN1_BMPSTRING;
}
unsafe extern "C" {
    pub fn ASN1_BMPSTRING_free(a: *mut ASN1_BMPSTRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_BMPSTRING(
        a: *mut *mut ASN1_BMPSTRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_BMPSTRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_BMPSTRING(
        a: *const ASN1_BMPSTRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_BMPSTRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn UTF8_getc(
        str_: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        val: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn UTF8_putc(
        str_: *mut ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        value: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stack_st_ASN1_GENERALSTRING {
    _unused: [u8; 0],
}
pub type sk_ASN1_GENERALSTRING_compfunc = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const *const ASN1_GENERALSTRING,
        b: *const *const ASN1_GENERALSTRING,
    ) -> ::std::os::raw::c_int,
>;
pub type sk_ASN1_GENERALSTRING_freefunc =
    ::std::option::Option<unsafe extern "C" fn(a: *mut ASN1_GENERALSTRING)>;
pub type sk_ASN1_GENERALSTRING_copyfunc = ::std::option::Option<
    unsafe extern "C" fn(a: *const ASN1_GENERALSTRING) -> *mut ASN1_GENERALSTRING,
>;
unsafe extern "C" {
    pub fn ASN1_PRINTABLE_new() -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_PRINTABLE_free(a: *mut ASN1_STRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_PRINTABLE(
        a: *mut *mut ASN1_STRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_PRINTABLE(
        a: *const ASN1_STRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_PRINTABLE_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn DIRECTORYSTRING_new() -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn DIRECTORYSTRING_free(a: *mut ASN1_STRING);
}
unsafe extern "C" {
    pub fn d2i_DIRECTORYSTRING(
        a: *mut *mut ASN1_STRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn i2d_DIRECTORYSTRING(
        a: *const ASN1_STRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn DIRECTORYSTRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn DISPLAYTEXT_new() -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn DISPLAYTEXT_free(a: *mut ASN1_STRING);
}
unsafe extern "C" {
    pub fn d2i_DISPLAYTEXT(
        a: *mut *mut ASN1_STRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn i2d_DISPLAYTEXT(
        a: *const ASN1_STRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn DISPLAYTEXT_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_PRINTABLESTRING_new() -> *mut ASN1_PRINTABLESTRING;
}
unsafe extern "C" {
    pub fn ASN1_PRINTABLESTRING_free(a: *mut ASN1_PRINTABLESTRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_PRINTABLESTRING(
        a: *mut *mut ASN1_PRINTABLESTRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_PRINTABLESTRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_PRINTABLESTRING(
        a: *const ASN1_PRINTABLESTRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_PRINTABLESTRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_T61STRING_new() -> *mut ASN1_T61STRING;
}
unsafe extern "C" {
    pub fn ASN1_T61STRING_free(a: *mut ASN1_T61STRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_T61STRING(
        a: *mut *mut ASN1_T61STRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_T61STRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_T61STRING(
        a: *const ASN1_T61STRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_T61STRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_IA5STRING_new() -> *mut ASN1_IA5STRING;
}
unsafe extern "C" {
    pub fn ASN1_IA5STRING_free(a: *mut ASN1_IA5STRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_IA5STRING(
        a: *mut *mut ASN1_IA5STRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_IA5STRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_IA5STRING(
        a: *const ASN1_IA5STRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_IA5STRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_GENERALSTRING_new() -> *mut ASN1_GENERALSTRING;
}
unsafe extern "C" {
    pub fn ASN1_GENERALSTRING_free(a: *mut ASN1_GENERALSTRING);
}
unsafe extern "C" {
    pub fn d2i_ASN1_GENERALSTRING(
        a: *mut *mut ASN1_GENERALSTRING,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_GENERALSTRING;
}
unsafe extern "C" {
    pub fn i2d_ASN1_GENERALSTRING(
        a: *const ASN1_GENERALSTRING,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_GENERALSTRING_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_new() -> *mut ASN1_UTCTIME;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_free(a: *mut ASN1_UTCTIME);
}
unsafe extern "C" {
    pub fn d2i_ASN1_UTCTIME(
        a: *mut *mut ASN1_UTCTIME,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_UTCTIME;
}
unsafe extern "C" {
    pub fn i2d_ASN1_UTCTIME(
        a: *const ASN1_UTCTIME,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_new() -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_free(a: *mut ASN1_GENERALIZEDTIME);
}
unsafe extern "C" {
    pub fn d2i_ASN1_GENERALIZEDTIME(
        a: *mut *mut ASN1_GENERALIZEDTIME,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn i2d_ASN1_GENERALIZEDTIME(
        a: *const ASN1_GENERALIZEDTIME,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_TIME_new() -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn ASN1_TIME_free(a: *mut ASN1_TIME);
}
unsafe extern "C" {
    pub fn d2i_ASN1_TIME(
        a: *mut *mut ASN1_TIME,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn i2d_ASN1_TIME(
        a: *const ASN1_TIME,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_TIME_dup(a: *const ASN1_TIME) -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_dup(a: *const ASN1_UTCTIME) -> *mut ASN1_UTCTIME;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_dup(a: *const ASN1_GENERALIZEDTIME) -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn ASN1_OCTET_STRING_NDEF_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_TIME_set(s: *mut ASN1_TIME, t: time_t) -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn ASN1_TIME_adj(
        s: *mut ASN1_TIME,
        t: time_t,
        offset_day: ::std::os::raw::c_int,
        offset_sec: ::std::os::raw::c_long,
    ) -> *mut ASN1_TIME;
}
unsafe extern "C" {
    pub fn ASN1_TIME_check(t: *const ASN1_TIME) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_to_generalizedtime(
        t: *const ASN1_TIME,
        out: *mut *mut ASN1_GENERALIZEDTIME,
    ) -> *mut ASN1_GENERALIZEDTIME;
}
unsafe extern "C" {
    pub fn ASN1_TIME_set_string(
        s: *mut ASN1_TIME,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_set_string_X509(
        s: *mut ASN1_TIME,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_to_tm(s: *const ASN1_TIME, tm: *mut tm) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_normalize(s: *mut ASN1_TIME) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_cmp_time_t(s: *const ASN1_TIME, t: time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_compare(a: *const ASN1_TIME, b: *const ASN1_TIME) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn i2a_ASN1_INTEGER(bp: *mut BIO, a: *const ASN1_INTEGER) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn a2i_ASN1_INTEGER(
        bp: *mut BIO,
        bs: *mut ASN1_INTEGER,
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn i2a_ASN1_ENUMERATED(bp: *mut BIO, a: *const ASN1_ENUMERATED) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn a2i_ASN1_ENUMERATED(
        bp: *mut BIO,
        bs: *mut ASN1_ENUMERATED,
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn i2a_ASN1_OBJECT(bp: *mut BIO, a: *const ASN1_OBJECT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn a2i_ASN1_STRING(
        bp: *mut BIO,
        bs: *mut ASN1_STRING,
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn i2a_ASN1_STRING(
        bp: *mut BIO,
        a: *const ASN1_STRING,
        type_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn i2t_ASN1_OBJECT(
        buf: *mut ::std::os::raw::c_char,
        buf_len: ::std::os::raw::c_int,
        a: *const ASN1_OBJECT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn a2d_ASN1_OBJECT(
        out: *mut ::std::os::raw::c_uchar,
        olen: ::std::os::raw::c_int,
        buf: *const ::std::os::raw::c_char,
        num: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_OBJECT_create(
        nid: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        sn: *const ::std::os::raw::c_char,
        ln: *const ::std::os::raw::c_char,
    ) -> *mut ASN1_OBJECT;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_get_int64(pr: *mut i64, a: *const ASN1_INTEGER) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_set_int64(a: *mut ASN1_INTEGER, r: i64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_get_uint64(pr: *mut u64, a: *const ASN1_INTEGER) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_set_uint64(a: *mut ASN1_INTEGER, r: u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_set(
        a: *mut ASN1_INTEGER,
        v: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_get(a: *const ASN1_INTEGER) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn BN_to_ASN1_INTEGER(bn: *const BIGNUM, ai: *mut ASN1_INTEGER) -> *mut ASN1_INTEGER;
}
unsafe extern "C" {
    pub fn ASN1_INTEGER_to_BN(ai: *const ASN1_INTEGER, bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_get_int64(
        pr: *mut i64,
        a: *const ASN1_ENUMERATED,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_set_int64(a: *mut ASN1_ENUMERATED, r: i64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_set(
        a: *mut ASN1_ENUMERATED,
        v: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_get(a: *const ASN1_ENUMERATED) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn BN_to_ASN1_ENUMERATED(
        bn: *const BIGNUM,
        ai: *mut ASN1_ENUMERATED,
    ) -> *mut ASN1_ENUMERATED;
}
unsafe extern "C" {
    pub fn ASN1_ENUMERATED_to_BN(ai: *const ASN1_ENUMERATED, bn: *mut BIGNUM) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn ASN1_PRINTABLE_type(
        s: *const ::std::os::raw::c_uchar,
        max: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_tag2bit(tag: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_get_object(
        pp: *mut *const ::std::os::raw::c_uchar,
        plength: *mut ::std::os::raw::c_long,
        ptag: *mut ::std::os::raw::c_int,
        pclass: *mut ::std::os::raw::c_int,
        omax: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_check_infinite_end(
        p: *mut *mut ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_const_check_infinite_end(
        p: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_put_object(
        pp: *mut *mut ::std::os::raw::c_uchar,
        constructed: ::std::os::raw::c_int,
        length: ::std::os::raw::c_int,
        tag: ::std::os::raw::c_int,
        xclass: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn ASN1_put_eoc(pp: *mut *mut ::std::os::raw::c_uchar) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_object_size(
        constructed: ::std::os::raw::c_int,
        length: ::std::os::raw::c_int,
        tag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_dup(
        i2d: i2d_of_void,
        d2i: d2i_of_void,
        x: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_dup(
        it: *const ASN1_ITEM,
        x: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_sign_ex(
        it: *const ASN1_ITEM,
        algor1: *mut X509_ALGOR,
        algor2: *mut X509_ALGOR,
        signature: *mut ASN1_BIT_STRING,
        data: *const ::std::os::raw::c_void,
        id: *const ASN1_OCTET_STRING,
        pkey: *mut EVP_PKEY,
        md: *const EVP_MD,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_item_verify_ex(
        it: *const ASN1_ITEM,
        alg: *const X509_ALGOR,
        signature: *const ASN1_BIT_STRING,
        data: *const ::std::os::raw::c_void,
        id: *const ASN1_OCTET_STRING,
        pkey: *mut EVP_PKEY,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_to_UTF8(
        out: *mut *mut ::std::os::raw::c_uchar,
        in_: *const ASN1_STRING,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_d2i_bio(
        xnew: ::std::option::Option<unsafe extern "C" fn() -> *mut ::std::os::raw::c_void>,
        d2i: d2i_of_void,
        in_: *mut BIO,
        x: *mut *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_d2i_bio_ex(
        it: *const ASN1_ITEM,
        in_: *mut BIO,
        pval: *mut ::std::os::raw::c_void,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_d2i_bio(
        it: *const ASN1_ITEM,
        in_: *mut BIO,
        pval: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ASN1_i2d_bio(
        i2d: i2d_of_void,
        out: *mut BIO,
        x: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_item_i2d_bio(
        it: *const ASN1_ITEM,
        out: *mut BIO,
        x: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_item_i2d_mem_bio(it: *const ASN1_ITEM, val: *const ASN1_VALUE) -> *mut BIO;
}
unsafe extern "C" {
    pub fn ASN1_UTCTIME_print(fp: *mut BIO, a: *const ASN1_UTCTIME) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_GENERALIZEDTIME_print(
        fp: *mut BIO,
        a: *const ASN1_GENERALIZEDTIME,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_print(bp: *mut BIO, tm: *const ASN1_TIME) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TIME_print_ex(
        bp: *mut BIO,
        tm: *const ASN1_TIME,
        flags: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_print(bp: *mut BIO, v: *const ASN1_STRING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_print_ex(
        out: *mut BIO,
        str_: *const ASN1_STRING,
        flags: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_buf_print(
        bp: *mut BIO,
        buf: *const ::std::os::raw::c_uchar,
        buflen: usize,
        off: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_bn_print(
        bp: *mut BIO,
        number: *const ::std::os::raw::c_char,
        num: *const BIGNUM,
        buf: *mut ::std::os::raw::c_uchar,
        off: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_parse(
        bp: *mut BIO,
        pp: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
        indent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_parse_dump(
        bp: *mut BIO,
        pp: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
        indent: ::std::os::raw::c_int,
        dump: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_tag2str(tag: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ASN1_UNIVERSALSTRING_to_string(s: *mut ASN1_UNIVERSALSTRING) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_set_octetstring(
        a: *mut ASN1_TYPE,
        data: *mut ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_get_octetstring(
        a: *const ASN1_TYPE,
        data: *mut ::std::os::raw::c_uchar,
        max_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_set_int_octetstring(
        a: *mut ASN1_TYPE,
        num: ::std::os::raw::c_long,
        data: *mut ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_TYPE_get_int_octetstring(
        a: *const ASN1_TYPE,
        num: *mut ::std::os::raw::c_long,
        data: *mut ::std::os::raw::c_uchar,
        max_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_item_unpack(
        oct: *const ASN1_STRING,
        it: *const ASN1_ITEM,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_unpack_ex(
        oct: *const ASN1_STRING,
        it: *const ASN1_ITEM,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ASN1_item_pack(
        obj: *mut ::std::os::raw::c_void,
        it: *const ASN1_ITEM,
        oct: *mut *mut ASN1_OCTET_STRING,
    ) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_STRING_set_default_mask(mask: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn ASN1_STRING_set_default_mask_asc(
        p: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_get_default_mask() -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_mbstring_copy(
        out: *mut *mut ASN1_STRING,
        in_: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        inform: ::std::os::raw::c_int,
        mask: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_mbstring_ncopy(
        out: *mut *mut ASN1_STRING,
        in_: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
        inform: ::std::os::raw::c_int,
        mask: ::std::os::raw::c_ulong,
        minsize: ::std::os::raw::c_long,
        maxsize: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_set_by_NID(
        out: *mut *mut ASN1_STRING,
        in_: *const ::std::os::raw::c_uchar,
        inlen: ::std::os::raw::c_int,
        inform: ::std::os::raw::c_int,
        nid: ::std::os::raw::c_int,
    ) -> *mut ASN1_STRING;
}
unsafe extern "C" {
    pub fn ASN1_STRING_TABLE_get(nid: ::std::os::raw::c_int) -> *mut ASN1_STRING_TABLE;
}
unsafe extern "C" {
    pub fn ASN1_STRING_TABLE_add(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_long,
        arg4: ::std::os::raw::c_ulong,
        arg5: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_STRING_TABLE_cleanup();
}
unsafe extern "C" {
    pub fn ASN1_item_new(it: *const ASN1_ITEM) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    pub fn ASN1_item_new_ex(
        it: *const ASN1_ITEM,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    pub fn ASN1_item_free(val: *mut ASN1_VALUE, it: *const ASN1_ITEM);
}
unsafe extern "C" {
    pub fn ASN1_item_d2i_ex(
        val: *mut *mut ASN1_VALUE,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
        it: *const ASN1_ITEM,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    pub fn ASN1_item_d2i(
        val: *mut *mut ASN1_VALUE,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
        it: *const ASN1_ITEM,
    ) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    pub fn ASN1_item_i2d(
        val: *const ASN1_VALUE,
        out: *mut *mut ::std::os::raw::c_uchar,
        it: *const ASN1_ITEM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_item_ndef_i2d(
        val: *const ASN1_VALUE,
        out: *mut *mut ::std::os::raw::c_uchar,
        it: *const ASN1_ITEM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_add_oid_module();
}
unsafe extern "C" {
    pub fn ASN1_add_stable_module();
}
unsafe extern "C" {
    pub fn ASN1_generate_nconf(
        str_: *const ::std::os::raw::c_char,
        nconf: *mut CONF,
    ) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    pub fn ASN1_generate_v3(
        str_: *const ::std::os::raw::c_char,
        cnf: *mut X509V3_CTX,
    ) -> *mut ASN1_TYPE;
}
unsafe extern "C" {
    pub fn ASN1_str2mask(
        str_: *const ::std::os::raw::c_char,
        pmask: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_item_print(
        out: *mut BIO,
        ifld: *const ASN1_VALUE,
        indent: ::std::os::raw::c_int,
        it: *const ASN1_ITEM,
        pctx: *const ASN1_PCTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_PCTX_new() -> *mut ASN1_PCTX;
}
unsafe extern "C" {
    pub fn ASN1_PCTX_free(p: *mut ASN1_PCTX);
}
unsafe extern "C" {
    pub fn ASN1_PCTX_get_flags(p: *const ASN1_PCTX) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_PCTX_set_flags(p: *mut ASN1_PCTX, flags: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn ASN1_PCTX_get_nm_flags(p: *const ASN1_PCTX) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_PCTX_set_nm_flags(p: *mut ASN1_PCTX, flags: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn ASN1_PCTX_get_cert_flags(p: *const ASN1_PCTX) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_PCTX_set_cert_flags(p: *mut ASN1_PCTX, flags: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn ASN1_PCTX_get_oid_flags(p: *const ASN1_PCTX) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_PCTX_set_oid_flags(p: *mut ASN1_PCTX, flags: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn ASN1_PCTX_get_str_flags(p: *const ASN1_PCTX) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_PCTX_set_str_flags(p: *mut ASN1_PCTX, flags: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn ASN1_SCTX_new(
        scan_cb: ::std::option::Option<
            unsafe extern "C" fn(ctx: *mut ASN1_SCTX) -> ::std::os::raw::c_int,
        >,
    ) -> *mut ASN1_SCTX;
}
unsafe extern "C" {
    pub fn ASN1_SCTX_free(p: *mut ASN1_SCTX);
}
unsafe extern "C" {
    pub fn ASN1_SCTX_get_item(p: *mut ASN1_SCTX) -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_SCTX_get_template(p: *mut ASN1_SCTX) -> *const ASN1_TEMPLATE;
}
unsafe extern "C" {
    pub fn ASN1_SCTX_get_flags(p: *mut ASN1_SCTX) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn ASN1_SCTX_set_app_data(p: *mut ASN1_SCTX, data: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn ASN1_SCTX_get_app_data(p: *mut ASN1_SCTX) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn BIO_f_asn1() -> *const BIO_METHOD;
}
unsafe extern "C" {
    pub fn BIO_new_NDEF(out: *mut BIO, val: *mut ASN1_VALUE, it: *const ASN1_ITEM) -> *mut BIO;
}
unsafe extern "C" {
    pub fn i2d_ASN1_bio_stream(
        out: *mut BIO,
        val: *mut ASN1_VALUE,
        in_: *mut BIO,
        flags: ::std::os::raw::c_int,
        it: *const ASN1_ITEM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn PEM_write_bio_ASN1_stream(
        out: *mut BIO,
        val: *mut ASN1_VALUE,
        in_: *mut BIO,
        flags: ::std::os::raw::c_int,
        hdr: *const ::std::os::raw::c_char,
        it: *const ASN1_ITEM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SMIME_write_ASN1(
        bio: *mut BIO,
        val: *mut ASN1_VALUE,
        data: *mut BIO,
        flags: ::std::os::raw::c_int,
        ctype_nid: ::std::os::raw::c_int,
        econt_nid: ::std::os::raw::c_int,
        mdalgs: *mut stack_st_X509_ALGOR,
        it: *const ASN1_ITEM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SMIME_write_ASN1_ex(
        bio: *mut BIO,
        val: *mut ASN1_VALUE,
        data: *mut BIO,
        flags: ::std::os::raw::c_int,
        ctype_nid: ::std::os::raw::c_int,
        econt_nid: ::std::os::raw::c_int,
        mdalgs: *mut stack_st_X509_ALGOR,
        it: *const ASN1_ITEM,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SMIME_read_ASN1(
        bio: *mut BIO,
        bcont: *mut *mut BIO,
        it: *const ASN1_ITEM,
    ) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    pub fn SMIME_read_ASN1_ex(
        bio: *mut BIO,
        flags: ::std::os::raw::c_int,
        bcont: *mut *mut BIO,
        it: *const ASN1_ITEM,
        x: *mut *mut ASN1_VALUE,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> *mut ASN1_VALUE;
}
unsafe extern "C" {
    pub fn SMIME_crlf_copy(
        in_: *mut BIO,
        out: *mut BIO,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SMIME_text(in_: *mut BIO, out: *mut BIO) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ASN1_ITEM_lookup(name: *const ::std::os::raw::c_char) -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ASN1_ITEM_get(i: usize) -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_locate(
        p: *mut OSSL_PARAM,
        key: *const ::std::os::raw::c_char,
    ) -> *mut OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_locate_const(
        p: *const OSSL_PARAM,
        key: *const ::std::os::raw::c_char,
    ) -> *const OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_int(
        key: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_int,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_uint(
        key: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_uint,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_long(
        key: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_long,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_ulong(
        key: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_ulong,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_int32(
        key: *const ::std::os::raw::c_char,
        buf: *mut i32,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_uint32(
        key: *const ::std::os::raw::c_char,
        buf: *mut u32,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_int64(
        key: *const ::std::os::raw::c_char,
        buf: *mut i64,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_uint64(
        key: *const ::std::os::raw::c_char,
        buf: *mut u64,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_size_t(
        key: *const ::std::os::raw::c_char,
        buf: *mut usize,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_time_t(
        key: *const ::std::os::raw::c_char,
        buf: *mut time_t,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_BN(
        key: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_uchar,
        bsize: usize,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_double(
        key: *const ::std::os::raw::c_char,
        buf: *mut f64,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_utf8_string(
        key: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_char,
        bsize: usize,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_utf8_ptr(
        key: *const ::std::os::raw::c_char,
        buf: *mut *mut ::std::os::raw::c_char,
        bsize: usize,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_octet_string(
        key: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_void,
        bsize: usize,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_octet_ptr(
        key: *const ::std::os::raw::c_char,
        buf: *mut *mut ::std::os::raw::c_void,
        bsize: usize,
    ) -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_construct_end() -> OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_allocate_from_text(
        to: *mut OSSL_PARAM,
        paramdefs: *const OSSL_PARAM,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        value_n: usize,
        found: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_print_to_bio(
        params: *const OSSL_PARAM,
        bio: *mut BIO,
        print_values: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_int(
        p: *const OSSL_PARAM,
        val: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_uint(
        p: *const OSSL_PARAM,
        val: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_long(
        p: *const OSSL_PARAM,
        val: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_ulong(
        p: *const OSSL_PARAM,
        val: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_int32(p: *const OSSL_PARAM, val: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_uint32(p: *const OSSL_PARAM, val: *mut u32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_int64(p: *const OSSL_PARAM, val: *mut i64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_uint64(p: *const OSSL_PARAM, val: *mut u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_size_t(p: *const OSSL_PARAM, val: *mut usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_time_t(p: *const OSSL_PARAM, val: *mut time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_int(
        p: *mut OSSL_PARAM,
        val: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_uint(
        p: *mut OSSL_PARAM,
        val: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_long(
        p: *mut OSSL_PARAM,
        val: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_ulong(
        p: *mut OSSL_PARAM,
        val: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_int32(p: *mut OSSL_PARAM, val: i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_uint32(p: *mut OSSL_PARAM, val: u32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_int64(p: *mut OSSL_PARAM, val: i64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_uint64(p: *mut OSSL_PARAM, val: u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_size_t(p: *mut OSSL_PARAM, val: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_time_t(p: *mut OSSL_PARAM, val: time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_double(p: *const OSSL_PARAM, val: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_double(p: *mut OSSL_PARAM, val: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_BN(p: *const OSSL_PARAM, val: *mut *mut BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_BN(p: *mut OSSL_PARAM, val: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_utf8_string(
        p: *const OSSL_PARAM,
        val: *mut *mut ::std::os::raw::c_char,
        max_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_utf8_string(
        p: *mut OSSL_PARAM,
        val: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_octet_string(
        p: *const OSSL_PARAM,
        val: *mut *mut ::std::os::raw::c_void,
        max_len: usize,
        used_len: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_octet_string(
        p: *mut OSSL_PARAM,
        val: *const ::std::os::raw::c_void,
        len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_utf8_ptr(
        p: *const OSSL_PARAM,
        val: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_utf8_ptr(
        p: *mut OSSL_PARAM,
        val: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_octet_ptr(
        p: *const OSSL_PARAM,
        val: *mut *const ::std::os::raw::c_void,
        used_len: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_octet_ptr(
        p: *mut OSSL_PARAM,
        val: *const ::std::os::raw::c_void,
        used_len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_utf8_string_ptr(
        p: *const OSSL_PARAM,
        val: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_get_octet_string_ptr(
        p: *const OSSL_PARAM,
        val: *mut *const ::std::os::raw::c_void,
        used_len: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_modified(p: *const OSSL_PARAM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_set_all_unmodified(p: *mut OSSL_PARAM);
}
unsafe extern "C" {
    pub fn OSSL_PARAM_dup(p: *const OSSL_PARAM) -> *mut OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_merge(p1: *const OSSL_PARAM, p2: *const OSSL_PARAM) -> *mut OSSL_PARAM;
}
unsafe extern "C" {
    pub fn OSSL_PARAM_free(p: *mut OSSL_PARAM);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_method_st {
    _unused: [u8; 0],
}
pub type EC_METHOD = ec_method_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_group_st {
    _unused: [u8; 0],
}
pub type EC_GROUP = ec_group_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_point_st {
    _unused: [u8; 0],
}
pub type EC_POINT = ec_point_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ecpk_parameters_st {
    _unused: [u8; 0],
}
pub type ECPKPARAMETERS = ecpk_parameters_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ec_parameters_st {
    _unused: [u8; 0],
}
pub type ECPARAMETERS = ec_parameters_st;
unsafe extern "C" {
    #[doc = " Returns the basic GFp ec methods which provides the basis for the\n  optimized methods.\n  \\return  EC_METHOD object"]
    pub fn EC_GFp_simple_method() -> *const EC_METHOD;
}
unsafe extern "C" {
    #[doc = " Returns GFp methods using montgomery multiplication.\n  \\return  EC_METHOD object"]
    pub fn EC_GFp_mont_method() -> *const EC_METHOD;
}
unsafe extern "C" {
    #[doc = " Returns GFp methods using optimized methods for NIST recommended curves\n  \\return  EC_METHOD object"]
    pub fn EC_GFp_nist_method() -> *const EC_METHOD;
}
unsafe extern "C" {
    #[doc = " Returns the basic GF2m ec method\n  \\return  EC_METHOD object"]
    pub fn EC_GF2m_simple_method() -> *const EC_METHOD;
}
unsafe extern "C" {
    #[doc = "  Creates a new EC_GROUP object\n  \\param   meth   EC_METHOD to use\n  \\return  newly created EC_GROUP object or NULL in case of an error."]
    pub fn EC_GROUP_new(meth: *const EC_METHOD) -> *mut EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Clears and frees a EC_GROUP object\n  \\param  group  EC_GROUP object to be cleared and freed."]
    pub fn EC_GROUP_clear_free(group: *mut EC_GROUP);
}
unsafe extern "C" {
    #[doc = " Returns the EC_METHOD of the EC_GROUP object.\n  \\param  group  EC_GROUP object\n  \\return EC_METHOD used in this EC_GROUP object."]
    pub fn EC_GROUP_method_of(group: *const EC_GROUP) -> *const EC_METHOD;
}
unsafe extern "C" {
    #[doc = " Returns the field type of the EC_METHOD.\n  \\param  meth  EC_METHOD object\n  \\return NID of the underlying field type OID."]
    pub fn EC_METHOD_get_field_type(meth: *const EC_METHOD) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Frees a EC_GROUP object\n  \\param  group  EC_GROUP object to be freed."]
    pub fn EC_GROUP_free(group: *mut EC_GROUP);
}
unsafe extern "C" {
    #[doc = " Copies EC_GROUP objects. Note: both EC_GROUPs must use the same EC_METHOD.\n  \\param  dst  destination EC_GROUP object\n  \\param  src  source EC_GROUP object\n  \\return 1 on success and 0 if an error occurred."]
    pub fn EC_GROUP_copy(dst: *mut EC_GROUP, src: *const EC_GROUP) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Creates a new EC_GROUP object and copies the content\n  form src to the newly created EC_KEY object\n  \\param  src  source EC_GROUP object\n  \\return newly created EC_GROUP object or NULL in case of an error."]
    pub fn EC_GROUP_dup(src: *const EC_GROUP) -> *mut EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Sets the generator and its order/cofactor of a EC_GROUP object.\n  \\param  group      EC_GROUP object\n  \\param  generator  EC_POINT object with the generator.\n  \\param  order      the order of the group generated by the generator.\n  \\param  cofactor   the index of the sub-group generated by the generator\n                     in the group of all points on the elliptic curve.\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_set_generator(
        group: *mut EC_GROUP,
        generator: *const EC_POINT,
        order: *const BIGNUM,
        cofactor: *const BIGNUM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Returns the generator of a EC_GROUP object.\n  \\param  group  EC_GROUP object\n  \\return the currently used generator (possibly NULL)."]
    pub fn EC_GROUP_get0_generator(group: *const EC_GROUP) -> *const EC_POINT;
}
unsafe extern "C" {
    #[doc = " Returns the montgomery data for order(Generator)\n  \\param  group  EC_GROUP object\n  \\return the currently used montgomery data (possibly NULL)."]
    pub fn EC_GROUP_get_mont_data(group: *const EC_GROUP) -> *mut BN_MONT_CTX;
}
unsafe extern "C" {
    #[doc = " Gets the order of a EC_GROUP\n  \\param  group  EC_GROUP object\n  \\param  order  BIGNUM to which the order is copied\n  \\param  ctx    unused\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_get_order(
        group: *const EC_GROUP,
        order: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the order of an EC_GROUP\n  \\param  group  EC_GROUP object\n  \\return the group order"]
    pub fn EC_GROUP_get0_order(group: *const EC_GROUP) -> *const BIGNUM;
}
unsafe extern "C" {
    #[doc = " Gets the number of bits of the order of an EC_GROUP\n  \\param  group  EC_GROUP object\n  \\return number of bits of group order."]
    pub fn EC_GROUP_order_bits(group: *const EC_GROUP) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the cofactor of a EC_GROUP\n  \\param  group     EC_GROUP object\n  \\param  cofactor  BIGNUM to which the cofactor is copied\n  \\param  ctx       unused\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_get_cofactor(
        group: *const EC_GROUP,
        cofactor: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the cofactor of an EC_GROUP\n  \\param  group  EC_GROUP object\n  \\return the group cofactor"]
    pub fn EC_GROUP_get0_cofactor(group: *const EC_GROUP) -> *const BIGNUM;
}
unsafe extern "C" {
    #[doc = " Sets the name of a EC_GROUP object\n  \\param  group  EC_GROUP object\n  \\param  nid    NID of the curve name OID"]
    pub fn EC_GROUP_set_curve_name(group: *mut EC_GROUP, nid: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " Returns the curve name of a EC_GROUP object\n  \\param  group  EC_GROUP object\n  \\return NID of the curve name OID or 0 if not set."]
    pub fn EC_GROUP_get_curve_name(group: *const EC_GROUP) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the field of an EC_GROUP\n  \\param  group  EC_GROUP object\n  \\return the group field"]
    pub fn EC_GROUP_get0_field(group: *const EC_GROUP) -> *const BIGNUM;
}
unsafe extern "C" {
    #[doc = " Returns the field type of the EC_GROUP.\n  \\param  group  EC_GROUP object\n  \\return NID of the underlying field type OID."]
    pub fn EC_GROUP_get_field_type(group: *const EC_GROUP) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_set_asn1_flag(group: *mut EC_GROUP, flag: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn EC_GROUP_get_asn1_flag(group: *const EC_GROUP) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_set_point_conversion_form(group: *mut EC_GROUP, form: point_conversion_form_t);
}
unsafe extern "C" {
    pub fn EC_GROUP_get_point_conversion_form(arg1: *const EC_GROUP) -> point_conversion_form_t;
}
unsafe extern "C" {
    pub fn EC_GROUP_get0_seed(x: *const EC_GROUP) -> *mut ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn EC_GROUP_get_seed_len(arg1: *const EC_GROUP) -> usize;
}
unsafe extern "C" {
    pub fn EC_GROUP_set_seed(
        arg1: *mut EC_GROUP,
        arg2: *const ::std::os::raw::c_uchar,
        len: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Sets the parameters of an ec curve defined by y^2 = x^3 + a*x + b (for GFp)\n  or y^2 + x*y = x^3 + a*x^2 + b (for GF2m)\n  \\param  group  EC_GROUP object\n  \\param  p      BIGNUM with the prime number (GFp) or the polynomial\n                 defining the underlying field (GF2m)\n  \\param  a      BIGNUM with parameter a of the equation\n  \\param  b      BIGNUM with parameter b of the equation\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_set_curve(
        group: *mut EC_GROUP,
        p: *const BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the parameters of the ec curve defined by y^2 = x^3 + a*x + b (for GFp)\n  or y^2 + x*y = x^3 + a*x^2 + b (for GF2m)\n  \\param  group  EC_GROUP object\n  \\param  p      BIGNUM with the prime number (GFp) or the polynomial\n                 defining the underlying field (GF2m)\n  \\param  a      BIGNUM for parameter a of the equation\n  \\param  b      BIGNUM for parameter b of the equation\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_get_curve(
        group: *const EC_GROUP,
        p: *mut BIGNUM,
        a: *mut BIGNUM,
        b: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sets the parameters of an ec curve. Synonym for EC_GROUP_set_curve\n  \\param  group  EC_GROUP object\n  \\param  p      BIGNUM with the prime number (GFp) or the polynomial\n                 defining the underlying field (GF2m)\n  \\param  a      BIGNUM with parameter a of the equation\n  \\param  b      BIGNUM with parameter b of the equation\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_set_curve_GFp(
        group: *mut EC_GROUP,
        p: *const BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the parameters of an ec curve. Synonym for EC_GROUP_get_curve\n  \\param  group  EC_GROUP object\n  \\param  p      BIGNUM with the prime number (GFp) or the polynomial\n                 defining the underlying field (GF2m)\n  \\param  a      BIGNUM for parameter a of the equation\n  \\param  b      BIGNUM for parameter b of the equation\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_get_curve_GFp(
        group: *const EC_GROUP,
        p: *mut BIGNUM,
        a: *mut BIGNUM,
        b: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sets the parameter of an ec curve. Synonym for EC_GROUP_set_curve\n  \\param  group  EC_GROUP object\n  \\param  p      BIGNUM with the prime number (GFp) or the polynomial\n                 defining the underlying field (GF2m)\n  \\param  a      BIGNUM with parameter a of the equation\n  \\param  b      BIGNUM with parameter b of the equation\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_set_curve_GF2m(
        group: *mut EC_GROUP,
        p: *const BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the parameters of an ec curve. Synonym for EC_GROUP_get_curve\n  \\param  group  EC_GROUP object\n  \\param  p      BIGNUM with the prime number (GFp) or the polynomial\n                 defining the underlying field (GF2m)\n  \\param  a      BIGNUM for parameter a of the equation\n  \\param  b      BIGNUM for parameter b of the equation\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_get_curve_GF2m(
        group: *const EC_GROUP,
        p: *mut BIGNUM,
        a: *mut BIGNUM,
        b: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Returns the number of bits needed to represent a field element\n  \\param  group  EC_GROUP object\n  \\return number of bits needed to represent a field element"]
    pub fn EC_GROUP_get_degree(group: *const EC_GROUP) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Checks whether the parameter in the EC_GROUP define a valid ec group\n  \\param  group  EC_GROUP object\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 if group is a valid ec group and 0 otherwise"]
    pub fn EC_GROUP_check(group: *const EC_GROUP, ctx: *mut BN_CTX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Checks whether the discriminant of the elliptic curve is zero or not\n  \\param  group  EC_GROUP object\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 if the discriminant is not zero and 0 otherwise"]
    pub fn EC_GROUP_check_discriminant(
        group: *const EC_GROUP,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Compares two EC_GROUP objects\n  \\param  a    first EC_GROUP object\n  \\param  b    second EC_GROUP object\n  \\param  ctx  BN_CTX object (optional)\n  \\return 0 if the groups are equal, 1 if not, or -1 on error"]
    pub fn EC_GROUP_cmp(
        a: *const EC_GROUP,
        b: *const EC_GROUP,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Creates a new EC_GROUP object with the specified parameters defined\n  over GFp (defined by the equation y^2 = x^3 + a*x + b)\n  \\param  p    BIGNUM with the prime number\n  \\param  a    BIGNUM with the parameter a of the equation\n  \\param  b    BIGNUM with the parameter b of the equation\n  \\param  ctx  BN_CTX object (optional)\n  \\return newly created EC_GROUP object with the specified parameters"]
    pub fn EC_GROUP_new_curve_GFp(
        p: *const BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Creates a new EC_GROUP object with the specified parameters defined\n  over GF2m (defined by the equation y^2 + x*y = x^3 + a*x^2 + b)\n  \\param  p    BIGNUM with the polynomial defining the underlying field\n  \\param  a    BIGNUM with the parameter a of the equation\n  \\param  b    BIGNUM with the parameter b of the equation\n  \\param  ctx  BN_CTX object (optional)\n  \\return newly created EC_GROUP object with the specified parameters"]
    pub fn EC_GROUP_new_curve_GF2m(
        p: *const BIGNUM,
        a: *const BIGNUM,
        b: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> *mut EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Creates a EC_GROUP object with a curve specified by parameters.\n The parameters may be explicit or a named curve,\n  \\param  params A list of parameters describing the group.\n  \\param  libctx The associated library context or NULL for the default\n                 context\n  \\param  propq  A property query string\n  \\return newly created EC_GROUP object with specified parameters or NULL\n          if an error occurred"]
    pub fn EC_GROUP_new_from_params(
        params: *const OSSL_PARAM,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> *mut EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Creates an OSSL_PARAM array with the parameters describing the given\n EC_GROUP.\n The resulting parameters may contain an explicit or a named curve depending\n on the EC_GROUP.\n  \\param  group  pointer to the EC_GROUP object\n  \\param  libctx The associated library context or NULL for the default\n                 context\n  \\param  propq  A property query string\n  \\param  bnctx  BN_CTX object (optional)\n  \\return newly created OSSL_PARAM array with the parameters\n          describing the given EC_GROUP or NULL if an error occurred"]
    pub fn EC_GROUP_to_params(
        group: *const EC_GROUP,
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
        bnctx: *mut BN_CTX,
    ) -> *mut OSSL_PARAM;
}
unsafe extern "C" {
    #[doc = " Creates a EC_GROUP object with a curve specified by a NID\n  \\param  libctx The associated library context or NULL for the default\n                 context\n  \\param  propq  A property query string\n  \\param  nid    NID of the OID of the curve name\n  \\return newly created EC_GROUP object with specified curve or NULL\n          if an error occurred"]
    pub fn EC_GROUP_new_by_curve_name_ex(
        libctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
        nid: ::std::os::raw::c_int,
    ) -> *mut EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Creates a EC_GROUP object with a curve specified by a NID. Same as\n EC_GROUP_new_by_curve_name_ex but the libctx and propq are always\n NULL.\n  \\param  nid    NID of the OID of the curve name\n  \\return newly created EC_GROUP object with specified curve or NULL\n          if an error occurred"]
    pub fn EC_GROUP_new_by_curve_name(nid: ::std::os::raw::c_int) -> *mut EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Creates a new EC_GROUP object from an ECPARAMETERS object\n  \\param  params  pointer to the ECPARAMETERS object\n  \\return newly created EC_GROUP object with specified curve or NULL\n          if an error occurred"]
    pub fn EC_GROUP_new_from_ecparameters(params: *const ECPARAMETERS) -> *mut EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Creates an ECPARAMETERS object for the given EC_GROUP object.\n  \\param  group   pointer to the EC_GROUP object\n  \\param  params  pointer to an existing ECPARAMETERS object or NULL\n  \\return pointer to the new ECPARAMETERS object or NULL\n          if an error occurred."]
    pub fn EC_GROUP_get_ecparameters(
        group: *const EC_GROUP,
        params: *mut ECPARAMETERS,
    ) -> *mut ECPARAMETERS;
}
unsafe extern "C" {
    #[doc = " Creates a new EC_GROUP object from an ECPKPARAMETERS object\n  \\param  params  pointer to an existing ECPKPARAMETERS object, or NULL\n  \\return newly created EC_GROUP object with specified curve, or NULL\n          if an error occurred"]
    pub fn EC_GROUP_new_from_ecpkparameters(params: *const ECPKPARAMETERS) -> *mut EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Creates an ECPKPARAMETERS object for the given EC_GROUP object.\n  \\param  group   pointer to the EC_GROUP object\n  \\param  params  pointer to an existing ECPKPARAMETERS object or NULL\n  \\return pointer to the new ECPKPARAMETERS object or NULL\n          if an error occurred."]
    pub fn EC_GROUP_get_ecpkparameters(
        group: *const EC_GROUP,
        params: *mut ECPKPARAMETERS,
    ) -> *mut ECPKPARAMETERS;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct EC_builtin_curve {
    pub nid: ::std::os::raw::c_int,
    pub comment: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EC_builtin_curve"][::std::mem::size_of::<EC_builtin_curve>() - 16usize];
    ["Alignment of EC_builtin_curve"][::std::mem::align_of::<EC_builtin_curve>() - 8usize];
    ["Offset of field: EC_builtin_curve::nid"]
        [::std::mem::offset_of!(EC_builtin_curve, nid) - 0usize];
    ["Offset of field: EC_builtin_curve::comment"]
        [::std::mem::offset_of!(EC_builtin_curve, comment) - 8usize];
};
impl Default for EC_builtin_curve {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn EC_get_builtin_curves(r: *mut EC_builtin_curve, nitems: usize) -> usize;
}
unsafe extern "C" {
    pub fn EC_curve_nid2nist(nid: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn EC_curve_nist2nid(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_check_named_curve(
        group: *const EC_GROUP,
        nist_only: ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Creates a new EC_POINT object for the specified EC_GROUP\n  \\param  group  EC_GROUP the underlying EC_GROUP object\n  \\return newly created EC_POINT object or NULL if an error occurred"]
    pub fn EC_POINT_new(group: *const EC_GROUP) -> *mut EC_POINT;
}
unsafe extern "C" {
    #[doc = " Frees a EC_POINT object\n  \\param  point  EC_POINT object to be freed"]
    pub fn EC_POINT_free(point: *mut EC_POINT);
}
unsafe extern "C" {
    #[doc = " Clears and frees a EC_POINT object\n  \\param  point  EC_POINT object to be cleared and freed"]
    pub fn EC_POINT_clear_free(point: *mut EC_POINT);
}
unsafe extern "C" {
    #[doc = " Copies EC_POINT object\n  \\param  dst  destination EC_POINT object\n  \\param  src  source EC_POINT object\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_copy(dst: *mut EC_POINT, src: *const EC_POINT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Creates a new EC_POINT object and copies the content of the supplied\n  EC_POINT\n  \\param  src    source EC_POINT object\n  \\param  group  underlying the EC_GROUP object\n  \\return newly created EC_POINT object or NULL if an error occurred"]
    pub fn EC_POINT_dup(src: *const EC_POINT, group: *const EC_GROUP) -> *mut EC_POINT;
}
unsafe extern "C" {
    #[doc = " Sets a point to infinity (neutral element)\n  \\param  group  underlying EC_GROUP object\n  \\param  point  EC_POINT to set to infinity\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_set_to_infinity(
        group: *const EC_GROUP,
        point: *mut EC_POINT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Returns the EC_METHOD used in EC_POINT object\n  \\param  point  EC_POINT object\n  \\return the EC_METHOD used"]
    pub fn EC_POINT_method_of(point: *const EC_POINT) -> *const EC_METHOD;
}
unsafe extern "C" {
    #[doc = " Sets the jacobian projective coordinates of a EC_POINT over GFp\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM with the x-coordinate\n  \\param  y      BIGNUM with the y-coordinate\n  \\param  z      BIGNUM with the z-coordinate\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_set_Jprojective_coordinates_GFp(
        group: *const EC_GROUP,
        p: *mut EC_POINT,
        x: *const BIGNUM,
        y: *const BIGNUM,
        z: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the jacobian projective coordinates of a EC_POINT over GFp\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM for the x-coordinate\n  \\param  y      BIGNUM for the y-coordinate\n  \\param  z      BIGNUM for the z-coordinate\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_get_Jprojective_coordinates_GFp(
        group: *const EC_GROUP,
        p: *const EC_POINT,
        x: *mut BIGNUM,
        y: *mut BIGNUM,
        z: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sets the affine coordinates of an EC_POINT\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM with the x-coordinate\n  \\param  y      BIGNUM with the y-coordinate\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_set_affine_coordinates(
        group: *const EC_GROUP,
        p: *mut EC_POINT,
        x: *const BIGNUM,
        y: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the affine coordinates of an EC_POINT.\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM for the x-coordinate\n  \\param  y      BIGNUM for the y-coordinate\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_get_affine_coordinates(
        group: *const EC_GROUP,
        p: *const EC_POINT,
        x: *mut BIGNUM,
        y: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sets the affine coordinates of an EC_POINT. A synonym of\n  EC_POINT_set_affine_coordinates\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM with the x-coordinate\n  \\param  y      BIGNUM with the y-coordinate\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_set_affine_coordinates_GFp(
        group: *const EC_GROUP,
        p: *mut EC_POINT,
        x: *const BIGNUM,
        y: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the affine coordinates of an EC_POINT. A synonym of\n  EC_POINT_get_affine_coordinates\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM for the x-coordinate\n  \\param  y      BIGNUM for the y-coordinate\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_get_affine_coordinates_GFp(
        group: *const EC_GROUP,
        p: *const EC_POINT,
        x: *mut BIGNUM,
        y: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sets the x9.62 compressed coordinates of a EC_POINT\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM with x-coordinate\n  \\param  y_bit  integer with the y-Bit (either 0 or 1)\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_set_compressed_coordinates(
        group: *const EC_GROUP,
        p: *mut EC_POINT,
        x: *const BIGNUM,
        y_bit: ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sets the x9.62 compressed coordinates of a EC_POINT. A synonym of\n  EC_POINT_set_compressed_coordinates\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM with x-coordinate\n  \\param  y_bit  integer with the y-Bit (either 0 or 1)\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_set_compressed_coordinates_GFp(
        group: *const EC_GROUP,
        p: *mut EC_POINT,
        x: *const BIGNUM,
        y_bit: ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sets the affine coordinates of an EC_POINT. A synonym of\n  EC_POINT_set_affine_coordinates\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM with the x-coordinate\n  \\param  y      BIGNUM with the y-coordinate\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_set_affine_coordinates_GF2m(
        group: *const EC_GROUP,
        p: *mut EC_POINT,
        x: *const BIGNUM,
        y: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Gets the affine coordinates of an EC_POINT. A synonym of\n  EC_POINT_get_affine_coordinates\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM for the x-coordinate\n  \\param  y      BIGNUM for the y-coordinate\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_get_affine_coordinates_GF2m(
        group: *const EC_GROUP,
        p: *const EC_POINT,
        x: *mut BIGNUM,
        y: *mut BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sets the x9.62 compressed coordinates of a EC_POINT. A synonym of\n  EC_POINT_set_compressed_coordinates\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  x      BIGNUM with x-coordinate\n  \\param  y_bit  integer with the y-Bit (either 0 or 1)\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_set_compressed_coordinates_GF2m(
        group: *const EC_GROUP,
        p: *mut EC_POINT,
        x: *const BIGNUM,
        y_bit: ::std::os::raw::c_int,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Encodes a EC_POINT object to a octet string\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  form   point conversion form\n  \\param  buf    memory buffer for the result. If NULL the function returns\n                 required buffer size.\n  \\param  len    length of the memory buffer\n  \\param  ctx    BN_CTX object (optional)\n  \\return the length of the encoded octet string or 0 if an error occurred"]
    pub fn EC_POINT_point2oct(
        group: *const EC_GROUP,
        p: *const EC_POINT,
        form: point_conversion_form_t,
        buf: *mut ::std::os::raw::c_uchar,
        len: usize,
        ctx: *mut BN_CTX,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Decodes a EC_POINT from a octet string\n  \\param  group  underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\param  buf    memory buffer with the encoded ec point\n  \\param  len    length of the encoded ec point\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_oct2point(
        group: *const EC_GROUP,
        p: *mut EC_POINT,
        buf: *const ::std::os::raw::c_uchar,
        len: usize,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Encodes an EC_POINT object to an allocated octet string\n  \\param  group  underlying EC_GROUP object\n  \\param  point  EC_POINT object\n  \\param  form   point conversion form\n  \\param  pbuf   returns pointer to allocated buffer\n  \\param  ctx    BN_CTX object (optional)\n  \\return the length of the encoded octet string or 0 if an error occurred"]
    pub fn EC_POINT_point2buf(
        group: *const EC_GROUP,
        point: *const EC_POINT,
        form: point_conversion_form_t,
        pbuf: *mut *mut ::std::os::raw::c_uchar,
        ctx: *mut BN_CTX,
    ) -> usize;
}
unsafe extern "C" {
    pub fn EC_POINT_point2bn(
        arg1: *const EC_GROUP,
        arg2: *const EC_POINT,
        form: point_conversion_form_t,
        arg3: *mut BIGNUM,
        arg4: *mut BN_CTX,
    ) -> *mut BIGNUM;
}
unsafe extern "C" {
    pub fn EC_POINT_bn2point(
        arg1: *const EC_GROUP,
        arg2: *const BIGNUM,
        arg3: *mut EC_POINT,
        arg4: *mut BN_CTX,
    ) -> *mut EC_POINT;
}
unsafe extern "C" {
    pub fn EC_POINT_point2hex(
        arg1: *const EC_GROUP,
        arg2: *const EC_POINT,
        form: point_conversion_form_t,
        arg3: *mut BN_CTX,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn EC_POINT_hex2point(
        arg1: *const EC_GROUP,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut EC_POINT,
        arg4: *mut BN_CTX,
    ) -> *mut EC_POINT;
}
unsafe extern "C" {
    #[doc = " Computes the sum of two EC_POINT\n  \\param  group  underlying EC_GROUP object\n  \\param  r      EC_POINT object for the result (r = a + b)\n  \\param  a      EC_POINT object with the first summand\n  \\param  b      EC_POINT object with the second summand\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_add(
        group: *const EC_GROUP,
        r: *mut EC_POINT,
        a: *const EC_POINT,
        b: *const EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Computes the double of a EC_POINT\n  \\param  group  underlying EC_GROUP object\n  \\param  r      EC_POINT object for the result (r = 2 * a)\n  \\param  a      EC_POINT object\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_dbl(
        group: *const EC_GROUP,
        r: *mut EC_POINT,
        a: *const EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Computes the inverse of a EC_POINT\n  \\param  group  underlying EC_GROUP object\n  \\param  a      EC_POINT object to be inverted (it's used for the result as well)\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_invert(
        group: *const EC_GROUP,
        a: *mut EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Checks whether the point is the neutral element of the group\n  \\param  group  the underlying EC_GROUP object\n  \\param  p      EC_POINT object\n  \\return 1 if the point is the neutral element and 0 otherwise"]
    pub fn EC_POINT_is_at_infinity(
        group: *const EC_GROUP,
        p: *const EC_POINT,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Checks whether the point is on the curve\n  \\param  group  underlying EC_GROUP object\n  \\param  point  EC_POINT object to check\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 if the point is on the curve, 0 if not, or -1 on error"]
    pub fn EC_POINT_is_on_curve(
        group: *const EC_GROUP,
        point: *const EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Compares two EC_POINTs\n  \\param  group  underlying EC_GROUP object\n  \\param  a      first EC_POINT object\n  \\param  b      second EC_POINT object\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 if the points are not equal, 0 if they are, or -1 on error"]
    pub fn EC_POINT_cmp(
        group: *const EC_GROUP,
        a: *const EC_POINT,
        b: *const EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_POINT_make_affine(
        group: *const EC_GROUP,
        point: *mut EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_POINTs_make_affine(
        group: *const EC_GROUP,
        num: usize,
        points: *mut *mut EC_POINT,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Computes r = generator * n + sum_{i=0}^{num-1} p[i] * m[i]\n  \\param  group  underlying EC_GROUP object\n  \\param  r      EC_POINT object for the result\n  \\param  n      BIGNUM with the multiplier for the group generator (optional)\n  \\param  num    number further summands\n  \\param  p      array of size num of EC_POINT objects\n  \\param  m      array of size num of BIGNUM objects\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINTs_mul(
        group: *const EC_GROUP,
        r: *mut EC_POINT,
        n: *const BIGNUM,
        num: usize,
        p: *mut *const EC_POINT,
        m: *mut *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Computes r = generator * n + q * m\n  \\param  group  underlying EC_GROUP object\n  \\param  r      EC_POINT object for the result\n  \\param  n      BIGNUM with the multiplier for the group generator (optional)\n  \\param  q      EC_POINT object with the first factor of the second summand\n  \\param  m      BIGNUM with the second factor of the second summand\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_POINT_mul(
        group: *const EC_GROUP,
        r: *mut EC_POINT,
        n: *const BIGNUM,
        q: *const EC_POINT,
        m: *const BIGNUM,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Stores multiples of generator for faster point multiplication\n  \\param  group  EC_GROUP object\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_GROUP_precompute_mult(
        group: *mut EC_GROUP,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Reports whether a precomputation has been done\n  \\param  group  EC_GROUP object\n  \\return 1 if a pre-computation has been done and 0 otherwise"]
    pub fn EC_GROUP_have_precompute_mult(group: *const EC_GROUP) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ECPKPARAMETERS_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ECPKPARAMETERS_new() -> *mut ECPKPARAMETERS;
}
unsafe extern "C" {
    pub fn ECPKPARAMETERS_free(a: *mut ECPKPARAMETERS);
}
unsafe extern "C" {
    pub fn ECPARAMETERS_it() -> *const ASN1_ITEM;
}
unsafe extern "C" {
    pub fn ECPARAMETERS_new() -> *mut ECPARAMETERS;
}
unsafe extern "C" {
    pub fn ECPARAMETERS_free(a: *mut ECPARAMETERS);
}
unsafe extern "C" {
    pub fn EC_GROUP_get_basis_type(arg1: *const EC_GROUP) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_get_trinomial_basis(
        arg1: *const EC_GROUP,
        k: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_GROUP_get_pentanomial_basis(
        arg1: *const EC_GROUP,
        k1: *mut ::std::os::raw::c_uint,
        k2: *mut ::std::os::raw::c_uint,
        k3: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn d2i_ECPKParameters(
        arg1: *mut *mut EC_GROUP,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut EC_GROUP;
}
unsafe extern "C" {
    pub fn i2d_ECPKParameters(
        arg1: *const EC_GROUP,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ECPKParameters_print(
        bp: *mut BIO,
        x: *const EC_GROUP,
        off: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "  Creates a new EC_KEY object.\n  \\param  ctx  The library context for to use for this EC_KEY. May be NULL in\n               which case the default library context is used.\n  \\return EC_KEY object or NULL if an error occurred."]
    pub fn EC_KEY_new_ex(
        ctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
    ) -> *mut EC_KEY;
}
unsafe extern "C" {
    #[doc = "  Creates a new EC_KEY object. Same as calling EC_KEY_new_ex with a\n  NULL library context\n  \\return EC_KEY object or NULL if an error occurred."]
    pub fn EC_KEY_new() -> *mut EC_KEY;
}
unsafe extern "C" {
    pub fn EC_KEY_get_flags(key: *const EC_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_set_flags(key: *mut EC_KEY, flags: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn EC_KEY_clear_flags(key: *mut EC_KEY, flags: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn EC_KEY_decoded_from_explicit_params(key: *const EC_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = "  Creates a new EC_KEY object using a named curve as underlying\n  EC_GROUP object.\n  \\param  ctx   The library context for to use for this EC_KEY. May be NULL in\n                which case the default library context is used.\n  \\param  propq Any property query string\n  \\param  nid   NID of the named curve.\n  \\return EC_KEY object or NULL if an error occurred."]
    pub fn EC_KEY_new_by_curve_name_ex(
        ctx: *mut OSSL_LIB_CTX,
        propq: *const ::std::os::raw::c_char,
        nid: ::std::os::raw::c_int,
    ) -> *mut EC_KEY;
}
unsafe extern "C" {
    #[doc = "  Creates a new EC_KEY object using a named curve as underlying\n  EC_GROUP object. Same as calling EC_KEY_new_by_curve_name_ex with a NULL\n  library context and property query string.\n  \\param  nid  NID of the named curve.\n  \\return EC_KEY object or NULL if an error occurred."]
    pub fn EC_KEY_new_by_curve_name(nid: ::std::os::raw::c_int) -> *mut EC_KEY;
}
unsafe extern "C" {
    #[doc = " Frees a EC_KEY object.\n  \\param  key  EC_KEY object to be freed."]
    pub fn EC_KEY_free(key: *mut EC_KEY);
}
unsafe extern "C" {
    #[doc = " Copies a EC_KEY object.\n  \\param  dst  destination EC_KEY object\n  \\param  src  src EC_KEY object\n  \\return dst or NULL if an error occurred."]
    pub fn EC_KEY_copy(dst: *mut EC_KEY, src: *const EC_KEY) -> *mut EC_KEY;
}
unsafe extern "C" {
    #[doc = " Creates a new EC_KEY object and copies the content from src to it.\n  \\param  src  the source EC_KEY object\n  \\return newly created EC_KEY object or NULL if an error occurred."]
    pub fn EC_KEY_dup(src: *const EC_KEY) -> *mut EC_KEY;
}
unsafe extern "C" {
    #[doc = " Increases the internal reference count of a EC_KEY object.\n  \\param  key  EC_KEY object\n  \\return 1 on success and 0 if an error occurred."]
    pub fn EC_KEY_up_ref(key: *mut EC_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Returns the ENGINE object of a EC_KEY object\n  \\param  eckey  EC_KEY object\n  \\return the ENGINE object (possibly NULL)."]
    pub fn EC_KEY_get0_engine(eckey: *const EC_KEY) -> *mut ENGINE;
}
unsafe extern "C" {
    #[doc = " Returns the EC_GROUP object of a EC_KEY object\n  \\param  key  EC_KEY object\n  \\return the EC_GROUP object (possibly NULL)."]
    pub fn EC_KEY_get0_group(key: *const EC_KEY) -> *const EC_GROUP;
}
unsafe extern "C" {
    #[doc = " Sets the EC_GROUP of a EC_KEY object.\n  \\param  key    EC_KEY object\n  \\param  group  EC_GROUP to use in the EC_KEY object (note: the EC_KEY\n                 object will use an own copy of the EC_GROUP).\n  \\return 1 on success and 0 if an error occurred."]
    pub fn EC_KEY_set_group(key: *mut EC_KEY, group: *const EC_GROUP) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Returns the private key of a EC_KEY object.\n  \\param  key  EC_KEY object\n  \\return a BIGNUM with the private key (possibly NULL)."]
    pub fn EC_KEY_get0_private_key(key: *const EC_KEY) -> *const BIGNUM;
}
unsafe extern "C" {
    #[doc = " Sets the private key of a EC_KEY object.\n  \\param  key  EC_KEY object\n  \\param  prv  BIGNUM with the private key (note: the EC_KEY object\n               will use an own copy of the BIGNUM).\n  \\return 1 on success and 0 if an error occurred."]
    pub fn EC_KEY_set_private_key(key: *mut EC_KEY, prv: *const BIGNUM) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Returns the public key of a EC_KEY object.\n  \\param  key  the EC_KEY object\n  \\return a EC_POINT object with the public key (possibly NULL)"]
    pub fn EC_KEY_get0_public_key(key: *const EC_KEY) -> *const EC_POINT;
}
unsafe extern "C" {
    #[doc = " Sets the public key of a EC_KEY object.\n  \\param  key  EC_KEY object\n  \\param  pub  EC_POINT object with the public key (note: the EC_KEY object\n               will use an own copy of the EC_POINT object).\n  \\return 1 on success and 0 if an error occurred."]
    pub fn EC_KEY_set_public_key(key: *mut EC_KEY, pub_: *const EC_POINT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_get_enc_flags(key: *const EC_KEY) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn EC_KEY_set_enc_flags(eckey: *mut EC_KEY, flags: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn EC_KEY_get_conv_form(key: *const EC_KEY) -> point_conversion_form_t;
}
unsafe extern "C" {
    pub fn EC_KEY_set_conv_form(eckey: *mut EC_KEY, cform: point_conversion_form_t);
}
unsafe extern "C" {
    pub fn EC_KEY_set_ex_data(
        key: *mut EC_KEY,
        idx: ::std::os::raw::c_int,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_get_ex_data(
        key: *const EC_KEY,
        idx: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn EC_KEY_set_asn1_flag(eckey: *mut EC_KEY, asn1_flag: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " Creates a table of pre-computed multiples of the generator to\n  accelerate further EC_KEY operations.\n  \\param  key  EC_KEY object\n  \\param  ctx  BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred."]
    pub fn EC_KEY_precompute_mult(key: *mut EC_KEY, ctx: *mut BN_CTX) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Creates a new ec private (and optional a new public) key.\n  \\param  key  EC_KEY object\n  \\return 1 on success and 0 if an error occurred."]
    pub fn EC_KEY_generate_key(key: *mut EC_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Verifies that a private and/or public key is valid.\n  \\param  key  the EC_KEY object\n  \\return 1 on success and 0 otherwise."]
    pub fn EC_KEY_check_key(key: *const EC_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Indicates if an EC_KEY can be used for signing.\n  \\param  eckey  the EC_KEY object\n  \\return 1 if can sign and 0 otherwise."]
    pub fn EC_KEY_can_sign(eckey: *const EC_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Sets a public key from affine coordinates performing\n  necessary NIST PKV tests.\n  \\param  key  the EC_KEY object\n  \\param  x    public key x coordinate\n  \\param  y    public key y coordinate\n  \\return 1 on success and 0 otherwise."]
    pub fn EC_KEY_set_public_key_affine_coordinates(
        key: *mut EC_KEY,
        x: *mut BIGNUM,
        y: *mut BIGNUM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Encodes an EC_KEY public key to an allocated octet string\n  \\param  key    key to encode\n  \\param  form   point conversion form\n  \\param  pbuf   returns pointer to allocated buffer\n  \\param  ctx    BN_CTX object (optional)\n  \\return the length of the encoded octet string or 0 if an error occurred"]
    pub fn EC_KEY_key2buf(
        key: *const EC_KEY,
        form: point_conversion_form_t,
        pbuf: *mut *mut ::std::os::raw::c_uchar,
        ctx: *mut BN_CTX,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Decodes a EC_KEY public key from a octet string\n  \\param  key    key to decode\n  \\param  buf    memory buffer with the encoded ec point\n  \\param  len    length of the encoded ec point\n  \\param  ctx    BN_CTX object (optional)\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_KEY_oct2key(
        key: *mut EC_KEY,
        buf: *const ::std::os::raw::c_uchar,
        len: usize,
        ctx: *mut BN_CTX,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Decodes an EC_KEY private key from an octet string\n  \\param  key    key to decode\n  \\param  buf    memory buffer with the encoded private key\n  \\param  len    length of the encoded key\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_KEY_oct2priv(
        key: *mut EC_KEY,
        buf: *const ::std::os::raw::c_uchar,
        len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Encodes a EC_KEY private key to an octet string\n  \\param  key    key to encode\n  \\param  buf    memory buffer for the result. If NULL the function returns\n                 required buffer size.\n  \\param  len    length of the memory buffer\n  \\return the length of the encoded octet string or 0 if an error occurred"]
    pub fn EC_KEY_priv2oct(
        key: *const EC_KEY,
        buf: *mut ::std::os::raw::c_uchar,
        len: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Encodes an EC_KEY private key to an allocated octet string\n  \\param  eckey  key to encode\n  \\param  pbuf   returns pointer to allocated buffer\n  \\return the length of the encoded octet string or 0 if an error occurred"]
    pub fn EC_KEY_priv2buf(eckey: *const EC_KEY, pbuf: *mut *mut ::std::os::raw::c_uchar) -> usize;
}
unsafe extern "C" {
    #[doc = " Decodes a private key from a memory buffer.\n  \\param  key  a pointer to a EC_KEY object which should be used (or NULL)\n  \\param  in   pointer to memory with the DER encoded private key\n  \\param  len  length of the DER encoded private key\n  \\return the decoded private key or NULL if an error occurred."]
    pub fn d2i_ECPrivateKey(
        key: *mut *mut EC_KEY,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut EC_KEY;
}
unsafe extern "C" {
    #[doc = " Encodes a private key object and stores the result in a buffer.\n  \\param  key  the EC_KEY object to encode\n  \\param  out  the buffer for the result (if NULL the function returns number\n               of bytes needed).\n  \\return 1 on success and 0 if an error occurred."]
    pub fn i2d_ECPrivateKey(
        key: *const EC_KEY,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Decodes ec parameter from a memory buffer.\n  \\param  key  a pointer to a EC_KEY object which should be used (or NULL)\n  \\param  in   pointer to memory with the DER encoded ec parameters\n  \\param  len  length of the DER encoded ec parameters\n  \\return a EC_KEY object with the decoded parameters or NULL if an error\n          occurred."]
    pub fn d2i_ECParameters(
        key: *mut *mut EC_KEY,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut EC_KEY;
}
unsafe extern "C" {
    #[doc = " Encodes ec parameter and stores the result in a buffer.\n  \\param  key  the EC_KEY object with ec parameters to encode\n  \\param  out  the buffer for the result (if NULL the function returns number\n               of bytes needed).\n  \\return 1 on success and 0 if an error occurred."]
    pub fn i2d_ECParameters(
        key: *const EC_KEY,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Decodes an ec public key from a octet string.\n  \\param  key  a pointer to a EC_KEY object which should be used\n  \\param  in   memory buffer with the encoded public key\n  \\param  len  length of the encoded public key\n  \\return EC_KEY object with decoded public key or NULL if an error\n          occurred."]
    pub fn o2i_ECPublicKey(
        key: *mut *mut EC_KEY,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut EC_KEY;
}
unsafe extern "C" {
    #[doc = " Encodes an ec public key in an octet string.\n  \\param  key  the EC_KEY object with the public key\n  \\param  out  the buffer for the result (if NULL the function returns number\n               of bytes needed).\n  \\return 1 on success and 0 if an error occurred"]
    pub fn i2o_ECPublicKey(
        key: *const EC_KEY,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Prints out the ec parameters on human readable form.\n  \\param  bp   BIO object to which the information is printed\n  \\param  key  EC_KEY object\n  \\return 1 on success and 0 if an error occurred"]
    pub fn ECParameters_print(bp: *mut BIO, key: *const EC_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Prints out the contents of a EC_KEY object\n  \\param  bp   BIO object to which the information is printed\n  \\param  key  EC_KEY object\n  \\param  off  line offset\n  \\return 1 on success and 0 if an error occurred"]
    pub fn EC_KEY_print(
        bp: *mut BIO,
        key: *const EC_KEY,
        off: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_OpenSSL() -> *const EC_KEY_METHOD;
}
unsafe extern "C" {
    pub fn EC_KEY_get_default_method() -> *const EC_KEY_METHOD;
}
unsafe extern "C" {
    pub fn EC_KEY_set_default_method(meth: *const EC_KEY_METHOD);
}
unsafe extern "C" {
    pub fn EC_KEY_get_method(key: *const EC_KEY) -> *const EC_KEY_METHOD;
}
unsafe extern "C" {
    pub fn EC_KEY_set_method(key: *mut EC_KEY, meth: *const EC_KEY_METHOD)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_new_method(engine: *mut ENGINE) -> *mut EC_KEY;
}
unsafe extern "C" {
    #[doc = " The old name for ecdh_KDF_X9_63\n  The ECDH KDF specification has been mistakenly attributed to ANSI X9.62,\n  it is actually specified in ANSI X9.63.\n  This identifier is retained for backwards compatibility"]
    pub fn ECDH_KDF_X9_62(
        out: *mut ::std::os::raw::c_uchar,
        outlen: usize,
        Z: *const ::std::os::raw::c_uchar,
        Zlen: usize,
        sinfo: *const ::std::os::raw::c_uchar,
        sinfolen: usize,
        md: *const EVP_MD,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ECDH_compute_key(
        out: *mut ::std::os::raw::c_void,
        outlen: usize,
        pub_key: *const EC_POINT,
        ecdh: *const EC_KEY,
        KDF: ::std::option::Option<
            unsafe extern "C" fn(
                in_: *const ::std::os::raw::c_void,
                inlen: usize,
                out: *mut ::std::os::raw::c_void,
                outlen: *mut usize,
            ) -> *mut ::std::os::raw::c_void,
        >,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ECDSA_SIG_st {
    _unused: [u8; 0],
}
pub type ECDSA_SIG = ECDSA_SIG_st;
unsafe extern "C" {
    #[doc = " Allocates and initialize a ECDSA_SIG structure\n  \\return pointer to a ECDSA_SIG structure or NULL if an error occurred"]
    pub fn ECDSA_SIG_new() -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    #[doc = " frees a ECDSA_SIG structure\n  \\param  sig  pointer to the ECDSA_SIG structure"]
    pub fn ECDSA_SIG_free(sig: *mut ECDSA_SIG);
}
unsafe extern "C" {
    #[doc = " i2d_ECDSA_SIG encodes content of ECDSA_SIG (note: this function modifies *pp\n  (*pp += length of the DER encoded signature)).\n  \\param  sig  pointer to the ECDSA_SIG object\n  \\param  pp   pointer to a unsigned char pointer for the output or NULL\n  \\return the length of the DER encoded ECDSA_SIG object or a negative value\n          on error"]
    pub fn d2i_ECDSA_SIG(
        a: *mut *mut ECDSA_SIG,
        in_: *mut *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_long,
    ) -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    #[doc = " i2d_ECDSA_SIG encodes content of ECDSA_SIG (note: this function modifies *pp\n  (*pp += length of the DER encoded signature)).\n  \\param  sig  pointer to the ECDSA_SIG object\n  \\param  pp   pointer to a unsigned char pointer for the output or NULL\n  \\return the length of the DER encoded ECDSA_SIG object or a negative value\n          on error"]
    pub fn i2d_ECDSA_SIG(
        a: *const ECDSA_SIG,
        out: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Accessor for r and s fields of ECDSA_SIG\n  \\param  sig  pointer to ECDSA_SIG structure\n  \\param  pr   pointer to BIGNUM pointer for r (may be NULL)\n  \\param  ps   pointer to BIGNUM pointer for s (may be NULL)"]
    pub fn ECDSA_SIG_get0(sig: *const ECDSA_SIG, pr: *mut *const BIGNUM, ps: *mut *const BIGNUM);
}
unsafe extern "C" {
    #[doc = " Accessor for r field of ECDSA_SIG\n  \\param  sig  pointer to ECDSA_SIG structure"]
    pub fn ECDSA_SIG_get0_r(sig: *const ECDSA_SIG) -> *const BIGNUM;
}
unsafe extern "C" {
    #[doc = " Accessor for s field of ECDSA_SIG\n  \\param  sig  pointer to ECDSA_SIG structure"]
    pub fn ECDSA_SIG_get0_s(sig: *const ECDSA_SIG) -> *const BIGNUM;
}
unsafe extern "C" {
    #[doc = " Setter for r and s fields of ECDSA_SIG\n  \\param  sig  pointer to ECDSA_SIG structure\n  \\param  r    pointer to BIGNUM for r\n  \\param  s    pointer to BIGNUM for s"]
    pub fn ECDSA_SIG_set0(
        sig: *mut ECDSA_SIG,
        r: *mut BIGNUM,
        s: *mut BIGNUM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Computes the ECDSA signature of the given hash value using\n  the supplied private key and returns the created signature.\n  \\param  dgst      pointer to the hash value\n  \\param  dgst_len  length of the hash value\n  \\param  eckey     EC_KEY object containing a private EC key\n  \\return pointer to a ECDSA_SIG structure or NULL if an error occurred"]
    pub fn ECDSA_do_sign(
        dgst: *const ::std::os::raw::c_uchar,
        dgst_len: ::std::os::raw::c_int,
        eckey: *mut EC_KEY,
    ) -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    #[doc = " Computes ECDSA signature of a given hash value using the supplied\n  private key (note: sig must point to ECDSA_size(eckey) bytes of memory).\n  \\param  dgst     pointer to the hash value to sign\n  \\param  dgstlen  length of the hash value\n  \\param  kinv     BIGNUM with a pre-computed inverse k (optional)\n  \\param  rp       BIGNUM with a pre-computed rp value (optional),\n                   see ECDSA_sign_setup\n  \\param  eckey    EC_KEY object containing a private EC key\n  \\return pointer to a ECDSA_SIG structure or NULL if an error occurred"]
    pub fn ECDSA_do_sign_ex(
        dgst: *const ::std::os::raw::c_uchar,
        dgstlen: ::std::os::raw::c_int,
        kinv: *const BIGNUM,
        rp: *const BIGNUM,
        eckey: *mut EC_KEY,
    ) -> *mut ECDSA_SIG;
}
unsafe extern "C" {
    #[doc = " Verifies that the supplied signature is a valid ECDSA\n  signature of the supplied hash value using the supplied public key.\n  \\param  dgst      pointer to the hash value\n  \\param  dgst_len  length of the hash value\n  \\param  sig       ECDSA_SIG structure\n  \\param  eckey     EC_KEY object containing a public EC key\n  \\return 1 if the signature is valid, 0 if the signature is invalid\n          and -1 on error"]
    pub fn ECDSA_do_verify(
        dgst: *const ::std::os::raw::c_uchar,
        dgst_len: ::std::os::raw::c_int,
        sig: *const ECDSA_SIG,
        eckey: *mut EC_KEY,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Precompute parts of the signing operation\n  \\param  eckey  EC_KEY object containing a private EC key\n  \\param  ctx    BN_CTX object (optional)\n  \\param  kinv   BIGNUM pointer for the inverse of k\n  \\param  rp     BIGNUM pointer for x coordinate of k * generator\n  \\return 1 on success and 0 otherwise"]
    pub fn ECDSA_sign_setup(
        eckey: *mut EC_KEY,
        ctx: *mut BN_CTX,
        kinv: *mut *mut BIGNUM,
        rp: *mut *mut BIGNUM,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Computes ECDSA signature of a given hash value using the supplied\n  private key (note: sig must point to ECDSA_size(eckey) bytes of memory).\n  \\param  type     this parameter is ignored\n  \\param  dgst     pointer to the hash value to sign\n  \\param  dgstlen  length of the hash value\n  \\param  sig      memory for the DER encoded created signature\n  \\param  siglen   pointer to the length of the returned signature\n  \\param  eckey    EC_KEY object containing a private EC key\n  \\return 1 on success and 0 otherwise"]
    pub fn ECDSA_sign(
        type_: ::std::os::raw::c_int,
        dgst: *const ::std::os::raw::c_uchar,
        dgstlen: ::std::os::raw::c_int,
        sig: *mut ::std::os::raw::c_uchar,
        siglen: *mut ::std::os::raw::c_uint,
        eckey: *mut EC_KEY,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Computes ECDSA signature of a given hash value using the supplied\n  private key (note: sig must point to ECDSA_size(eckey) bytes of memory).\n  \\param  type     this parameter is ignored\n  \\param  dgst     pointer to the hash value to sign\n  \\param  dgstlen  length of the hash value\n  \\param  sig      buffer to hold the DER encoded signature\n  \\param  siglen   pointer to the length of the returned signature\n  \\param  kinv     BIGNUM with a pre-computed inverse k (optional)\n  \\param  rp       BIGNUM with a pre-computed rp value (optional),\n                   see ECDSA_sign_setup\n  \\param  eckey    EC_KEY object containing a private EC key\n  \\return 1 on success and 0 otherwise"]
    pub fn ECDSA_sign_ex(
        type_: ::std::os::raw::c_int,
        dgst: *const ::std::os::raw::c_uchar,
        dgstlen: ::std::os::raw::c_int,
        sig: *mut ::std::os::raw::c_uchar,
        siglen: *mut ::std::os::raw::c_uint,
        kinv: *const BIGNUM,
        rp: *const BIGNUM,
        eckey: *mut EC_KEY,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Verifies that the given signature is valid ECDSA signature\n  of the supplied hash value using the specified public key.\n  \\param  type     this parameter is ignored\n  \\param  dgst     pointer to the hash value\n  \\param  dgstlen  length of the hash value\n  \\param  sig      pointer to the DER encoded signature\n  \\param  siglen   length of the DER encoded signature\n  \\param  eckey    EC_KEY object containing a public EC key\n  \\return 1 if the signature is valid, 0 if the signature is invalid\n          and -1 on error"]
    pub fn ECDSA_verify(
        type_: ::std::os::raw::c_int,
        dgst: *const ::std::os::raw::c_uchar,
        dgstlen: ::std::os::raw::c_int,
        sig: *const ::std::os::raw::c_uchar,
        siglen: ::std::os::raw::c_int,
        eckey: *mut EC_KEY,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Returns the maximum length of the DER encoded signature\n  \\param  eckey  EC_KEY object\n  \\return numbers of bytes required for the DER encoded signature"]
    pub fn ECDSA_size(eckey: *const EC_KEY) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_new(meth: *const EC_KEY_METHOD) -> *mut EC_KEY_METHOD;
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_free(meth: *mut EC_KEY_METHOD);
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_set_init(
        meth: *mut EC_KEY_METHOD,
        init: ::std::option::Option<
            unsafe extern "C" fn(key: *mut EC_KEY) -> ::std::os::raw::c_int,
        >,
        finish: ::std::option::Option<unsafe extern "C" fn(key: *mut EC_KEY)>,
        copy: ::std::option::Option<
            unsafe extern "C" fn(dest: *mut EC_KEY, src: *const EC_KEY) -> ::std::os::raw::c_int,
        >,
        set_group: ::std::option::Option<
            unsafe extern "C" fn(key: *mut EC_KEY, grp: *const EC_GROUP) -> ::std::os::raw::c_int,
        >,
        set_private: ::std::option::Option<
            unsafe extern "C" fn(
                key: *mut EC_KEY,
                priv_key: *const BIGNUM,
            ) -> ::std::os::raw::c_int,
        >,
        set_public: ::std::option::Option<
            unsafe extern "C" fn(
                key: *mut EC_KEY,
                pub_key: *const EC_POINT,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_set_keygen(
        meth: *mut EC_KEY_METHOD,
        keygen: ::std::option::Option<
            unsafe extern "C" fn(key: *mut EC_KEY) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_set_compute_key(
        meth: *mut EC_KEY_METHOD,
        ckey: ::std::option::Option<
            unsafe extern "C" fn(
                psec: *mut *mut ::std::os::raw::c_uchar,
                pseclen: *mut usize,
                pub_key: *const EC_POINT,
                ecdh: *const EC_KEY,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_set_sign(
        meth: *mut EC_KEY_METHOD,
        sign: ::std::option::Option<
            unsafe extern "C" fn(
                type_: ::std::os::raw::c_int,
                dgst: *const ::std::os::raw::c_uchar,
                dlen: ::std::os::raw::c_int,
                sig: *mut ::std::os::raw::c_uchar,
                siglen: *mut ::std::os::raw::c_uint,
                kinv: *const BIGNUM,
                r: *const BIGNUM,
                eckey: *mut EC_KEY,
            ) -> ::std::os::raw::c_int,
        >,
        sign_setup: ::std::option::Option<
            unsafe extern "C" fn(
                eckey: *mut EC_KEY,
                ctx_in: *mut BN_CTX,
                kinvp: *mut *mut BIGNUM,
                rp: *mut *mut BIGNUM,
            ) -> ::std::os::raw::c_int,
        >,
        sign_sig: ::std::option::Option<
            unsafe extern "C" fn(
                dgst: *const ::std::os::raw::c_uchar,
                dgst_len: ::std::os::raw::c_int,
                in_kinv: *const BIGNUM,
                in_r: *const BIGNUM,
                eckey: *mut EC_KEY,
            ) -> *mut ECDSA_SIG,
        >,
    );
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_set_verify(
        meth: *mut EC_KEY_METHOD,
        verify: ::std::option::Option<
            unsafe extern "C" fn(
                type_: ::std::os::raw::c_int,
                dgst: *const ::std::os::raw::c_uchar,
                dgst_len: ::std::os::raw::c_int,
                sigbuf: *const ::std::os::raw::c_uchar,
                sig_len: ::std::os::raw::c_int,
                eckey: *mut EC_KEY,
            ) -> ::std::os::raw::c_int,
        >,
        verify_sig: ::std::option::Option<
            unsafe extern "C" fn(
                dgst: *const ::std::os::raw::c_uchar,
                dgst_len: ::std::os::raw::c_int,
                sig: *const ECDSA_SIG,
                eckey: *mut EC_KEY,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_get_init(
        meth: *const EC_KEY_METHOD,
        pinit: *mut ::std::option::Option<
            unsafe extern "C" fn(key: *mut EC_KEY) -> ::std::os::raw::c_int,
        >,
        pfinish: *mut ::std::option::Option<unsafe extern "C" fn(key: *mut EC_KEY)>,
        pcopy: *mut ::std::option::Option<
            unsafe extern "C" fn(dest: *mut EC_KEY, src: *const EC_KEY) -> ::std::os::raw::c_int,
        >,
        pset_group: *mut ::std::option::Option<
            unsafe extern "C" fn(key: *mut EC_KEY, grp: *const EC_GROUP) -> ::std::os::raw::c_int,
        >,
        pset_private: *mut ::std::option::Option<
            unsafe extern "C" fn(
                key: *mut EC_KEY,
                priv_key: *const BIGNUM,
            ) -> ::std::os::raw::c_int,
        >,
        pset_public: *mut ::std::option::Option<
            unsafe extern "C" fn(
                key: *mut EC_KEY,
                pub_key: *const EC_POINT,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_get_keygen(
        meth: *const EC_KEY_METHOD,
        pkeygen: *mut ::std::option::Option<
            unsafe extern "C" fn(key: *mut EC_KEY) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_get_compute_key(
        meth: *const EC_KEY_METHOD,
        pck: *mut ::std::option::Option<
            unsafe extern "C" fn(
                psec: *mut *mut ::std::os::raw::c_uchar,
                pseclen: *mut usize,
                pub_key: *const EC_POINT,
                ecdh: *const EC_KEY,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_get_sign(
        meth: *const EC_KEY_METHOD,
        psign: *mut ::std::option::Option<
            unsafe extern "C" fn(
                type_: ::std::os::raw::c_int,
                dgst: *const ::std::os::raw::c_uchar,
                dlen: ::std::os::raw::c_int,
                sig: *mut ::std::os::raw::c_uchar,
                siglen: *mut ::std::os::raw::c_uint,
                kinv: *const BIGNUM,
                r: *const BIGNUM,
                eckey: *mut EC_KEY,
            ) -> ::std::os::raw::c_int,
        >,
        psign_setup: *mut ::std::option::Option<
            unsafe extern "C" fn(
                eckey: *mut EC_KEY,
                ctx_in: *mut BN_CTX,
                kinvp: *mut *mut BIGNUM,
                rp: *mut *mut BIGNUM,
            ) -> ::std::os::raw::c_int,
        >,
        psign_sig: *mut ::std::option::Option<
            unsafe extern "C" fn(
                dgst: *const ::std::os::raw::c_uchar,
                dgst_len: ::std::os::raw::c_int,
                in_kinv: *const BIGNUM,
                in_r: *const BIGNUM,
                eckey: *mut EC_KEY,
            ) -> *mut ECDSA_SIG,
        >,
    );
}
unsafe extern "C" {
    pub fn EC_KEY_METHOD_get_verify(
        meth: *const EC_KEY_METHOD,
        pverify: *mut ::std::option::Option<
            unsafe extern "C" fn(
                type_: ::std::os::raw::c_int,
                dgst: *const ::std::os::raw::c_uchar,
                dgst_len: ::std::os::raw::c_int,
                sigbuf: *const ::std::os::raw::c_uchar,
                sig_len: ::std::os::raw::c_int,
                eckey: *mut EC_KEY,
            ) -> ::std::os::raw::c_int,
        >,
        pverify_sig: *mut ::std::option::Option<
            unsafe extern "C" fn(
                dgst: *const ::std::os::raw::c_uchar,
                dgst_len: ::std::os::raw::c_int,
                sig: *const ECDSA_SIG,
                eckey: *mut EC_KEY,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
pub type OSSL_INDICATOR_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        type_: *const ::std::os::raw::c_char,
        desc: *const ::std::os::raw::c_char,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn OSSL_INDICATOR_set_callback(libctx: *mut OSSL_LIB_CTX, cb: OSSL_INDICATOR_CALLBACK);
}
unsafe extern "C" {
    pub fn OSSL_INDICATOR_get_callback(libctx: *mut OSSL_LIB_CTX, cb: *mut OSSL_INDICATOR_CALLBACK);
}
pub type OSSL_FUNC = ::std::option::Option<unsafe extern "C" fn()>;
pub type OSSL_FUNC_core_gettable_params_fn =
    ::std::option::Option<unsafe extern "C" fn(prov: *const OSSL_CORE_HANDLE) -> *const OSSL_PARAM>;
pub type OSSL_FUNC_core_get_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        prov: *const OSSL_CORE_HANDLE,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_core_thread_start_fn = ::std::option::Option<
    unsafe extern "C" fn(
        prov: *const OSSL_CORE_HANDLE,
        handfn: OSSL_thread_stop_handler_fn,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_core_get_libctx_fn = ::std::option::Option<
    unsafe extern "C" fn(prov: *const OSSL_CORE_HANDLE) -> *mut OPENSSL_CORE_CTX,
>;
pub type OSSL_FUNC_core_new_error_fn =
    ::std::option::Option<unsafe extern "C" fn(prov: *const OSSL_CORE_HANDLE)>;
pub type OSSL_FUNC_core_set_error_debug_fn = ::std::option::Option<
    unsafe extern "C" fn(
        prov: *const OSSL_CORE_HANDLE,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        func: *const ::std::os::raw::c_char,
    ),
>;
pub type OSSL_FUNC_core_vset_error_fn = ::std::option::Option<
    unsafe extern "C" fn(
        prov: *const OSSL_CORE_HANDLE,
        reason: u32,
        fmt: *const ::std::os::raw::c_char,
        args: va_list,
    ),
>;
pub type OSSL_FUNC_core_set_error_mark_fn = ::std::option::Option<
    unsafe extern "C" fn(prov: *const OSSL_CORE_HANDLE) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_core_clear_last_error_mark_fn = ::std::option::Option<
    unsafe extern "C" fn(prov: *const OSSL_CORE_HANDLE) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_core_pop_error_to_mark_fn = ::std::option::Option<
    unsafe extern "C" fn(prov: *const OSSL_CORE_HANDLE) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_core_obj_add_sigid_fn = ::std::option::Option<
    unsafe extern "C" fn(
        prov: *const OSSL_CORE_HANDLE,
        sign_name: *const ::std::os::raw::c_char,
        digest_name: *const ::std::os::raw::c_char,
        pkey_name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_core_obj_create_fn = ::std::option::Option<
    unsafe extern "C" fn(
        prov: *const OSSL_CORE_HANDLE,
        oid: *const ::std::os::raw::c_char,
        sn: *const ::std::os::raw::c_char,
        ln: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_CRYPTO_malloc_fn = ::std::option::Option<
    unsafe extern "C" fn(
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_CRYPTO_zalloc_fn = ::std::option::Option<
    unsafe extern "C" fn(
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_CRYPTO_free_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *mut ::std::os::raw::c_void,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ),
>;
pub type OSSL_FUNC_CRYPTO_clear_free_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *mut ::std::os::raw::c_void,
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ),
>;
pub type OSSL_FUNC_CRYPTO_realloc_fn = ::std::option::Option<
    unsafe extern "C" fn(
        addr: *mut ::std::os::raw::c_void,
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_CRYPTO_clear_realloc_fn = ::std::option::Option<
    unsafe extern "C" fn(
        addr: *mut ::std::os::raw::c_void,
        old_num: usize,
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_CRYPTO_secure_malloc_fn = ::std::option::Option<
    unsafe extern "C" fn(
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_CRYPTO_secure_zalloc_fn = ::std::option::Option<
    unsafe extern "C" fn(
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_CRYPTO_secure_free_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *mut ::std::os::raw::c_void,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ),
>;
pub type OSSL_FUNC_CRYPTO_secure_clear_free_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *mut ::std::os::raw::c_void,
        num: usize,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ),
>;
pub type OSSL_FUNC_CRYPTO_secure_allocated_fn = ::std::option::Option<
    unsafe extern "C" fn(ptr: *const ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_OPENSSL_cleanse_fn =
    ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void, len: usize)>;
pub type OSSL_FUNC_BIO_new_file_fn = ::std::option::Option<
    unsafe extern "C" fn(
        filename: *const ::std::os::raw::c_char,
        mode: *const ::std::os::raw::c_char,
    ) -> *mut OSSL_CORE_BIO,
>;
pub type OSSL_FUNC_BIO_new_membuf_fn = ::std::option::Option<
    unsafe extern "C" fn(
        buf: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> *mut OSSL_CORE_BIO,
>;
pub type OSSL_FUNC_BIO_read_ex_fn = ::std::option::Option<
    unsafe extern "C" fn(
        bio: *mut OSSL_CORE_BIO,
        data: *mut ::std::os::raw::c_void,
        data_len: usize,
        bytes_read: *mut usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_BIO_write_ex_fn = ::std::option::Option<
    unsafe extern "C" fn(
        bio: *mut OSSL_CORE_BIO,
        data: *const ::std::os::raw::c_void,
        data_len: usize,
        written: *mut usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_BIO_gets_fn = ::std::option::Option<
    unsafe extern "C" fn(
        bio: *mut OSSL_CORE_BIO,
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_BIO_puts_fn = ::std::option::Option<
    unsafe extern "C" fn(
        bio: *mut OSSL_CORE_BIO,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_BIO_up_ref_fn =
    ::std::option::Option<unsafe extern "C" fn(bio: *mut OSSL_CORE_BIO) -> ::std::os::raw::c_int>;
pub type OSSL_FUNC_BIO_free_fn =
    ::std::option::Option<unsafe extern "C" fn(bio: *mut OSSL_CORE_BIO) -> ::std::os::raw::c_int>;
pub type OSSL_FUNC_BIO_vprintf_fn = ::std::option::Option<
    unsafe extern "C" fn(
        bio: *mut OSSL_CORE_BIO,
        format: *const ::std::os::raw::c_char,
        args: va_list,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_BIO_vsnprintf_fn = ::std::option::Option<
    unsafe extern "C" fn(
        buf: *mut ::std::os::raw::c_char,
        n: usize,
        fmt: *const ::std::os::raw::c_char,
        args: va_list,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_BIO_ctrl_fn = ::std::option::Option<
    unsafe extern "C" fn(
        bio: *mut OSSL_CORE_BIO,
        cmd: ::std::os::raw::c_int,
        num: ::std::os::raw::c_long,
        ptr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_indicator_cb_fn = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut OPENSSL_CORE_CTX, cb: *mut OSSL_INDICATOR_CALLBACK),
>;
pub type OSSL_FUNC_self_test_cb_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut OPENSSL_CORE_CTX,
        cb: *mut OSSL_CALLBACK,
        cbarg: *mut *mut ::std::os::raw::c_void,
    ),
>;
pub type OSSL_FUNC_get_entropy_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        pout: *mut *mut ::std::os::raw::c_uchar,
        entropy: ::std::os::raw::c_int,
        min_len: usize,
        max_len: usize,
    ) -> usize,
>;
pub type OSSL_FUNC_get_user_entropy_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        pout: *mut *mut ::std::os::raw::c_uchar,
        entropy: ::std::os::raw::c_int,
        min_len: usize,
        max_len: usize,
    ) -> usize,
>;
pub type OSSL_FUNC_cleanup_entropy_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        buf: *mut ::std::os::raw::c_uchar,
        len: usize,
    ),
>;
pub type OSSL_FUNC_cleanup_user_entropy_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        buf: *mut ::std::os::raw::c_uchar,
        len: usize,
    ),
>;
pub type OSSL_FUNC_get_nonce_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        pout: *mut *mut ::std::os::raw::c_uchar,
        min_len: usize,
        max_len: usize,
        salt: *const ::std::os::raw::c_void,
        salt_len: usize,
    ) -> usize,
>;
pub type OSSL_FUNC_get_user_nonce_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        pout: *mut *mut ::std::os::raw::c_uchar,
        min_len: usize,
        max_len: usize,
        salt: *const ::std::os::raw::c_void,
        salt_len: usize,
    ) -> usize,
>;
pub type OSSL_FUNC_cleanup_nonce_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        buf: *mut ::std::os::raw::c_uchar,
        len: usize,
    ),
>;
pub type OSSL_FUNC_cleanup_user_nonce_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        buf: *mut ::std::os::raw::c_uchar,
        len: usize,
    ),
>;
pub type OSSL_FUNC_provider_register_child_cb_fn = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *const OSSL_CORE_HANDLE,
        create_cb: ::std::option::Option<
            unsafe extern "C" fn(
                provider: *const OSSL_CORE_HANDLE,
                cbdata: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        remove_cb: ::std::option::Option<
            unsafe extern "C" fn(
                provider: *const OSSL_CORE_HANDLE,
                cbdata: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        global_props_cb: ::std::option::Option<
            unsafe extern "C" fn(
                props: *const ::std::os::raw::c_char,
                cbdata: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        cbdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_provider_deregister_child_cb_fn =
    ::std::option::Option<unsafe extern "C" fn(handle: *const OSSL_CORE_HANDLE)>;
pub type OSSL_FUNC_provider_name_fn = ::std::option::Option<
    unsafe extern "C" fn(prov: *const OSSL_CORE_HANDLE) -> *const ::std::os::raw::c_char,
>;
pub type OSSL_FUNC_provider_get0_provider_ctx_fn = ::std::option::Option<
    unsafe extern "C" fn(prov: *const OSSL_CORE_HANDLE) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_provider_get0_dispatch_fn = ::std::option::Option<
    unsafe extern "C" fn(prov: *const OSSL_CORE_HANDLE) -> *const OSSL_DISPATCH,
>;
pub type OSSL_FUNC_provider_up_ref_fn = ::std::option::Option<
    unsafe extern "C" fn(
        prov: *const OSSL_CORE_HANDLE,
        activate: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_provider_free_fn = ::std::option::Option<
    unsafe extern "C" fn(
        prov: *const OSSL_CORE_HANDLE,
        deactivate: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_provider_teardown_fn =
    ::std::option::Option<unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_provider_gettable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_provider_get_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_provider_query_operation_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        operation_id: ::std::os::raw::c_int,
        no_store: *mut ::std::os::raw::c_int,
    ) -> *const OSSL_ALGORITHM,
>;
pub type OSSL_FUNC_provider_unquery_operation_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        operation_id: ::std::os::raw::c_int,
        arg1: *const OSSL_ALGORITHM,
    ),
>;
pub type OSSL_FUNC_provider_get_reason_strings_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *const OSSL_ITEM,
>;
pub type OSSL_FUNC_provider_get_capabilities_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        capability: *const ::std::os::raw::c_char,
        cb: OSSL_CALLBACK,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_provider_self_test_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_provider_random_bytes_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_void,
        n: usize,
        strength: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_SSL_QUIC_TLS_crypto_send_fn = ::std::option::Option<
    unsafe extern "C" fn(
        s: *mut SSL,
        buf: *const ::std::os::raw::c_uchar,
        buf_len: usize,
        consumed: *mut usize,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_SSL_QUIC_TLS_crypto_recv_rcd_fn = ::std::option::Option<
    unsafe extern "C" fn(
        s: *mut SSL,
        buf: *mut *const ::std::os::raw::c_uchar,
        bytes_read: *mut usize,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_SSL_QUIC_TLS_crypto_release_rcd_fn = ::std::option::Option<
    unsafe extern "C" fn(
        s: *mut SSL,
        bytes_read: usize,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_SSL_QUIC_TLS_yield_secret_fn = ::std::option::Option<
    unsafe extern "C" fn(
        s: *mut SSL,
        prot_level: u32,
        direction: ::std::os::raw::c_int,
        secret: *const ::std::os::raw::c_uchar,
        secret_len: usize,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_SSL_QUIC_TLS_got_transport_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        s: *mut SSL,
        params: *const ::std::os::raw::c_uchar,
        params_len: usize,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_SSL_QUIC_TLS_alert_fn = ::std::option::Option<
    unsafe extern "C" fn(
        s: *mut SSL,
        alert_code: ::std::os::raw::c_uchar,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_digest_newctx_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_digest_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        dctx: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_digest_update_fn = ::std::option::Option<
    unsafe extern "C" fn(
        dctx: *mut ::std::os::raw::c_void,
        in_: *const ::std::os::raw::c_uchar,
        inl: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_digest_final_fn = ::std::option::Option<
    unsafe extern "C" fn(
        dctx: *mut ::std::os::raw::c_void,
        out: *mut ::std::os::raw::c_uchar,
        outl: *mut usize,
        outsz: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_digest_squeeze_fn = ::std::option::Option<
    unsafe extern "C" fn(
        dctx: *mut ::std::os::raw::c_void,
        out: *mut ::std::os::raw::c_uchar,
        outl: *mut usize,
        outsz: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_digest_digest_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        in_: *const ::std::os::raw::c_uchar,
        inl: usize,
        out: *mut ::std::os::raw::c_uchar,
        outl: *mut usize,
        outsz: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_digest_freectx_fn =
    ::std::option::Option<unsafe extern "C" fn(dctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_digest_dupctx_fn = ::std::option::Option<
    unsafe extern "C" fn(dctx: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_digest_copyctx_fn = ::std::option::Option<
    unsafe extern "C" fn(outctx: *mut ::std::os::raw::c_void, inctx: *mut ::std::os::raw::c_void),
>;
pub type OSSL_FUNC_digest_get_params_fn =
    ::std::option::Option<unsafe extern "C" fn(params: *mut OSSL_PARAM) -> ::std::os::raw::c_int>;
pub type OSSL_FUNC_digest_set_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_digest_get_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_digest_gettable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_digest_settable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        dctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_digest_gettable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        dctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_cipher_newctx_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_cipher_encrypt_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_uchar,
        keylen: usize,
        iv: *const ::std::os::raw::c_uchar,
        ivlen: usize,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_decrypt_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_uchar,
        keylen: usize,
        iv: *const ::std::os::raw::c_uchar,
        ivlen: usize,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_update_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        out: *mut ::std::os::raw::c_uchar,
        outl: *mut usize,
        outsize: usize,
        in_: *const ::std::os::raw::c_uchar,
        inl: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_final_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        out: *mut ::std::os::raw::c_uchar,
        outl: *mut usize,
        outsize: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_cipher_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        out: *mut ::std::os::raw::c_uchar,
        outl: *mut usize,
        outsize: usize,
        in_: *const ::std::os::raw::c_uchar,
        inl: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_pipeline_encrypt_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_uchar,
        keylen: usize,
        numpipes: usize,
        iv: *mut *const ::std::os::raw::c_uchar,
        ivlen: usize,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_pipeline_decrypt_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_uchar,
        keylen: usize,
        numpipes: usize,
        iv: *mut *const ::std::os::raw::c_uchar,
        ivlen: usize,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_pipeline_update_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        numpipes: usize,
        out: *mut *mut ::std::os::raw::c_uchar,
        outl: *mut usize,
        outsize: *const usize,
        in_: *mut *const ::std::os::raw::c_uchar,
        inl: *const usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_pipeline_final_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        numpipes: usize,
        out: *mut *mut ::std::os::raw::c_uchar,
        outl: *mut usize,
        outsize: *const usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_freectx_fn =
    ::std::option::Option<unsafe extern "C" fn(cctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_cipher_dupctx_fn = ::std::option::Option<
    unsafe extern "C" fn(cctx: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_cipher_get_params_fn =
    ::std::option::Option<unsafe extern "C" fn(params: *mut OSSL_PARAM) -> ::std::os::raw::c_int>;
pub type OSSL_FUNC_cipher_get_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_set_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_gettable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_cipher_settable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_cipher_gettable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_cipher_encrypt_skey_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        skeydata: *mut ::std::os::raw::c_void,
        iv: *const ::std::os::raw::c_uchar,
        ivlen: usize,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_cipher_decrypt_skey_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        cctx: *mut ::std::os::raw::c_void,
        skeydata: *mut ::std::os::raw::c_void,
        iv: *const ::std::os::raw::c_uchar,
        ivlen: usize,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_mac_newctx_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_mac_dupctx_fn = ::std::option::Option<
    unsafe extern "C" fn(src: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_mac_freectx_fn =
    ::std::option::Option<unsafe extern "C" fn(mctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_mac_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        mctx: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_uchar,
        keylen: usize,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_mac_update_fn = ::std::option::Option<
    unsafe extern "C" fn(
        mctx: *mut ::std::os::raw::c_void,
        in_: *const ::std::os::raw::c_uchar,
        inl: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_mac_final_fn = ::std::option::Option<
    unsafe extern "C" fn(
        mctx: *mut ::std::os::raw::c_void,
        out: *mut ::std::os::raw::c_uchar,
        outl: *mut usize,
        outsize: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_mac_gettable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_mac_gettable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        mctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_mac_settable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        mctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_mac_get_params_fn =
    ::std::option::Option<unsafe extern "C" fn(params: *mut OSSL_PARAM) -> ::std::os::raw::c_int>;
pub type OSSL_FUNC_mac_get_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        mctx: *mut ::std::os::raw::c_void,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_mac_set_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        mctx: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_mac_init_skey_fn = ::std::option::Option<
    unsafe extern "C" fn(
        mctx: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_kdf_newctx_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_kdf_dupctx_fn = ::std::option::Option<
    unsafe extern "C" fn(src: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_kdf_freectx_fn =
    ::std::option::Option<unsafe extern "C" fn(kctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_kdf_reset_fn =
    ::std::option::Option<unsafe extern "C" fn(kctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_kdf_derive_fn = ::std::option::Option<
    unsafe extern "C" fn(
        kctx: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_uchar,
        keylen: usize,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_kdf_gettable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_kdf_gettable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        kctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_kdf_settable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        kctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_kdf_get_params_fn =
    ::std::option::Option<unsafe extern "C" fn(params: *mut OSSL_PARAM) -> ::std::os::raw::c_int>;
pub type OSSL_FUNC_kdf_get_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        kctx: *mut ::std::os::raw::c_void,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_kdf_set_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        kctx: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_newctx_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        parent: *mut ::std::os::raw::c_void,
        parent_calls: *const OSSL_DISPATCH,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_rand_freectx_fn =
    ::std::option::Option<unsafe extern "C" fn(vctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_rand_instantiate_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vdrbg: *mut ::std::os::raw::c_void,
        strength: ::std::os::raw::c_uint,
        prediction_resistance: ::std::os::raw::c_int,
        pstr: *const ::std::os::raw::c_uchar,
        pstr_len: usize,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_uninstantiate_fn = ::std::option::Option<
    unsafe extern "C" fn(vdrbg: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_generate_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        out: *mut ::std::os::raw::c_uchar,
        outlen: usize,
        strength: ::std::os::raw::c_uint,
        prediction_resistance: ::std::os::raw::c_int,
        addin: *const ::std::os::raw::c_uchar,
        addin_len: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_reseed_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        prediction_resistance: ::std::os::raw::c_int,
        ent: *const ::std::os::raw::c_uchar,
        ent_len: usize,
        addin: *const ::std::os::raw::c_uchar,
        addin_len: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_nonce_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        out: *mut ::std::os::raw::c_uchar,
        strength: ::std::os::raw::c_uint,
        min_noncelen: usize,
        max_noncelen: usize,
    ) -> usize,
>;
pub type OSSL_FUNC_rand_enable_locking_fn = ::std::option::Option<
    unsafe extern "C" fn(vctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_lock_fn = ::std::option::Option<
    unsafe extern "C" fn(vctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_unlock_fn =
    ::std::option::Option<unsafe extern "C" fn(vctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_rand_gettable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_rand_gettable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_rand_settable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_rand_get_params_fn =
    ::std::option::Option<unsafe extern "C" fn(params: *mut OSSL_PARAM) -> ::std::os::raw::c_int>;
pub type OSSL_FUNC_rand_get_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_set_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_set_callbacks_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        get_entropy: OSSL_INOUT_CALLBACK,
        cleanup_entropy: OSSL_CALLBACK,
        get_nonce: OSSL_INOUT_CALLBACK,
        cleanup_nonce: OSSL_CALLBACK,
        arg: *mut ::std::os::raw::c_void,
    ),
>;
pub type OSSL_FUNC_rand_verify_zeroization_fn = ::std::option::Option<
    unsafe extern "C" fn(vctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_rand_get_seed_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        buffer: *mut *mut ::std::os::raw::c_uchar,
        entropy: ::std::os::raw::c_int,
        min_len: usize,
        max_len: usize,
        prediction_resistance: ::std::os::raw::c_int,
        adin: *const ::std::os::raw::c_uchar,
        adin_len: usize,
    ) -> usize,
>;
pub type OSSL_FUNC_rand_clear_seed_fn = ::std::option::Option<
    unsafe extern "C" fn(
        vctx: *mut ::std::os::raw::c_void,
        buffer: *mut ::std::os::raw::c_uchar,
        b_len: usize,
    ),
>;
pub type OSSL_FUNC_keymgmt_new_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_keymgmt_gen_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        selection: ::std::os::raw::c_int,
        params: *const OSSL_PARAM,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_keymgmt_gen_set_template_fn = ::std::option::Option<
    unsafe extern "C" fn(
        genctx: *mut ::std::os::raw::c_void,
        templ: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_gen_set_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        genctx: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_gen_settable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        genctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_keymgmt_gen_get_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        genctx: *mut ::std::os::raw::c_void,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_gen_gettable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        genctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_keymgmt_gen_fn = ::std::option::Option<
    unsafe extern "C" fn(
        genctx: *mut ::std::os::raw::c_void,
        cb: OSSL_CALLBACK,
        cbarg: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_keymgmt_gen_cleanup_fn =
    ::std::option::Option<unsafe extern "C" fn(genctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_keymgmt_load_fn = ::std::option::Option<
    unsafe extern "C" fn(
        reference: *const ::std::os::raw::c_void,
        reference_sz: usize,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_keymgmt_free_fn =
    ::std::option::Option<unsafe extern "C" fn(keydata: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_keymgmt_get_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        keydata: *mut ::std::os::raw::c_void,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_gettable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_keymgmt_set_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        keydata: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_settable_params_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_keymgmt_query_operation_name_fn = ::std::option::Option<
    unsafe extern "C" fn(operation_id: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char,
>;
pub type OSSL_FUNC_keymgmt_has_fn = ::std::option::Option<
    unsafe extern "C" fn(
        keydata: *const ::std::os::raw::c_void,
        selection: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_validate_fn = ::std::option::Option<
    unsafe extern "C" fn(
        keydata: *const ::std::os::raw::c_void,
        selection: ::std::os::raw::c_int,
        checktype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_match_fn = ::std::option::Option<
    unsafe extern "C" fn(
        keydata1: *const ::std::os::raw::c_void,
        keydata2: *const ::std::os::raw::c_void,
        selection: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_import_fn = ::std::option::Option<
    unsafe extern "C" fn(
        keydata: *mut ::std::os::raw::c_void,
        selection: ::std::os::raw::c_int,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_import_types_fn = ::std::option::Option<
    unsafe extern "C" fn(selection: ::std::os::raw::c_int) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_keymgmt_export_fn = ::std::option::Option<
    unsafe extern "C" fn(
        keydata: *mut ::std::os::raw::c_void,
        selection: ::std::os::raw::c_int,
        param_cb: OSSL_CALLBACK,
        cbarg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keymgmt_export_types_fn = ::std::option::Option<
    unsafe extern "C" fn(selection: ::std::os::raw::c_int) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_keymgmt_dup_fn = ::std::option::Option<
    unsafe extern "C" fn(
        keydata_from: *const ::std::os::raw::c_void,
        selection: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_keymgmt_import_types_ex_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        selection: ::std::os::raw::c_int,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_keymgmt_export_types_ex_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        selection: ::std::os::raw::c_int,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_keyexch_newctx_fn = ::std::option::Option<
    unsafe extern "C" fn(provctx: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_keyexch_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        provkey: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keyexch_derive_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        secret: *mut ::std::os::raw::c_uchar,
        secretlen: *mut usize,
        outlen: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keyexch_set_peer_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        provkey: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keyexch_freectx_fn =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void)>;
pub type OSSL_FUNC_keyexch_dupctx_fn = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_keyexch_set_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keyexch_settable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_keyexch_get_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        params: *mut OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_keyexch_gettable_ctx_params_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        provctx: *mut ::std::os::raw::c_void,
    ) -> *const OSSL_PARAM,
>;
pub type OSSL_FUNC_signature_newctx_fn = ::std::option::Option<
    unsafe extern "C" fn(
        provctx: *mut ::std::os::raw::c_void,
        propq: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type OSSL_FUNC_signature_sign_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        provkey: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_signature_sign_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        sig: *mut ::std::os::raw::c_uchar,
        siglen: *mut usize,
        sigsize: usize,
        tbs: *const ::std::os::raw::c_uchar,
        tbslen: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_signature_sign_message_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        provkey: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_signature_sign_message_update_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        in_: *const ::std::os::raw::c_uchar,
        inlen: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_signature_sign_message_final_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        sig: *mut ::std::os::raw::c_uchar,
        siglen: *mut usize,
        sigsize: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_signature_verify_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        provkey: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_signature_verify_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        sig: *const ::std::os::raw::c_uchar,
        siglen: usize,
        tbs: *const ::std::os::raw::c_uchar,
        tbslen: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_signature_verify_message_init_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        provkey: *mut ::std::os::raw::c_void,
        params: *const OSSL_PARAM,
    ) -> ::std::os::raw::c_int,
>;
pub type OSSL_FUNC_signature_verify_message_update_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        in_: *const ::std::os::raw::c_uchar,
        inlen: usize,
    ) -> ::std::os::raw::c_int,
>;
